Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/extending/processing.po
Languages: fr

source: :index:`Processing Order <processing order>`
fr: :index:`Ordre de traitement <ordre de traitement>`

source: In order to make effective use of plugins and scripts, it is important to understand when each is processed in relation to the others. As a general statement, plugins are always processed before scripts. Plugins of the same type will be executed in order based upon the priority specified when the plugin was registered.
fr: Afin d'utiliser efficacement les plugins et les scripts, il est important de comprendre quand chacun est traité par rapport aux autres. En règle générale, les plugins sont toujours traités avant les scripts. Les plugins du même type seront exécutés dans l'ordre en fonction de la priorité spécifiée lors de l'enregistrement du plugin.

source: Startup
fr: Commencez

source: During program startup, plugins with the following hooks are processed, and any additional functionality that they provide will be available immediately:
fr: Au démarrage du programme, les plugins avec les hooks suivants sont traités et toutes les fonctionnalités supplémentaires qu'ils fournissent seront disponibles immédiatement:

source: File Formats
fr: Formats de fichier

source: Cover Art Providers
fr: Fournisseurs d'art de couverture

source: Tagger Script Functions
fr: Fonctions de script de tagger

source: Context Menu Actions
fr: Actions du menu contextuel

source: Option Pages
fr: Pages d'options

source: Loading a Release
fr: Chargement d'une version

source: When data gets loaded from MusicBrainz (while the album shows the "loading" status in the right-hand pane), the following are processed:
fr: Lorsque les données sont chargées à partir de MusicBrainz (alors que l'album affiche l'état de "chargement" dans le volet de droite), les éléments suivants sont traités:

source: Metadata Processor Plugins
fr: Plugins du processeur de métadonnées

source: Tagging Scripts
fr: Balisage des scripts

source: Plugins have access to the raw data loaded from MusicBrainz and are processed before scripts, in the order of priority set when the plugin was registered.
fr: Les plugins ont accès aux données brutes chargées depuis MusicBrainz et sont traités avant les scripts, dans l'ordre de priorité défini lors de l'enregistrement du plugin.

source: Scripts are processed in the order set in the Options menu.
fr: Les scripts sont traités dans l'ordre défini dans le menu Options.

source: Tagging scripts are always run against metadata loaded from MusicBrainz, and exactly after the data gets loaded and before files get matched. They are one of the last steps in the loading process. Tagging scripts do not have access to metadata stored in existing files.
fr: Les scripts de balisage sont toujours exécutés sur les métadonnées chargées depuis MusicBrainz, et exactement après le chargement des données et avant que les fichiers ne soient mis en correspondance. Ils sont l'une des dernières étapes du processus de chargement. Les scripts de balisage n'ont pas accès aux métadonnées stockées dans les fichiers existants.

source: Loading Music Files
fr: Chargement de fichiers musicaux

source: After a file has been loaded into Picard, plugins registered with ``file_post_load_processor()`` are executed. This could, for example, be used to load additional data for a file.
fr: Après le chargement d'un fichier dans Picard, les plugins enregistrés avec ``file_post_load_processor()`` sont exécutés. Cela pourrait, par exemple, être utilisé pour charger des données supplémentaires pour un fichier.

source: Adding / Removing Files
fr: Ajout / suppression de fichiers

source: After a file has been added to a track (on the right-hand pane of Picard), plugins registered with ``file_post_addition_to_track_processor()`` are executed.
fr: Après qu'un fichier a été ajouté à une piste (sur le volet de droite de Picard), les plugins enregistrés avec ``file_post_addition_to_track_processor()`` sont exécutés.

source: After a file has been removed from a track (on the right-hand pane of Picard), plugins registered with ``file_post_removal_from_track_processor()`` are executed.
fr: Après qu'un fichier a été supprimé d'une piste (sur le volet droit de Picard), les plugins enregistrés avec ``file_post_removal_from_track_processor()`` sont exécutés.

source: Saving Files
fr: Sauvegarde des fichiers

source: When files are saved, for each file the File Naming Script is first executed to determine the destination path and file name. Note that this script has no effect on the tag values written to the output file.
fr: Lorsque les fichiers sont enregistrés, pour chaque fichier, le script de dénomination de fichier est d'abord exécuté pour déterminer le chemin de destination et le nom du fichier. Notez que ce script n'a aucun effet sur les valeurs de balises écrites dans le fichier de sortie.

source: After a file has been saved, plugins registered with ``file_post_save_processor()`` are executed. This can, for example, be used to run additional post-processing on the file or write extra data. Note that the file's metadata is already the newly saved metadata.
fr: Une fois qu'un fichier a été enregistré, les plugins enregistrés avec ``file_post_save_processor()`` sont exécutés. Cela peut, par exemple, être utilisé pour exécuter un post-traitement supplémentaire sur le fichier ou écrire des données supplémentaires. Notez que les métadonnées du fichier sont déjà les métadonnées nouvellement enregistrées.

source: Removing Albums
fr: Suppression d'albums

source: After an album has been removed from Picard, plugins registered with ``album_post_removal_processor()`` are executed.
fr: Après qu'un album a été supprimé de Picard, les plugins enregistrés avec ``album_post_removal_processor()`` sont exécutés.

source: Context Menus
fr: Menus contextuels

source: Individual tagging scripts can be executed on-demand from the context menu displayed when right-clicking on a file, album, track, cluster or cluster list.
fr: Les scripts de balisage individuels peuvent être exécutés à la demande à partir du menu contextuel affiché lors d'un clic droit sur un fichier, un album, une piste, un cluster ou une liste de cluster.
