Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/extending/scripts.po
Languages: fr

source: There are two types of scripts used in Picard: the file naming script and tagging scripts. These are managed from the "File Naming" and "Scripting" sections of the :menuselection:`"Options --> Options..."` menu. All scripts are written using the :doc:`Picard scripting language <scripting>`. Scripts are often discussed in the `MetaBrainz Community Forum <https://community.metabrainz.org/c/picard>`_, and there is a thread specific to `file naming and script snippets <https://community.metabrainz.org/t/repository-for-neat-file-name-string-patterns-and-tagger-script-snippets/2786/>`_.
fr: Il existe deux types de scripts utilisés dans Picard: le script de nommage des fichiers et les scripts de marquage. Ils sont gérés à partir des sections "Nommage des fichiers" et "Scripting" du menu :menuselection:`"Options --> Options..."`. Tous les scripts sont écrits en utilisant le :doc:`Langage de script Picard <scripting>`. Les scripts sont souvent discutés dans le `Forum communautaire de MetaBrainz <https://community.metabrainz.org/c/picard>`_, et il y a un fil spécifique au `nommage des fichiers et aux extraits de scripts <https://community.metabrainz.org/t/repository-for-neat-file-name-string-patterns-and-tagger-script-snippets/2786/>`_.

source: :index:`File Naming Script <pair: file naming; scripts>`
fr: :index:`Script de dénomination de fichier <pair: nom de fichier; scripts>`

source: There is only one file naming script defined in a user’s settings, although it can vary from a simple one-line script such as ``%album%/%title%`` to a very complex script using different file naming formats based on different criteria. In all cases, the files will be saved using the text output by the script.
fr: Il n'y a qu'un seul script de dénomination de fichier défini dans les paramètres d'un utilisateur, bien qu'il puisse varier d'un simple script sur une ligne tel que ``%album%/%title%`` à un script très complexe utilisant différents formats de dénomination de fichier basés sur différents Critères. Dans tous les cas, les fichiers seront enregistrés en utilisant le texte sorti par le script.

source: Any new tags set or tags modified by the file naming script will not be written to the output files' metadata.
fr: Les nouveaux ensembles de balises ou les balises modifiées par le script de dénomination de fichier ne seront pas écrites dans les métadonnées des fichiers de sortie.

source: :index:`Tagging Scripts <pair: tagging; scripts>`
fr: :index:`Scripts de balisage <pair: balisage; scripts>`

source: There can be multiple tagging scripts defined in a user’s settings. Individual scripts can be enabled or disabled, and the order of execution of the scripts can be set. Whenever a script is run automatically (i.e.: when an album is loaded), it is processed once for each track in the album that triggered the run. For example, if there are two tagging scripts enabled (A and B) and an album with three tracks is loaded, the scripts will be processed in the following order:
fr: Plusieurs scripts de balisage peuvent être définis dans les paramètres d’un utilisateur. Des scripts individuels peuvent être activés ou désactivés, et l'ordre d'exécution des scripts peut être défini. Chaque fois qu'un script est exécuté automatiquement (c'est-à-dire lorsqu'un album est chargé), il est traité une fois pour chaque piste de l'album qui a déclenché la lecture. Par exemple, si deux scripts de balisage sont activés (A et B) et qu'un album avec trois pistes est chargé, les scripts seront traités dans l'ordre suivant:

source: Metadata updates are not shared between tracks, so you cannot append data from one track to a tag in another track.
fr: Les mises à jour des métadonnées ne sont pas partagées entre les pistes, vous ne pouvez donc pas ajouter de données d'une piste à une balise dans une autre piste.

source: Any new tags set or tags modified by the tagging scripts will be written to the output files' metadata, unless the tag name begins with an underscore. These "hidden" tags are typically used as variables to hold temporary values that are used later in either the tagging or file naming scripts. Tagging scripts are run once for each track in the data, using the metadata for that track.
fr: Tout nouveau jeu de balises ou balises modifiées par les scripts de balisage sera écrit dans les métadonnées des fichiers de sortie, sauf si le nom de balise commence par un trait de soulignement. Ces balises "masquées" sont généralement utilisées comme variables pour contenir des valeurs temporaires qui seront utilisées ultérieurement dans les scripts de balisage ou de dénomination de fichier. Les scripts de balisage sont exécutés une fois pour chaque piste dans les données, en utilisant les métadonnées de cette piste.

source: Tagging scripts can also be run manually by right-clicking either an album or a track in the right-hand pane in Picard. If run from the album entry, the script is run for each track in the album. If run from an individual track, the script is only run for that track.
fr: Les scripts de balisage peuvent également être exécutés manuellement en cliquant avec le bouton droit sur un album ou une piste dans le volet de droite de Picard. S'il est exécuté à partir de l'entrée de l'album, le script est exécuté pour chaque piste de l'album. S'il est exécuté à partir d'une piste individuelle, le script n'est exécuté que pour cette piste.

source: Tagging Script Examples
fr: Exemples de scripts de marquage

source: The following scripting examples show how tagger scripts can be used to solve some specific use cases. Please refer to :doc:`Picard scripting language <scripting>` for a detailed description of the variables and functions used in these examples.
fr: Les exemples de script suivants montrent comment les scripts du tagger peuvent être utilisés pour résoudre certains cas d'utilisation spécifiques. Veuillez vous référer à :doc:`Langage de script Picard <scripting>` pour une description détaillée des variables et des fonctions utilisées dans ces exemples.

source: Move disambiguation to album title
fr: Déplacer la désambiguïsation vers le titre de l'album

source: Append the disambiguation comment of a release to the album title:
fr: Ajoute le commentaire de désambiguïsation d'une sortie au titre de l'album:

source: Release language as language
fr: Libérer la langue en tant que langue

source: The ``%_releaselanguage%`` variable specifies the language of the track listing, whereas the ``%language%`` variable is supposed to be the lyrics language. The following script will use the ``%_releaselanguage%`` instead if ``%language%`` is empty:
fr: La variable ``%_releaselanguage%`` spécifie la langue de la liste des pistes, alors que la variable ``%language%`` est supposée être la langue des paroles. Le script suivant utilisera la variable ``%_releaselanguage%`` à la place si ``%language%`` est vide:

source: Use original release date
fr: Utiliser la date de sortie originale

source: By default Picard provides a tag ``date`` which holds the release date of a specific release and ``originaldate`` which provides the earliest release date of this release. For example you might have a 2020 reissue of an album that originally was released in 1992. In this case ``date`` will be set to "2020" and ``originaldate`` to "1992". If you prefer to have always the original release date as the primary date in your file's tags you could use the following script:
fr: Par défaut, Picard fournit un tag ``date`` qui contient la date de sortie d'une version spécifique et ``originaldate`` qui fournit la date de sortie la plus ancienne de cette version. Par exemple, vous pouvez avoir une réédition en 2020 d'un album qui est sorti en 1992. Dans ce cas, ``date`` sera mis à "2020" et ``originaldate`` à "1992". Si vous préférez avoir toujours la date de sortie originale comme date principale dans les balises de votre fichier, vous pouvez utiliser le script suivant:

source: The use of :ref:`func_if2` ensures that if ``originaldate`` is empty it will fall back to ``date``.
fr: L'utilisation de :ref:`func_if2` garantit que si ``originaldate`` est vide, il reviendra à ``date``.

source: In addition Picard provides a variable ``%_recording_firstreleasedate%``, which tries to provide the first release date per recording (which can be different for each track in a release). If you prefer this you can use the following script:
fr: De plus, Picard fournit une variable ``%_recording_firstreleasedate%``, qui essaie de fournir la première date de sortie par enregistrement (qui peut être différente pour chaque piste dans une sortie). Si vous préférez cela, vous pouvez utiliser le script suivant:

source: Or if you want to keep the ``date`` for the actual release date of the specific release, but use the recording's first release date as ``originaldate``:
fr: Ou si vous voulez garder le ``date`` pour la date de sortie réelle de la version spécifique, mais utiliser la date de première sortie de l'enregistrement comme ``originaldate``:

source: Set album sort name
fr: Définir le nom de tri de l'album

source: The ``albumsort`` tag is not filled by Picard by default. You can set it to a meaningful value with prefixes "The" and "A" moved to the end with the following script:
fr: La balise ``albumsort`` n'est pas remplie par Picard par défaut. Vous pouvez lui donner une valeur significative avec les préfixes "The" et "A" déplacés à la fin avec le script suivant:

source: This will e.g. set the sort name for the release "The Best of Muddy Waters" to "Best of Muddy Waters, The".
fr: Par exemple, le nom de tri de la version "The Best of Muddy Waters" deviendra "Best of Muddy Waters, The".

source: Set compilation for multi artist releases
fr: Définir la compilation pour les sorties multi-artistes

source: By default the ``compilation`` tag will be set to 1 only for Various Artists releases. The following script will set it for all releases with more than one artist (as it was default behavior in Picard 1.2 and earlier):
fr: Par défaut, la balise ``compilation`` sera mise à 1 uniquement pour les sorties Various Artists. Le script suivant le définira pour toutes les sorties avec plus d'un artiste (comme c'était le comportement par défaut dans Picard 1.2 et antérieur):

source: Remove featuring from album artist
fr: Supprimer le featuring de l'artiste de l'album

source: This always removes featuring artists from the album artist:
fr: Cela supprime toujours les artistes en vedette de l'artiste de l'album:

source: Move featuring from artist to title
fr: Déplacer le featuring de l'artiste au titre

source: According to MusicBrainz guidelines featuring artists are part of the artist name, e.g. "Artist A feat. Artist B". Some users prefer to have featuring added to the album or track title instead. The following script moves featured track artists to the track title:
fr: Selon les directives de MusicBrainz, les artistes en featuring font partie du nom de l'artiste, par exemple "Artist A feat. Artist B". Certains utilisateurs préfèrent que le featuring soit ajouté au titre de l'album ou de la piste. Le script suivant déplace les artistes en vedette vers le titre de la piste:

source: The same can be done for moving featured artists from the album artist to the album title:
fr: On peut faire de même pour déplacer les artistes vedettes de l'artiste de l'album au titre de l'album:

source: Preserve original filename
fr: Conserver le nom de fichier original

source: The ``originalfilename`` tag is supposed to hold the filename the file originally had. By default Picard does not set or modify this tag. If you want to save this information the following Script can be used:
fr: La balise ``originalfilename`` est censée contenir le nom de fichier que le fichier avait à l'origine. Par défaut, Picard ne définit ni ne modifie cette balise. Si vous voulez sauvegarder cette information, le script suivant peut être utilisé:

source: This will keep any existing ``originalfilename`` tag. But if this tag is not yet present the tag will be set to the current filename. As this happens before the file is being saved the original name of the file before Picard modifies it can be preserved.
fr: Ceci gardera toute balise existante ``originalfilename``. Mais si cette balise n'est pas encore présente, elle sera remplacée par le nom du fichier courant. Comme cela se produit avant que le fichier ne soit enregistré, le nom original du fichier avant que Picard ne le modifie peut être préservé.
