Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/extending/scripting.po
Languages: fr

source: :index:`Scripting <scripts>`
fr: :index:`Script <scripts>`

source: Scripts are used to control some aspects of the operation of Picard.
fr: Les scripts sont utilisés pour contrôler certains aspects du fonctionnement de Picard.

source: There are two types of scripts used in Picard: the file naming script and tagging scripts. These are managed from the "File Naming" and "Scripting" sections of the :menuselection:`"Options --> Options..."` menu.
fr: Il existe deux types de scripts utilisés dans Picard: le script de dénomination de fichier et les scripts de balisage. Ceux-ci sont gérés à partir des sections "Nom du fichier" et "Script" du menu :menuselection:`"Options --> Options..."`.

source: Scripts are often discussed in the `MetaBrainz Community Forum <https://community.metabrainz.org/>`_, and there is a thread specific to `file naming and script snippets <https://community.metabrainz.org/t/repository-for-neat-file-name-string-patterns-and-tagger-script-snippets/2786/>`_.
fr: Les scripts sont souvent abordés dans le `MetaBrainz Community Forum <https://community.metabrainz.org/>`_, et il existe un fil de discussion spécifique à `la dénomination de fichier et les extraits de script <https://community.metabrainz.org/t/repository-for-neat-file-name-string-patterns-and-tagger-script-snippets/2786/>`_.

source: Please refer to the section on :doc:`Scripts <scripts>` in :doc:`Extending Picard <extending>` for additional details about the two types of scripts, including how and when each of the scripts are executed.
fr: Veuillez vous référer à la section sur :doc:`Scripts <scripts>` dans :doc:`Extending Picard <extending>` pour plus de détails sur les deux types de scripts, y compris comment et quand chacun des scripts est exécuté.

source: :index:`Syntax <scripts; syntax>`
fr: :index:`Syntaxe <scripts; syntaxe>`

source: The syntax is derived from `Foobar2000's titleformat <https://wiki.hydrogenaud.io/index.php?title=Foobar2000:Titleformat_Reference>`_. There are three base elements: text, variable and function. Variables consist of alphanumeric characters enclosed in percent signs (e.g.: ``%artist%``). Functions start with a dollar sign and end with an argument list enclosed in parentheses (e.g.: ``$lower(...)``).
fr: La syntaxe est dérivée du `format de titre de Foobar2000 <https://wiki.hydrogenaud.io/index.php?title=Foobar2000:Titleformat_Reference>`_. Il existe trois éléments de base: le texte, la variable et la fonction. Les variables sont constituées de caractères alphanumériques entourés de signes de pourcentage (par exemple: ``%artiste%``). Les fonctions commencent par un signe dollar et se terminent par une liste d'arguments entre parenthèses (par exemple: ``$lower(...)``).

source: When entering input strings into Picard scripts you have to escape a backslash "\\", dollar sign "$", comma "," and the left and right parentheses "(" and ")" in order to force Picard to not interpret them as part of the script command. This is done by inserting a backslash before the character to be escaped. For example, to set a tag value to ``($1,000,000)`` it would have to be entered as ``$set(test_tag,\(\$1\,000\,000\))``.
fr: Lorsque vous entrez des chaînes d'entrée dans des scripts Picard, vous devez échapper une barre oblique inverse "\\", un signe dollar "$", une virgule "," et les parenthèses gauche et droite "(" et ")" afin de forcer Picard à ne pas les interpréter dans le cadre de la commande de script. Cela se fait en insérant une barre oblique inverse avant le caractère à échapper. Par exemple, pour définir une valeur de balise sur ``($1,000,000)``, il faudrait la saisir sous la forme ``$set(test_tag,\(\$1\,000\,000\))``.

source: Usually you can access the values of a tag by the proper variable name. For example, if your tag is called "rerecorded" you can use ``%rerecorded%``. But the hyphen is not a valid character for a script variable, so ``%re-recorded%`` gives a syntax error. In cases like this you need to use ``$get(re-recorded)``.
fr: En général, vous pouvez accéder aux valeurs d'une balise par le nom de variable approprié. Par exemple, si votre balise s'appelle "rerecorded", vous pouvez utiliser ``%rerecorded%``. Mais le trait d'union n'est pas un caractère valide pour une variable de script, donc ``%re-recorded%`` donne une erreur de syntaxe. Dans des cas comme celui-ci, vous devez utiliser ``$get(re-recorded)``.

source: Metadata Variables
fr: Variables de métadonnées

source: See :doc:`../variables/variables` for the list of the variables provided by Picard.
fr: Voir :doc:`../variables/variables` pour la liste des variables fournies par Picard.

source: Picard's variables can be either simple variables containing a single text string, or multi-value variables containing multiple text strings. In scripts, multi-value variables are automatically converted to a single text string by joining the values with a semicolon ";", except when used with special multi-value functions.
fr: Les variables de Picard peuvent être soit de simples variables contenant une seule chaîne de texte, soit des variables à valeurs multiples contenant plusieurs chaînes de texte. Dans les scripts, les variables à valeurs multiples sont automatiquement converties en une seule chaîne de texte en joignant les valeurs par un point-virgule ';', sauf lorsqu'elles sont utilisées avec des fonctions spéciales à valeurs multiples.

source: The full list of available scripting functions is covered in the following chapter.
fr: La liste complète des fonctions de script disponibles est couverte dans le chapitre suivant.

source: Scripting Functions
fr: Fonctions de script

source: The full list of available scripting functions is available, either :doc:`sorted alphabetically <../functions/list_by_name>` or :doc:`grouped by function type <../functions/list_by_type>`.
fr: La liste complète des fonctions de script disponibles est disponible, soit :doc:`trié par ordre alphabétique <../functions/list_by_name>` ou :doc:`groupé par type de fonction <../functions/list_by_type>`.
