Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/getting_started/download.po
Languages: fr

source: :index:`Download & Install Picard <install; download>`
fr: :index:`Téléchargez et installez Picard <installation; télécharger>`

source: MusicBrainz Picard is available for all major desktop operating systems (e.g. Windows, Linux and macOS), and in multiple forms (directly downloadable formal release executables, package manager versions of these, daily build executables, Python source code that you can execute with your own Python environment, etc.)
fr: MusicBrainz Picard est disponible pour tous les principaux systèmes d'exploitation de bureau (par exemple Windows, Linux et macOS), et sous plusieurs formes (exécutables de version formelle directement téléchargeables, versions de gestionnaire de packages de ceux-ci, exécutables de construction quotidiens, code source Python que vous pouvez exécuter avec le vôtre Environnement Python, etc.)

source: It is expected that most users will run formal release executables or package manager equivalents as these are easy to install, and are stable versions which are less likely to have bugs in experimental or new functionality.
fr: On s'attend à ce que la plupart des utilisateurs exécutent des exécutables de version formelle ou des équivalents de gestionnaire de paquets car ils sont faciles à installer et sont des versions stables qui sont moins susceptibles d'avoir des bogues dans les fonctionnalités expérimentales ou nouvelles.

source: However, any users wishing to contribute to the development of Picard or its Plugins may want to run from source code, downloading it from GitHub using a version of Git on their own computer. If you want to contribute to the Picard code but you don't understand what the previous sentence said, then you have a bit of a learning curve. :-)
fr: Cependant, tout utilisateur souhaitant contribuer au développement de Picard ou de ses plugins peut vouloir exécuter à partir du code source, en le téléchargeant depuis GitHub en utilisant une version de Git sur son propre ordinateur. Si vous souhaitez contribuer au code Picard mais que vous ne comprenez pas ce que disait la phrase précédente, alors vous avez un peu de courbe d'apprentissage. :-)

source: The latest version of MusicBrainz Picard is always available for download from the `Picard Website <https://picard.musicbrainz.org/downloads/>`_. This includes installers for all supported platforms as well as `release source code <https://picard.musicbrainz.org/downloads/#source>`_. The very latest source code is also available at the `GitHub repository <https://github.com/musicbrainz/picard>`_.
fr: La dernière version de MusicBrainz Picard est toujours disponible au téléchargement sur `le site Web de Picard <https://picard.musicbrainz.org/downloads/>`_. Cela inclut les programmes d'installation pour toutes les plates-formes prises en charge ainsi que `le code source de la version <https://picard.musicbrainz.org/downloads/#source>`_. Le tout dernier code source est également disponible dans `le référentiel GitHub <https://github.com/musicbrainz/picard>`_.

source: Installing Picard on Linux
fr: Installation de Picard sous Linux

source: :index:`Installing with Flatpak <pair: install; flatpak>`
fr: :index:`Installation avec Flatpak <pair: installation; flatpak>`

source: Picard is available on `Flathub <https://flathub.org/apps/details/org.musicbrainz.Picard>`_. This version should work on all modern Linux distributions, as long as Flatpak is installed (see `Flatpak Quick Setup <https://flatpak.org/setup/>`_).
fr: Picard est disponible sur `Flathub <https://flathub.org/apps/details/org.musicbrainz.Picard>`_. Cette version devrait fonctionner sur toutes les distributions Linux modernes, à condition que Flatpak soit installé (voir `Installation rapide du Flatpak <https://flatpak.org/setup/>`_).

source: First enable the Flathub repository:
fr: Commencez par activer le référentiel Flathub:

source: You can now install Picard:
fr: Vous pouvez maintenant installer Picard:

source: :index:`Installing with Snap <pair: install; snap>`
fr: :index:`Installation avec Snap <pair: installation; snap>`

source: Picard is available as a Snap from the Snap Store. This version should work on all modern Linux distributions, as long as Snap is installed (see `Installing Snap <https://snapcraft.io/docs/installing-snapd>`_).
fr: Picard est également disponible sur Snap. Cette version devrait fonctionner sur toutes les distributions Linux modernes, tant que Snap est installé (voir `Installation de Snap <https://snapcraft.io/docs/installing-snapd>`_).

source: The `Snap Store page of Picard <https://snapcraft.io/picard>`_ gives detailed instructions on how to install Picard on various Linux distributions. If your Linux distributions supports it you can install Picard from your distribution's software center, e.g. Ubuntu Software or KDE Discover. You can also install Picard from the terminal:
fr: La page `Snap Store de Picard <https://snapcraft.io/picard>`_ donne des instructions détaillées sur la façon d'installer Picard sur diverses distributions Linux. Si votre distribution Linux le supporte, vous pouvez installer Picard depuis le centre logiciel de votre distribution, par exemple Ubuntu Software ou KDE Discover. Vous pouvez également installer Picard à partir du terminal:

source: Picard installed as a Snap is running inside a sandbox and thus it does not have full access to all files and folders on your system. By default Picard has access to your home folder. You can additionally give it access to removable media by running the following command on a terminal:
fr: Picard installé en tant que Snap s'exécute dans un bac à sable et n'a donc pas un accès complet à tous les fichiers et dossiers de votre système. Par défaut, Picard a accès à votre dossier personnel. Vous pouvez en outre lui donner accès à un support amovible en exécutant la commande suivante sur un terminal:

source: :index:`Installing from your distribution's package repository <pair: install; Linux package>`
fr: :index:`Installation à partir du référentiel de packages de votre distribution <pair: install; Paquet Linux>`

source: Picard is available in the package repositories of most distributions. The `download page <https://picard.musicbrainz.org/downloads/#linux>`_ provides links to the packages for common Linux distributions. Please refer to your distribution's documentation for how to install software packages.
fr: Picard est disponible dans les référentiels de paquets de la plupart des distributions. La `page de téléchargement <https://picard.musicbrainz.org/downloads/#linux>`_ fournit des liens vers les packages pour les distributions Linux courantes. Veuillez consulter la documentation de votre distribution pour savoir comment installer les packages logiciels.

source: Please note that most distributions usually ship older versions of Picard. If you want to use the latest available version, as is recommended, install Picard as Flatpak or Snap as described above.
fr: Veuillez noter que la plupart des distributions contiennent généralement des versions plus anciennes de Picard. Si vous souhaitez utiliser la dernière version disponible, comme cela est recommandé, installez Picard en tant que Flatpak ou Snap comme décrit ci-dessus.
