Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/getting_started/screen_main.po
Languages: fr

source: :index:`Main Screen <user interface; main screen>`
fr: :index:`Écran principal <interface utilisateur; écran principal>`

source: **Menu Bar**: This provides the pull-down menu of actions that Picard can perform.
fr: **Barre de menus**: Ceci fournit le menu déroulant des actions que Picard peut effectuer.

source: **Tool Bar**: This provides quick links to the main functions performed by Picard. This can be customized by the user in the :doc:`User Interface Options <../config/options_interface>` settings.
fr: **Barre d'outils**: Ceci fournit des liens rapides vers les principales fonctions exécutées par Picard. Ceci peut être personnalisé par l'utilisateur dans les paramètres :doc:`User Interface Options <../config/options_interface>`.

source: **File Browser**: This provides a browser for selecting files and directories for processing.
fr: **Navigateur de fichiers**: Ceci fournit un navigateur pour sélectionner les fichiers et répertoires à traiter.

source: **Cluster Pane**: Often referred to as the "left-hand pane", this section allows the user to select and cluster files for scanning, lookup or matching.
fr: **Volet de cluster**: Souvent appelé "volet de gauche", cette section permet à l'utilisateur de sélectionner et de regrouper les fichiers pour l'analyse, la recherche ou la mise en correspondance.

source: **Album Pane**: Often referred to as the "right-hand pane", this section displays the albums retrieved from MusicBrainz. This is the section where files are matched to downloaded track information.
fr: **Volet Album**: Souvent appelé "volet de droite", cette section affiche les albums extraits de MusicBrainz. C'est la section où les fichiers sont mis en correspondance avec les informations de piste téléchargées.

source: **Metadata Pane**: This section is a three-column table of the tag metadata for the album or track currently selected in the Album Pane. The first column shows the tag name, the second shows the original value found in the file, and the third column shows the new value that will be written.
fr: **Volet Métadonnées**: Cette section est un tableau à trois colonnes des métadonnées de balise pour l'album ou la piste actuellement sélectionné dans le volet Album. La première colonne affiche le nom de la balise, la seconde la valeur d'origine trouvée dans le fichier et la troisième colonne affiche la nouvelle valeur qui sera écrite.

source: **Cover Art**: This shows the new cover art image that will be written to the selected album or track, along with the original cover art image found in the files matched to the selected album or track.
fr: **Pochette**: Ceci montre la nouvelle image de la pochette qui sera écrite dans l'album ou la piste sélectionné, ainsi que l'image de la pochette d'origine trouvée dans les fichiers correspondant à l'album ou à la piste sélectionné.

source: **Player**: The built-in player that can be used to play selected audio files.
fr: **Lecteur de musique**: Le lecteur intégré qui peut être utilisé pour lire des fichiers audio sélectionnés.

source: **Status Bar**: The bar at the bottom of the screen shows information about the current operation of Picard, including such items as number of files, albums, and pending downloads. |nl|
fr: **Barre d'état**: La barre en bas de l'écran affiche des informations sur le fonctionnement actuel de Picard, y compris des éléments tels que le nombre de fichiers, d'albums et de téléchargements en attente. |nl|

source: Picard is available for different operating systems. And while Picard's functionality is overall the same the specific look of the user interface can be slightly different based on the operating system. Throughout the documentation screenshots taken on different operating systems are used. Below you find a selection of screenshots of Picard's main screen on different systems:
fr: Picard est disponible pour différents systèmes d'exploitation. Et bien que les fonctionnalités de Picard soient globalement les mêmes, l'aspect spécifique de l'interface utilisateur peut être légèrement différent en fonction du système d'exploitation. Tout au long de la documentation, des captures d'écran prises sur différents systèmes d'exploitation sont utilisées. Vous trouverez ci-dessous une sélection de captures d'écran de l'écran principal de Picard sur différents systèmes:

source: Picard on Windows 10 (with light user interface)
fr: Picard sur Windows 10 (avec interface utilisateur légère)

source: Picard on Windows 10 (with dark user interface)
fr: Picard sur Windows 10 (avec une interface utilisateur sombre)

source: Picard on macOS
fr: Picard sur macOS

source: Picard on macOS (dark mode)
fr: Picard sur macOS (mode sombre)

source: Picard on Linux with the KDE Plasma desktop environment (light theme)
fr: Picard sous Linux avec l'environnement de bureau KDE Plasma (thème clair)

source: Picard on Linux with the KDE Plasma desktop environment (dark theme)
fr: Picard sous Linux avec l'environnement de bureau KDE Plasma (thème sombre)

source: Picard on Linux with the GNOME desktop environment
fr: Picard sous Linux avec l'environnement de bureau GNOME

source: Picard on Windows 7
fr: Picard sur Windows 7

source: Picard on Haiku
fr: Picard sur Haiku
