Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/getting_started/status_icons.po
Languages: fr

source: :index:`Status Icons <icons; status>`
fr: :index:`Icônes d'état <icônes d'état>`

source: When albums and tracks are displayed in the right-hand pane, each line begins with an icon to indicate the status of the item.
fr: Lorsque les albums et les pistes sont affichés dans le volet de droite, chaque ligne commence par une icône pour indiquer l'état de l'élément.

source: :index:`Album / Release Icons <icons; album, icons; release>`
fr: :index:`Icônes d'album / de sortie <icônes; album, icônes; libération>`

source: This icon indicates that the information for the release has been successfully retrieved from the MusicBrainz database. Some, but not all, tracks may have been matched to files and the information has not been modified.
fr: Cette icône indique que les informations relatives à la version ont été récupérées avec succès dans la base de données MusicBrainz. Certaines pistes, mais pas toutes, peuvent avoir été associées à des fichiers et les informations n'ont pas été modifiées.

source: This icon indicates that some of the tracks have been matched and that the information for the release has been modified.
fr: Cette icône indique que certaines des pistes ont été mises en correspondance et que les informations de la version ont été modifiées.

source: This icon indicates that all of the tracks have been matched and that the information has not been modified.
fr: Cette icône indique que toutes les pistes ont été mises en correspondance et que les informations n'ont pas été modifiées.

source: This icon indicates that all of the tracks have been matched and that the information for the release has been modified.
fr: Cette icône indique que toutes les pistes ont été mises en correspondance et que les informations de la version ont été modifiées.

source: This icon indicates that Picard has encountered an error with the release, typically while retrieving the information from the MusicBrainz database.
fr: Cette icône indique que Picard a rencontré une erreur avec la version, généralement lors de la récupération des informations de la base de données MusicBrainz.

source: :index:`Track Icons <icons; track>`
fr: :index:`Icônes de piste <icônes de piste>`

source: This icon indicates that the track is an audio track and that there is no single file currently matched. This appears if there is no file matched, of if there are multiple files matched.
fr: Cette icône indique que la piste est une piste audio et qu'aucun fichier ne correspond actuellement. Cela apparaît s'il n'y a pas de fichier correspondant, ou si plusieurs fichiers correspondent.

source: This icon indicates that the track is a video track and that there is no file currently matched. This appears if there is no file matched, of if there are multiple files matched.
fr: Cette icône indique que la piste est une piste vidéo et qu'aucun fichier ne correspond actuellement. Cela apparaît s'il n'y a pas de fichier correspondant, ou si plusieurs fichiers correspondent.

source: This icon indicates that the track is a data track and that there is no file currently matched. This appears if there is no file matched, of if there are multiple files matched.
fr: Cette icône indique que la piste est une piste de données et qu'aucun fichier ne correspond actuellement. Cela apparaît s'il n'y a pas de fichier correspondant, ou si plusieurs fichiers correspondent.

source: These icons indicates the quality of match between the information from the file and the information for the track as provided from the MusicBrainz database. Red indicates a poor match, progressing to all green which indicates a very good match.
fr: Ces icônes indiquent la qualité de la correspondance entre les informations du fichier et les informations de la piste fournies par la base de données MusicBrainz. Le rouge indique une mauvaise correspondance, passant à tout le vert, ce qui indique une très bonne correspondance.

source: This icon indicates that the track has been saved successfully.
fr: Cette icône indique que la trace a été enregistrée avec succès.

source: This icon indicates that Picard encountered an error while trying to save the track. This is typically due to the file being marked as read-only, or you do not have sufficient permission to save the file in the specified directory.
fr: Cette icône indique que Picard a rencontré une erreur en essayant de sauvegarder la trace. Cela est généralement dû au fait que le fichier est marqué en lecture seule ou que vous ne disposez pas des autorisations suffisantes pour enregistrer le fichier dans le répertoire spécifié.

source: :index:`Status Bar <icons; status bar, status bar>`
fr: :index:`Barre d'état <icônes ; barre d'état, barre d'état>`

source: There is a status bar at the bottom of Picard's main screen, which displays some information about current processing status. This includes four numbers along with the current port number that Picard is monitoring.
fr: Il y a une barre d'état en bas de l'écran principal de Picard, qui affiche quelques informations sur l'état actuel du traitement. Cela inclut quatre chiffres ainsi que le numéro du port actuel que Picard surveille.

source: From left to right, the four numbers represent:
fr: De gauche à droite, les quatre chiffres représentent:

source: The number of files loaded.
fr: Le nombre de fichiers chargés.

source: The number of MusicBrainz releases loaded.
fr: Le nombre de versions de MusicBrainz chargées.

source: The number of files with pending action (e.g. loading, saving, fingerprinting).
fr: Le nombre de fichiers en attente d'une action (par exemple, chargement, sauvegarde, prise d'empreinte).

source: The number of active network requests.
fr: Le nombre de demandes de réseau actives.

source: You can tell whether or not Picard is currently processing your files by looking at the numbers for pending files and pending network requests. If both are 0 nothing is pending and processing is complete.
fr: Vous pouvez savoir si Picard est ou non en train de traiter vos fichiers en regardant les nombres de fichiers en attente et de requêtes réseau en attente. Si les deux sont à 0, rien n'est en attente et le traitement est terminé.
