Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/faq/faq_file_formats.po
Languages: fr

source: :index:`File Formats <file formats>`
fr: :index:`Formats de fichiers <format de fichier>`

source: What formats does Picard support?
fr: Quels formats Picard prend-il en charge?

source: Picard supports the following file formats:
fr: Picard prend en charge les formats de fichiers suivants:

source: Generic Ogg files (.ogg, .ogx)
fr: Fichiers génériques Ogg (.ogg, .ogx)

source: WAVE files lack a standard for proper tagging. Picard uses ID3v2 tags to tag WAVE files, but this is not supported by all software. For compatibility with software which does not support ID3v2 tags in WAVE files additional RIFF INFO tags can be written to the files. RIFF INFO has only limited support for tags and character encodings.
fr: Les fichiers WAVE n'ont pas de norme pour un marquage approprié. Picard utilise des balises ID3v2 pour baliser les fichiers WAVE, mais cela n'est pas pris en charge par tous les logiciels. Pour assurer la compatibilité avec un logiciel qui ne prend pas en charge les balises ID3v2 dans les fichiers WAVE, des balises RIFF INFO supplémentaires peuvent être écrites dans les fichiers. RIFF INFO n'a qu'une prise en charge limitée des balises et des encodages de caractères.

source: What formats will Picard support?
fr: Quels formats Picard prend-il en charge?

source: Picard is intended to eventually support all formats (including fingerprinting), but this is a complex (arguably never-ending) process, and will take some time.
fr: Picard est destiné à prendre en charge à terme tous les formats (y compris les empreintes digitales), mais il s'agit d'un processus complexe (sans doute sans fin), et prendra un certain temps.

source: What rippers are supported for looking up from logs?
fr: Quels sont les rippers pris en charge pour la recherche de rondins ?

source: As of version 2.9, Picard supports the use of log files produced by popular CD file rippers for looking up a release. Because the log files of these rippers contain sufficient information to generate the CD table of contents they can be used in place of reading the CD itself. The supported rippers include:
fr: A partir de la version 2.9, Picard supporte l'utilisation des fichiers de log produits par les rippers de CD les plus populaires pour rechercher une version. Comme les fichiers journaux de ces rippeurs contiennent suffisamment d'informations pour générer la table des matières du CD, ils peuvent être utilisés à la place de la lecture du CD lui-même. Les rippeurs pris en charge sont les suivants :

source: `dBpoweramp <https://dbpoweramp.com/>`_ for macOS and Windows
fr: `dBpoweramp <https://dbpoweramp.com/>`_ pour macOS et Windows

source: `Exact Audio Copy (EAC) <http://exactaudiocopy.de/>`_ for Windows
fr: `Exact Audio Copy (EAC) <http://exactaudiocopy.de/>`_ pour Windows

source: `fre:ac <https://www.freac.org>`_ for Linux, macOS, Windows and others
fr: `fre:ac <https://www.freac.org>`_ pour Linux, macOS, Windows et autres

source: `Whipper <https://github.com/whipper-team/whipper>`_ for Linux
fr: `Whipper <https://github.com/whipper-team/whipper>`_ pour Linux

source: `X Lossless Decoder (XLD) <https://tmkk.undo.jp/xld/index_e.html>`_ for macOS
fr: `X Lossless Decoder (XLD) <https://tmkk.undo.jp/xld/index_e.html>`_ pour macOS

source: Which tags can Picard write to my files?
fr: Quelles balises Picard peut-il écrire dans mes fichiers?

source: See the :doc:`../variables/variables` section for information on which MusicBrainz fields Picard writes to tags. `Picard Tag Mapping <https://picard.musicbrainz.org/docs/mappings/>`_ contains more technical information on how these are further mapped into each tag format.
fr: Voir la section :doc:`../variables/variables` pour des informations sur les champs MusicBrainz que Picard écrit dans les balises. `Cartographie de la balise Picard <https://picard.musicbrainz.org/docs/mappings/>`_ contient des informations plus techniques sur la façon dont ceux-ci sont ensuite mappés dans chaque format de tag.

source: How do I edit tags in several files at once?
fr: Comment modifier les balises de plusieurs fichiers à la fois ?

source: Click and select several files with :kbd:`Ctrl` or :kbd:`Shift`.
fr: Cliquez et sélectionnez plusieurs fichiers avec :kbd:`Ctrl` ou :kbd:`Shift`.

source: The metadata view at the bottom will show which tags are present in the selected files and whether they are the same across all files or different.
fr: La vue des métadonnées en bas de l'écran indique les balises présentes dans les fichiers sélectionnés et si elles sont identiques pour tous les fichiers ou différentes.

source: If you edit any value in the "New values" column you will change this tag for all selected files.
fr: Si vous modifiez une valeur dans la colonne "Nouvelles valeurs", vous changerez cette balise pour tous les fichiers sélectionnés.

source: You need to click Save in order to persist these changes to your files.
fr: Vous devez cliquer sur Enregistrer pour que ces modifications soient conservées dans vos fichiers.

source: Please understand that Picard is not designed as a general purpose :index:`tag editor <tags; editing>`. Its primary goal is to retrieve community-maintained MusicBrainz data to write into your tags. Some secondary goals include:
fr: Veuillez comprendre que Picard n'est pas conçu comme un :index:`éditeur de balises à usage général <mots clés; édition>`. Son objectif principal est de récupérer les données MusicBrainz maintenues par la communauté pour les écrire dans vos balises. Certains objectifs secondaires comprennent:

source: allowing rule-based customization of that data using scripts and plugins
fr: autoriser la personnalisation basée sur des règles de ces données à l'aide de scripts et de plugins

source: encouraging users to create an account and fix and update data via the MusicBrainz website, thus sharing their work with the rest of the community rather than simply fixing their tags locally.
fr: encourager les utilisateurs à créer un compte et à corriger et mettre à jour les données via le site Web MusicBrainz, partageant ainsi leur travail avec le reste de la communauté plutôt que de simplement réparer leurs tags localement.

source: To that end, Picard is likely to never have as much development focus on manual bulk editing of tags as other general purpose editors (e.g.: `Mp3tag <https://www.mp3tag.de/en/>`_, `foobar2000 <https://www.foobar2000.org/>`_, or even many library managers such as iTunes, Windows Media Player, and MediaMonkey). That doesn't mean that the team won't welcome patches in this area!
fr: À cette fin, Picard ne se concentrera probablement jamais autant sur l'édition manuelle en masse des balises que d'autres éditeurs à usage général (par exemple: `Mp3tag <https://www.mp3tag.de/en/>`_, `foobar2000 <https://www.foobar2000.org/>`_, ou même de nombreux gestionnaires de bibliothèques tels que iTunes, Windows Media Player et MediaMonkey). Cela ne veut pas dire que l'équipe n'acceptera pas de correctifs dans ce domaine!

source: Why is saving files sometimes slow, but saving a second time much faster?
fr: Pourquoi l'enregistrement des fichiers est-il parfois lent, mais l'enregistrement une deuxième fois beaucoup plus rapide ?

source: In most file formats the tags are near the beginning of the file, before the actual music data. If changed tags get written to the file and the newly written tags take more space than before the entire file needs to be rewritten. This is usually much slower than just rewriting part of the file containing the tags, especially for larger files and/or if the files are on a slow storage (e.g. a network share or slow external drive).
fr: Dans la plupart des formats de fichiers, les balises se trouvent au début du fichier, avant les données musicales proprement dites. Si des balises modifiées sont écrites dans le fichier et que les balises nouvellement écrites prennent plus d'espace qu'auparavant, le fichier entier doit être réécrit. Cette opération est généralement beaucoup plus lente que la réécriture d'une partie du fichier contenant les balises, surtout pour les fichiers volumineux et/ou si les fichiers se trouvent sur un support de stockage lent (par exemple, un partage réseau ou un lecteur externe lent).

source: To mitigate the issue most tagging software (including Picard) leaves some free space (the so called padding) after the tags and before the actual music data. If the newly written are only a bit larger than before this free space can be used instead of rewriting the entire files. Likewise if the newly written tags take less space than before this only leads to an increase in padding, avoiding rewriting the file.
fr: Pour atténuer ce problème, la plupart des logiciels d'étiquetage (y compris Picard) laissent un espace libre (appelé "padding") après les étiquettes et avant les données musicales proprement dites. Si les données nouvellement écrites ne sont qu'un peu plus grandes qu'avant, cet espace libre peut être utilisé au lieu de réécrire les fichiers entiers. De même, si les balises nouvellement écrites prennent moins de place qu'avant, cela ne fait qu'augmenter le padding, évitant ainsi de réécrire le fichier.

source: This all means that when you add many tags to the files (or if there is no or only small padding) you experience slow writing speed. If you do only small changes or just remove and later re-add tags the writing is much faster.
fr: Cela signifie que lorsque vous ajoutez de nombreuses balises aux fichiers (ou s'il n'y a pas ou peu de remplissage), la vitesse d'écriture est lente. Si vous n'effectuez que de petites modifications ou si vous supprimez et réintroduisez des balises, l'écriture est beaucoup plus rapide.

source: Why does Picard not use Vinyl style track numbers (e.g. A1, A2, ...) by default?
fr: Pourquoi Picard n'utilise-t-il pas par défaut les numéros de pistes de style Vinyle (par exemple A1, A2, ...) ?

source: For Vinyl releases the track numbers on MusicBrainz are usually entered as A1, A2, ..., B1, B2, ... and so on. Other releases might use even different more uncommon numbering schemes. Yet Picard will by default always write decimal track numbers, starting with 1 for the first track on a medium.
fr: Pour les disques vinyles, les numéros de pistes sur MusicBrainz sont généralement saisis sous la forme A1, A2, ..., B1, B2, ... et ainsi de suite. D'autres versions peuvent utiliser des schémas de numérotation encore plus inhabituels. Pourtant, Picard écrira toujours par défaut des numéros de pistes décimaux, en commençant par 1 pour la première piste d'un support.

source: The main reason for this is that this is how track numbers are defined for most file formats. The formats expect decimal numbers, and likewise music players might only expect decimal numbers when reading the files.
fr: La principale raison en est que c'est ainsi que les numéros de piste sont définis pour la plupart des formats de fichiers. Les formats attendent des nombres décimaux, et de même, les lecteurs de musique peuvent n'attendre que des nombres décimaux lors de la lecture des fichiers.

source: If you really want to you can use the scripting variable ``%_musicbrainz_tracknumber%`` which always holds the track number as it was entered in the MusicBrainz database. The following script will set the tracknumber tag to the value as displayed in the MusicBrainz database:
fr: Si vous le souhaitez vraiment, vous pouvez utiliser la variable de script ``%_musicbrainz_tracknumber%`` qui contient toujours le numéro de piste tel qu'il a été saisi dans la base de données MusicBrainz. Le script suivant va définir la balise tracknumber à la valeur telle qu'elle est affichée dans la base de données MusicBrainz :

source: Please be aware that for MP4 files this will result in the track number not being saved, as the MP4 format does not allow for non integer values in this tag. For other formats it depends on the playback software and devices you use if they can handle these non-standard track numbers.
fr: Veuillez noter que pour les fichiers MP4, le numéro de la piste ne sera pas enregistré, car le format MP4 n'autorise pas les valeurs non entières dans cette balise. Pour les autres formats, cela dépend du logiciel de lecture et des appareils que vous utilisez s'ils peuvent gérer ces numéros de piste non standard.

source: The built-in audio player cannot play my file. Which formats does it support?
fr: Le lecteur audio intégré ne peut pas lire mon fichier. Quels formats prend-il en charge?

source: The formats supported by the built-in :index:`audio player` depend on the formats supported by your operating system.
fr: Les formats pris en charge par le :index:`lecteur audio` intégré dépendent des formats pris en charge par votre système d'exploitation.

source: The supported formats depend on the installed codecs. Depending on the Windows version certain codecs are pre-installed, but you can install additional codecs.
fr: Les formats pris en charge dépendent des codecs installés. Selon la version de Windows, certains codecs sont préinstallés, mais vous pouvez installer des codecs supplémentaires.

source: You might want to install the `Directshow Filters for Ogg <https://xiph.org/dshow/downloads/>`_ to add support for Ogg Vorbis, Ogg Speex, Ogg Theora, Ogg FLAC, native FLAC, and WebM files.
fr: Vous voudrez peut-être installer les `Directshow Filters for Ogg <https://xiph.org/dshow/downloads/>`_ pour ajouter la prise en charge des fichiers Ogg Vorbis, Ogg Speex, Ogg Theora, Ogg FLAC, FLAC natif et WebM.

source: Additional information is available from `Microsoft's Codecs FAQ <https://support.microsoft.com/en-us/help/15070/windows-media-player-codecs-frequently-asked-questions>`_.
fr: Des informations supplémentaires sont disponibles dans `FAQ sur les codecs de Microsoft <https://support.microsoft.com/en-us/help/15070/windows-media-player-codecs-frequency-asked-questions>`_.

source: On Linux systems the player uses GStreamer which supports most common audio formats, although some distributions might exclude some codecs due to licensing issues. For the widest format support make sure you install all of the GStreamer plugins available for your distribution.
fr: Sur les systèmes Linux, le lecteur utilise GStreamer qui prend en charge les formats audio les plus courants, bien que certaines distributions puissent exclure certains codecs en raison de problèmes de licence. Pour une prise en charge du format le plus large, assurez-vous d'installer tous les plugins GStreamer disponibles pour votre distribution.

source: I am using Fedora. Why doesn't :index:`acoustic fingerprinting <acoustic fingerprint, fingerprint; acoustic>` work?
fr: J'utilise Fedora. Pourquoi la prise :index:`d'empreintes acoustique <empreinte acoustique, empreinte digitale; acoustique>` ne fonctionne-t-elle pas?

source: Acoustic fingerprinting in Picard uses a tool called :program:`fpcalc`, which is not available in Fedora. You can get it by installing the chromaprint-toolspackage from the `RPM Fusion repository <https://rpmfusion.org/>`_. This functionality is not contained in the main Fedora ``picard`` package because it requires the ``ffmpeg`` package which `cannot be distributed by Fedora <https://fedoraproject.org/wiki/Forbidden_items>`_. After `enabling the "rpmfusion-free" RPM Fusion repository <https://rpmfusion.org/Configuration>`_, install the package (as root) using::
fr: La prise d'empreintes acoustiques dans Picard utilise un outil appelé :program:`fpcalc`, qui n'est pas disponible dans Fedora. Vous pouvez l'obtenir en installant le paquetage chromaprint-tools depuis le dépôt `RPM Fusion <https://rpmfusion.org/>`_. Cette fonctionnalité n'est pas contenue dans le paquet principal de Fedora ``picard`` car elle nécessite le paquet ``ffmpeg`` qui `n'est pas distribué par Fedora <https://fedoraproject.org/wiki/Forbidden_items>`_. Après avoir `activé le dépôt de RPM Fusion "rpmfusion-free" <https://rpmfusion.org/Configuration>`_, installez le paquet (en tant que root) en utilisant::
