Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/faq/faq_config.po
Languages: fr

source: :index:`Configuration <configuration; config file location>`
fr: :index:`Configuration <configuration; emplacement du fichier de configuration>`

source: Where is the Picard :index:`configuration <configuration; file>` saved?
fr: Où est le Picard :index:`configuration <configuration; fichier>` enregistré?

source: Picard saves the configuration in the file :file:`Picard.ini`. Its location depends on the operating system:
fr: Picard enregistre la configuration dans le fichier :file:`Picard.ini`. Son emplacement dépend du système d'exploitation:

source: This usually will be :file:`C:\\Users\\\\{YourUserName}\\AppData\\Roaming\\MusicBrainz`, where ``YourUserName`` should be replaced with your actual Windows user name.
fr: Ce sera généralement :file:`C:\\Users\\\\{YourUserName}\\AppData\\Roaming\\MusicBrainz`, où ``YourUserName`` doit être remplacé par votre nom d'utilisateur Windows actuel.

source: **macOS, Linux and other Unix like systems:**
fr: **macOS, Linux et autres systèmes de type Unix:**

source: I tagged a file in Picard, but :index:`iTunes <itunes; tags, tagging; itunes>` is not seeing the tags!
fr: J'ai marqué un fichier en Picard, mais :index:`iTunes <itunes; étiquettes, marquage; itunes>` ne voit pas les balises!

source: First, you need to force :index:`iTunes <itunes>` to re-read the information from your tags and update its library. This is discussed in the `iTunes Guide <https://musicbrainz.org/doc/iTunes_Guide>`_.
fr: Tout d'abord, vous devez forcer :index:`iTunes <itunes>` à relire les informations de vos balises et à mettre à jour sa bibliothèque. Ceci est discuté dans le `iTunes Guide <https://musicbrainz.org/doc/iTunes_Guide>`_.

source: Additionally, iTunes has a known bug in its ID3v2.4 implementation, which makes it unable to read such tags if they also contain embedded cover art. As a work-around, you can configure Picard to write ID3v2.3 tags.
fr: De plus, iTunes a un bogue connu dans son implémentation ID3v2.4, qui le rend incapable de lire ces balises si elles contiennent également uart de couverture intégrée. Pour contourner le problème, vous pouvez configurer Picard pour écrire des balises ID3v2.3.

source: My tags are :index:`truncated <tags; truncated, WMP; tags>` to 30 characters in Windows Media Player!
fr: Mes balises sont :index:`truncated <tags; tronqué, WMP; balises>` à 30 caractères dans Windows Media Player!

source: How do I tell Picard which :index:`browser <pair: configuration; browser>` to use?
fr: Comment dire à Picard quel :index:`navigateur <paire: configuration; navigateur>` utiliser?

source: On Windows, macOS, GNOME and KDE, Picard uses the default browser that has been configured for the system. On other systems, you can use the ``BROWSER`` environment variable.
fr: Sous Windows, macOS, GNOME et KDE, Picard utilise le navigateur par défaut qui a été configuré pour le système. Sur d'autres systèmes, vous pouvez utiliser la variable d'environnement ``BROWSER``.

source: For example::
fr: Par exemple::

source: Another approach that works in some GNU/Linux systems is the following command::
fr: Une autre approche qui fonctionne dans certains systèmes GNU / Linux est la commande suivante::

source: This should present you with a list of existing browsers in your system, allowing you to select the one to use by default.
fr: Cela devrait vous présenter une liste des navigateurs existants dans votre système, vous permettant de sélectionner celui à utiliser par défaut.
