Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/about_picard/glossary.po
Languages: ca, fr

source: A :index:`recording <recording; standalone, standalone recording>` that is not linked to any release. An example is "`Sea of No Cares (live) <https://musicbrainz.org/recording/0198c132-ed38-430c-92bd-d3c7e9ff25b8>`_" by Great Big Sea.
ca: :index:`Enregistrament <enregistrament; independent, enregistrament independent>` que no està enllaçat a cap publicació. N'és un exemple «`Sea of No Cares (live) <https://musicbrainz.org/recording/0198c132-ed38-430c-92bd-d3c7e9ff25b8>`_» de Great Big Sea.
fr: Un :index:`enregistrement <recording; standalone, standalone recording>` qui n'est lié à aucune sortie. Un exemple est "`Sea of No Cares (live) <https://musicbrainz.org/recording/0198c132-ed38-430c-92bd-d3c7e9ff25b8>`_" de Great Big Sea.

source: Please see the `Standalone Recording <https://musicbrainz.org/doc/Standalone_Recording>`_ page on the MusicBrainz website for additional information.
ca: Consulteu la pàgina `Enregistrament independent <https://musicbrainz.org/doc/Standalone_Recording>`_ al lloc web de MusicBrainz per a més informació.
fr: Veuillez consulter la page `Enregistrement autonome <https://musicbrainz.org/doc/Standalone_Recording>`_ sur le site Web de MusicBrainz pour plus d'informations.

source: **track**
ca: **pista**

source: A :index:`track` is the way a recording is represented on a particular release (or, more precisely, on a particular medium). Every track has a title and is credited to one or more artists. For example, track 7 of the album "`Back to Boston <https://musicbrainz.org/release/9780e88d-a9e2-4e99-87c4-e54b65e7e49b>`_" by Jason Anderson is "`Driving Home <https://musicbrainz.org/track/bf8ecb3c-6fe6-41b7-a078-5748265a9f94>`_".
ca: Una :index:`pista` és la manera en què es representa un enregistrament en una publicació determinada (o, més exactament, en un suport determinat). Cada pista té un títol i els crèdits d'un o més artistes. Per exemple, la pista 7 de l'àlbum «`Back to Boston <https://musicbrainz.org/release/9780e88d-a9e2-4e99-87c4-e54b65e7e49b>`_» de Jason Anderson és «`Driving Home <https://musicbrainz.org/track/bf8ecb3c-6fe6-41b7-a078-5748265a9f94>`_».
fr: Une :index:`piste <track>` est la façon dont un enregistrement est représenté sur une version particulière (ou, plus précisément, sur un support particulier). Chaque piste a un titre et est créditée à un ou plusieurs artistes. Par exemple, la piste 7 de l'album "`Back to Boston <https://musicbrainz.org/release/9780e88d-a9e2-4e99-87c4-e54b65e7e49b>`_" de Jason Anderson est "`Driving Home <https://musicbrainz.org/track/bf8ecb3c-6fe6-41b7-a078-5748265a9f94>`_".

source: Please see the `Track <https://musicbrainz.org/doc/Track>`_ page on the MusicBrainz website for additional information.
ca: Consulteu la pàgina `Pista <https://musicbrainz.org/doc/Track>`_ al lloc web de MusicBrainz per a més informació.
fr: Veuillez consulter la page `Track <https://musicbrainz.org/doc/Track>`_ sur le site Web de MusicBrainz pour plus d'informations.

source: **work**
ca: **obra**

source: :index:`A distinct intellectual or artistic creation <work>`, which can be expressed in the form of one or more audio recordings. While a 'Work' in MusicBrainz is usually musical in nature, it is not necessarily so. A work could also be a novel, play, poem or essay, later recorded as an oratory or audiobook. For example, the song "`Blinded by the Light <https://musicbrainz.org/work/7a757d97-da2a-3751-8d32-94d471de2eeb>`_" written by Bruce Springsteen has been recorded well over 100 times.
ca: :index:`Creació intel·lectual o artística distingida <work>`, que es pot expressar com a un o més enregistraments d'àudio. Tot i que una «Obra» a MusicBrainz sol ser musical, no necessàriament ho ha de ser. Una obra també pot ser una novel·la, una obra de teatre, un poema o un escit que posteriorment s'hagin enregistrat com a oració o audiollibre. Per exemple, la cançó «`Blinded by the Light <https://musicbrainz.org/work/7a757d97-da2a-3751-8d32-94d471de2eeb>`_» de Bruce Springsteen s'ha enregistrat més de 100 vegades.
fr: :index:`Une création intellectuelle ou artistique distincte <work>`, qui peut s'exprimer sous la forme d'un ou plusieurs enregistrements audio. Bien qu'une "œuvre" dans MusicBrainz soit généralement de nature musicale, ce n'est pas nécessairement le cas. Une œuvre peut également être un roman, une pièce de théâtre, un poème ou un essai, enregistré plus tard sous forme d'oratoire ou de livre audio. Par exemple, la chanson "`Blinded by the Light <https://musicbrainz.org/work/7a757d97-da2a-3751-8d32-94d471de2eeb>`_" écrite par Bruce Springsteen a été enregistrée plus de 100 fois.

source: Please see the `Work <https://musicbrainz.org/doc/Work>`_ page on the MusicBrainz website for additional information.
ca: Consulteu la pàgina `Obra <https://musicbrainz.org/doc/Work>`_ al lloc web de MusicBrainz per a més informació.
fr: Veuillez consulter la page `Work <https://musicbrainz.org/doc/Work>`_ sur le site Web de MusicBrainz pour plus d'informations.

source: For more information on these and other terms used, please refer to the `Terminology <https://musicbrainz.org/doc/Terminology>`_ page on the MusicBrainz website.
ca: Per a més informació sobre aquests i altres termes, consulteu la pàgina `Terminologia <https://musicbrainz.org/doc/Terminology>`_ al lloc web de MusicBrainz.
fr: Pour plus d'informations sur ces termes et sur les autres termes utilisés, veuillez vous reporter à la page `Terminologie <https://musicbrainz.org/doc/Terminology>`_ sur le site Web MusicBrainz.

source: For a detailed explanation of how all the elements are related within the MusicBrainz environment, please refer to the `MusicBrainz Database / Schema <https://musicbrainz.org/doc/MusicBrainz_Database/Schema>`_ webpage.
ca: Per a veure una explicació detallada de com tots els elements es relacionen entre si a l'entorn de MusicBrainz, consulteu la pàgina `Base de dades MusicBrainz / Esquema <https://musicbrainz.org/doc/MusicBrainz_Database/Schema>`_.
fr: Pour une explication détaillée de la façon dont tous les éléments sont liés dans l'environnement MusicBrainz, veuillez vous référer à la page Web `MusicBrainz Database / Schema <https://musicbrainz.org/doc/MusicBrainz_Database/Schema>`_.
