Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/about_picard/glossary.po
Languages: ca, fr

source: :index:`Glossary of Terms <glossary>`
ca: :index:`Glossari de termes <glossary>`
fr: :index:`Glossaire des termes <glossaire>`

source: Many of the terms used in this documentation and within Picard itself have specific meaning in the MusicBrainz environment. Specific terms are defined as follows:
ca: Molts dels termes que es fan servir en aquesta documentació i a Picard tenen un significat específic a l'entorn de MusicBrainz. A continuació es defineixen els termes específics:
fr: De nombreux termes utilisés dans cette documentation et dans Picard lui-même ont une signification spécifique dans l'environnement MusicBrainz. Les termes spécifiques sont définis comme suit:

source: **acoustic fingerprint**
ca: **empremta acústica**
fr: **empreinte acoustique**

source: An :index:`acoustic fingerprint <acoustic fingerprint, fingerprint; acoustic>` is a digital summary of an audio signal, that can be used to quickly identify the audio.
ca: Una :index:`empremta acústica <empremta acústica, empremta; acústica>` és un resum digital d'un senyal d'àudio que es pot fer servir per a identificar l'àudio ràpidament.
fr: Une :index:`empreinte acoustique` est un résumé numérique d'un signal audio, qui peut être utilisé pour identifier rapidement l'audio.

source: Please see `Wikipedia <https://wikipedia.org/wiki/Acoustic_fingerprint>`_ for a full explanation of acoustic fingerprinting.
ca: Consulteu la `Viquipèdia <https://wikipedia.org/wiki/Acoustic_fingerprint>`_ per a veure una explicació completa de les empremtes acústiques.
fr: Veuillez consulter `Wikipedia <https://wikipedia.org/wiki/Acoustic_fingerprint>`_ pour une explication complète de l'empreinte digitale acoustique.

source: :index:`AcoustID` is an acoustic fingerprint system built entirely on open-source technology. See the `AcoustID website <https://acoustid.org/>`_ for additional information.
ca: :index:`AcoustID` és un sistema d'empremtes acústiques basat totalment en tecnologia lliure. Consulteu el `lloc web d'AcoustID <https://acoustid.org/>`_ per a més informació.
fr: :index:`AcoustID` est un système d'empreinte digitale acoustiques entièrement basé sur une technologie open source. Consultez le site `Web AcoustID <https://acoustid.org/>`_ pour plus d'informations.

source: **albumartist**
ca: **artista de l'àlbum**
fr: **artiste d'album**

source: The musician or group of musicians performing on a release. For example, "The Beatles" is the :index:`albumartist` for the album "`Past Masters, Volume One <https://musicbrainz.org/release/9383a6f5-9607-4a36-9c68-8663aad3592b>`_", while the albumartist for "`No Boundaries: A Benefit for the Kosovar Refugees <https://musicbrainz.org/release/65536c6a-9219-4c41-9829-781eab7cdb50>`_" is "Various Artists".
ca: Músic o grup que músics que interpreten una publicació. Per exemple, "The Beatles" és l':index:`artista de l'àlbum` de l'àlbum «`Past Masters, Volume One <https://musicbrainz.org/release/9383a6f5-9607-4a36-9c68-8663aad3592b>`_», mentre que l'artista de l'àlbum de «`No Boundaries: A Benefit for the Kosovar Refugees <https://musicbrainz.org/release/65536c6a-9219-4c41-9829-781eab7cdb50>`_» és «Diversos artistes».
fr: Le musicien ou groupe de musiciens jouant sur un album. Par exemple, "The Beatles" est le :index:`albumartist` de l'album "`Past Masters, Volume One <https://musicbrainz.org/release/9383a6f5-9607-4a36-9c68-8663aad3592b>`_", tandis que l'albumartist de "`Pas de frontières: un avantage pour les réfugiés kosovars <https://musicbrainz.org/release/65536c6a-9219-4c41-9829-781eab7cdb50>`_" est "Various Artists ".

source: The albumartist usage is different for Classical Music releases, which follow the MusicBrainz `Classical Style Guide <https://musicbrainz.org/doc/Style/Classical>`_, listing the composer(s) first, followed by the performers.
ca: L'ús de l'artista de l'àlbum és diferent per a les publicacions de música clàssica, que segueixen la `Guia d'estil de música clàssica <https://musicbrainz.org/doc/Style/Classical>`_; en aquest cas, els compositors van primer, seguits dels intèrprets.
fr: L'utilisation de albumartist est différente pour les versions de musique classique, qui suivent le MusicBrainz `Classical Style Guide <https://musicbrainz.org/doc/Style/Classical>`_, listant d'abord les compositeur, suivi par les interprètes.

source: **artist**
ca: **artista**
fr: **artiste**

source: The musician or group of musicians performing on a track. For example, "Jeen" is the :index:`artist` on the track "`Be (One in a Million) <https://musicbrainz.org/track/5acda7a7-697c-4614-8467-7c48b3d946a6>`_" on the album "`Tourist <https://musicbrainz.org/release/472f4da8-c7dd-4e4a-8aae-9e7824f85afc>`_".
ca: Músic o grup de músics que interpreten una pista. Per exemple, «Jeen» és l':index:`artista` de la pista «`Be (One in a Million) <https://musicbrainz.org/track/5acda7a7-697c-4614-8467-7c48b3d946a6>`_» de l'àlbum «`Tourist <https://musicbrainz.org/release/472f4da8-c7dd-4e4a-8aae-9e7824f85afc>`_».
fr: Le musicien ou le groupe de musiciens jouant sur une piste. Par exemple, "Jeen" est :index:`l'artiste` sur la piste "`Be (One in a Million) <https://musicbrainz.org/track/5acda7a7-697c-4614-8467-7c48b3d946a6>`_" sur l'album "`Tourisme <https://musicbrainz.org/release/472f4da8-c7dd-4e4a-8aae-9e7824f85afc>`_".

source: Please see the `Artist <https://musicbrainz.org/doc/Artist>`_ page on the MusicBrainz website for additional information.
ca: Consulteu la pàgina `Artista <https://musicbrainz.org/doc/Artist>`_ al lloc web de MusicBrainz per a més informació.
fr: Veuillez consulter la page `Artiste <https://musicbrainz.org/doc/Artist>`_ sur le site Web de MusicBrainz pour plus d'informations.

source: The artist usage is different for Classical Music releases, which follow the MusicBrainz Classical Style Guide, showing only the composer and not the performers.
ca: L'ús de l'artista és diferent per a les publicacions de música clàssica, que segueixen la Guia d'estil de música clàssica de MusicBrainz; en aquest cas, es mostra només el compositor i no els intèrprets.
fr: L'utilisation de l'artiste est différente pour les versions de musique classique, qui suivent le guide de style classique MusicBrainz, ne montrant que le compositeur et non les interprètes.

source: **artist credit**
ca: **crèdit de l'artista**
fr: **crédit d’artiste**

source: An :index:`artist credit` indicates who is the main credited artist (or artists) for releases, release groups, tracks and recordings, and how they are credited. They consist of artists, with (optionally) their names as credited in the specific release, track, etc., and join phrases between them. For example, on the release "`Love Sponge <https://musicbrainz.org/release/6ca797fd-8f3a-4326-bdc7-f805cb2de088>`_" the artist is "`Walk off the Earth <https://musicbrainz.org/artist/e2a5eaeb-7de7-4ffe-a519-e18e427a5060>`_" but is credited as "Gianni and Sarah".
ca: Un :index:`crèdit de l'artista` indica qui és l'artista o artista que rep el crèdit principal de publicacions, grups de publicacions, pistes i enregistrament, i com rep el crèdit. Principalment són artistes i (opcionalment) els noms tal com consten a la publicació o pista en concret i text entre els noms. Per exemple, a la publicació «`Love Sponge <https://musicbrainz.org/release/6ca797fd-8f3a-4326-bdc7-f805cb2de088>`_» l'artista és «`Walk off the Earth <https://musicbrainz.org/artist/e2a5eaeb-7de7-4ffe-a519-e18e427a5060>`_» però rep el crèdit com a «Gianni and Sarah».
fr: Les :index:`crédits d'artiste` indiquent qui est le ou les principaux artistes crédités pour les sorties, les groupes de sortie, les pistes et les enregistrements, et comment ils sont crédités. Ils se composent d'artistes, avec (facultativement) leurs noms tels que crédités dans la version spécifique, la piste, etc., et joindre des phrases entre eux. Par exemple, sur la version "`Love Sponge <https://musicbrainz.org/release/6ca797fd-8f3a-4326-bdc7-f805cb2de088>`_" l'artiste est "`Walk off the Earth <https://musicbrainz.org/artist/e2a5eaeb-7de7-4ffe-a519-e18e427a5060>`_" mais est crédité comme "Gianni et Sarah".

source: Please see the `Artist Credits <https://musicbrainz.org/doc/Artist_Credits>`_ page on the MusicBrainz website for additional information.
ca: Consulteu la pàgina `Crèdits de l'artista <https://musicbrainz.org/doc/Artist_Credits>`_ al lloc web de MusicBrainz per a més informació.
fr: Veuillez consulter la page `Artist Credits <https://musicbrainz.org/doc/Artist_Credits>`_ sur le site Web de MusicBrainz pour plus d'informations.

source: :index:`The <see: CAA; cover art archive>` `Cover Art Archive <https://coverartarchive.org/>`_ which is a :index:`joint project <cover art archive>` between the `Internet Archive <https://archive.org/>`_ and `MusicBrainz <https://musicbrainz.org/>`_, whose goal is to make cover art images available to everyone on the Internet in an organized and convenient way.
ca: :index:`<see: CAA; cover art archive>` `Cover Art Archive <https://coverartarchive.org/>`_, que és un :index:`projecte conjunt <cover art archive>` entre `Internet Archive <https://archive.org/>`_ i `MusicBrainz <https://musicbrainz.org/>`_ amb l'objectiu de posar les imatges de les caràtules a disposició de tothom a Internet de manera organitzada i pràctica.
fr: :index:`Le <see: CAA; archives d'art de couverture>` `Cover Art Archive <https://coverartarchive.org/>`_ qui est un :index:`projet conjoint <archives d'art de couverture>` entre `Internet Archive <https://archive.org/>`_ et `MusicBrainz <https://musicbrainz.org/>`_, dont le but est de rendre les images de couvertures accessibles à tous sur Internet de manière organisée et pratique.

source: Please see the `Cover Art Archive page <https://musicbrainz.org/doc/Cover_Art_Archive>`_ on the MusicBrainz website for additional information.
ca: Consulteu la `pàgina sobre Cover Art Archive <https://musicbrainz.org/doc/Cover_Art_Archive>`_ al lloc web de MusicBrainz per a més informació.
fr: Veuillez consulter la page `Cover Art Archive' <https://musicbrainz.org/doc/Cover_Art_Archive>`_ sur le site Web de MusicBrainz pour plus d'informations.

source: **disc id**
ca: **ID del disc**
fr: **id de disque**

source: A :index:`Disc ID <disc id>` is the code number which MusicBrainz uses to link a physical CD to a release listing. It is a string of letters, like ``XzPS7vW.HPHsYemQh0HBUGr8vuU-``. Disc IDs for a release can be seen on the disc IDs tab for the release on MusicBrainz. Clicking on these will give a detailed display of the disc ID, including the list of attached releases.
ca: Un :index:`ID del disc <disc id>` és el codi que fa servir MusicBrainz per a enllaçar un CD físic a una publicació. És una cadena de caràcters, com ara ``XzPS7vW.HPHsYemQh0HBUGr8vuU-``. Els ID del disc d'una publicació es poden veure a la pestanya «ID del disc» de la publicació a MusicBrainz. En fer-hi clic, es mostra informació detalla de l'ID del disc, incloent-hi la llista de publicacions enllaçades.
fr: Un :index:`ID du disque <id du disque>` est le numéro de code que MusicBrainz utilise pour lier un CD physique à une liste de versions. C'est une chaîne de lettres, comme ``XzPS7vW.HPHsYemQh0HBUGr8vuU-``. Les ID de disque pour une version peuvent être vus dans l'onglet ID de disque pour la version sur MusicBrainz. En cliquant dessus, vous obtiendrez un affichage détaillé de l'ID du disque, y compris la liste des versions jointes.

source: A release may have any number of disc IDs, and a disc ID may be linked to multiple releases. This is because `disc ID calculation <https://musicbrainz.org/doc/Disc_ID_Calculation>`_ involves a hash of the frame offsets of the CD tracks. Different pressing of a CD often have slightly different frame offsets, and hence different disc IDs.
ca: Una publicació pot tenir més d'un ID de disc i un ID de disc pot estar enllaçat a més d'una publicació. Això és perquè el `càlcul de l'ID del disc <https://musicbrainz.org/doc/Disc_ID_Calculation>`_ implica calcular el resum de les posicions de les pistes del CD. Les diferents tirades d'un CD sovint tenen posicions de les pistes lleugerament diferents i, per tant, ID del disc diferents.
fr: Une version peut avoir n'importe quel nombre d'identifiants de disque et un identifiant de disque peut être lié à plusieurs versions. Cela est dû au fait que `le calcul de l'ID de disque <https://musicbrainz.org/doc/Disc_ID_Calculation>`_ implique un hachage des décalages d'image des pistes de CD. Différents fabricants de CD ont souvent des décalages de trame légèrement différents, et donc des ID de disque différents.

source: Conversely, two different CDs may happen to have exactly the same set of frame offsets and hence the same disc ID. For example ``lwHl8fGzJyLXQR33ug60E8jhf4k-`` applies to a wide `variety of releases <https://musicbrainz.org/cdtoc/lwHl8fGzJyLXQR33ug60E8jhf4k->`_ by a variety of artists.
ca: Per contra, dos CD poden tenir exactament el mateix conjunt de posicions de les pistes i, per tant, el mateix ID del disc. Per exemple, ``lwHl8fGzJyLXQR33ug60E8jhf4k-`` s'aplica a una `àmplia varietat de publicacions <https://musicbrainz.org/cdtoc/lwHl8fGzJyLXQR33ug60E8jhf4k->`_ de molts artistes.
fr: Inversement, deux CD différents peuvent avoir exactement le même jeu de décalages d'image et donc le même ID de disque. Par exemple, ``lwHl8fGzJyLXQR33ug60E8jhf4k-`` s'applique à une large `variété de versions <https://musicbrainz.org/cdtoc/lwHl8fGzJyLXQR33ug60E8jhf4k->`_ par une variété d'artistes.

source: :index:`The <see: mbid; MusicBrainz Identifier>` :index:`MusicBrainz Identifier`, which is a unique code used to identify each element in the MusicBrainz database. These are 128-bit Universally Unique Identifiers (UUID) represented as 32 hexadecimal digits, displayed in five groups separated by hyphens, in the form 8-4-4-4-12 for a total of 36 characters.
ca: :index:`<see: mbid; identificador de MusicBrainz>` :index:`Identificador de MusicBrainz`, que és un codi únic que es fa servir per a identificar cada element a la base de dades MusicBrainz. Són identificadors únics universals (UUID) de 128 bits representats com a 32 dígits hexadecimals; es mostren en cinc grups separats per guionets amb el format 8-4-4-4-12, amb un total de 36 caràcters.
fr: :index:`L'identifiant MusicBrainz`, :index:`qui <see: mbid; L'identifiant MusicBrainz>` est un code unique utilisé pour identifier chaque élément de la base de données MusicBrainz. Il s'agit d'identifiants universels uniques (UUID) de 128 bits représentés par 32 chiffres hexadécimaux, affichés en cinq groupes séparés par des tirets, sous la forme 8-4-4-4-12 pour un total de 36 caractères.

source: Please see the `UUID page on Wikipedia <https://en.wikipedia.org/wiki/Universally_unique_identifier>`_ for more information.
ca: Consulteu la `pàgina sobre UUID a la Viquipèdia <https://en.wikipedia.org/wiki/Universally_unique_identifier>`_ per a més informació.
fr: Veuillez consulter la `page UUID sur Wikipedia <https://en.wikipedia.org/wiki/Universally_unique_identifier>`_ pour plus d'informations.

source: **medium**
ca: **suport**

source: :index:`One <medium>` of the physical, separate things you would get when you buy something in a record store. They are the individual CDs, vinyls, etc. contained within the packaging of an album (or any other type of release). Mediums are always included in a release, and have a position in said release (e.g. disc 1 or disc 2). They have a format like CD, 12" vinyl or cassette (in some cases this will be unknown), and can have an optional title (e.g. disc 2: The Early Years). For example, CD 1 of "`The Wall <https://musicbrainz.org/release/4bd2dbd5-a961-335a-a618-39c26b2ee791#disc1>`_".
ca: :index:`Un <suport>` de les coses físiques i independents que obtindríeu en comprar alguna cosa en una botiga de música. Són els CD, vinils, etc. que conté l'empaquetatge d'un àlbum (o qualsevol altre tipus de publicació). Els suports sempre s'inclouen en una publicació i hi tenen una posició (p. ex., disc 1 o disc 2). Tenen un format com CD, vinil de 12 polzades o casset (en alguns casos serà desconegut) i poden tenir un títol opcional (p. ex., disc 2: «Els primers anys»). Per exemple, el CD 1 de «`The Wall <https://musicbrainz.org/release/4bd2dbd5-a961-335a-a618-39c26b2ee791#disc1>`_».
fr: :index:`Une <moyen>` des choses physiques et distinctes que vous obtiendriez lorsque vous achetez quelque chose dans un magasin de disques. Ce sont les CD, vinyles, etc. individuels contenus dans l'emballage d'un album (ou de tout autre type de sortie). Les supports sont toujours inclus dans un communiqué, et ont une position dans ledit communiqué (par exemple, disque 1 ou disque 2). Ils ont un format comme CD, vinyle 12 "ou cassette (dans certains cas, cela sera inconnu), et peuvent avoir un titre optionnel (par exemple, disque 2: Les jeunes années). Par exemple, le CD 1 de "`The Wall <https://musicbrainz.org/release/4bd2dbd5-a961-335a-a618-39c26b2ee791#disc1>`_".

source: Please see the `Medium <https://musicbrainz.org/doc/Medium>`_ page on the MusicBrainz website for additional information.
ca: Consulteu la pàgina `Suport <https://musicbrainz.org/doc/Medium>`_ al lloc web de MusicBrainz per a més informació.
fr: Veuillez consulter la page `Moyen <https://musicbrainz.org/doc/Medium>`_ sur le site Web de MusicBrainz pour plus d'informations.

source: **non-album track**
ca: **pista sense àlbum**

source: This term is :index:`obsolete <see: non-album track; standalone recording>` and has been replaced with 'standalone recording'.
ca: Aquest terme està :index:`obsolet <see: pista sense àlbum; enregistrament independent>` i s'ha substituït per «enregistrament independent».
fr: Ce terme est :index:`obsolète <see: non-album track; standalone recording>` et a été remplacé par "standalone recording".

source: **recording**
ca: **enregistrament**
fr: **enregistrement**

source: An entity in MusicBrainz which can be linked to tracks on releases. Each track must always be associated with a single :index:`recording`, but a recording can be linked to any number of tracks. For example, this recording of "`Bohemian Rhapsody <https://musicbrainz.org/recording/b1a9c0e9-d987-4042-ae91-78d6a3267d69>`_" is found as a track on over 100 releases.
ca: Entitat a MusicBrainz que es pot enllaçar a pistes en publicacions. Cada pista sempre ha d'estar associada a un únic :index:`enregistrament`, però un enregistrament pot estar enllaçat a qualsevol nombre de pistes. Per exemple, aquest enregistrament de «`Bohemian Rhapsody <https://musicbrainz.org/recording/b1a9c0e9-d987-4042-ae91-78d6a3267d69>`_» apareix com a pista en més de 100 publicacions.
fr: Une entité dans MusicBrainz qui peut être liée à des pistes sur les versions. Chaque piste doit toujours être associée à un seul :index:`enregistrement`, mais un enregistrement peut être lié à n'importe quel nombre de pistes. Par exemple, cet enregistrement de "`Bohemian Rhapsody <https://musicbrainz.org/recording/b1a9c0e9-d987-4042-ae91-78d6a3267d69>`_" se trouve en tant que piste sur plus de 100 versions.

source: Please see the `Recording <https://musicbrainz.org/doc/Recording>`_ page on the MusicBrainz website for additional information.
ca: Consulteu la pàgina `Enregistrament <https://musicbrainz.org/doc/Recording>`_ al lloc web de MusicBrainz per a més informació.
fr: Veuillez consulter la page `Enregistrement <https://musicbrainz.org/doc/Recording>`_ sur le site Web de MusicBrainz pour plus d'informations.

source: **release**
ca: **publicació**

source: Represents the unique issuing of a product on a specific date with specific :index:`release` information such as the country, label, barcode and packaging. For example "`Sea of No Cares <https://musicbrainz.org/release/4e4ba41e-24ae-3f57-87f6-3d8f19ae9483>`_" is one version of the album released by Great Big Sea.
ca: Representa una versió única d'un producte en una data específica amb informació de :index:`publicació` específica com el país, el segell, el codi de barres i l'empaquetatge. Per exemple, «`Sea of No Cares <https://musicbrainz.org/release/4e4ba41e-24ae-3f57-87f6-3d8f19ae9483>`_» és una versió de l'àlbum publicat per Great Big Sea.
fr: Représente la délivrance unique d'un produit à une date spécifique avec des informations :index:`de sortie <release>` spécifiques telles que le pays, l'étiquette, le code-barres et l'emballage. Par exemple "`Sea of No Cares <https://musicbrainz.org/release/4e4ba41e-24ae-3f57-87f6-3d8f19ae9483>`_" est une version de l'album publié par Great Big Sea.

source: Please see the `Release <https://musicbrainz.org/doc/Release>`_ page on the MusicBrainz website for additional information.
ca: Consulteu la pàgina `Publicació <https://musicbrainz.org/doc/Release>`_ al lloc web de MusicBrainz per a més informació.
fr: Veuillez consulter la page `Release <https://musicbrainz.org/doc/Release>`_ sur le site Web de MusicBrainz pour plus d'informations.

source: **release group**
ca: **grup de publicacions**
fr: **groupe de parution**

source: Groups several different releases into a single logical entity. Every release belongs to one, and only one :index:`release group`. Both release groups and releases are "albums" in a general sense, but with an important difference: a release is something you can buy as media such as a CD or a vinyl record, while a release group embraces the overall concept of an album — it doesn't matter how many CDs or editions / versions it had. For example the `"Sea of No Cares" <https://musicbrainz.org/release-group/7e7ffd2b-3d1b-3487-aaaf-e4e6037f09ca>`_ release group contains multiple releases.
ca: Agrupa diverses publicacions diferents en una única entitat lògica. Cada publicació pertany a un i només un :index:`grup de publicacions`. Tant els grups de publicacions com les publicacions són «àlbums» en sentit ampli, però amb una diferència important: una publicació és un suport que es pot comprar, com un CD o un vinil, mentre que un grup de publicacions comprèn el concepte general d'un àlbum; no importa quants CD, edicions o versions ha tingut. Per exemple, el grup de publicacions `«Sea of No Cares» <https://musicbrainz.org/release-group/7e7ffd2b-3d1b-3487-aaaf-e4e6037f09ca>`_ conté diverses publicacions.
fr: Regroupe plusieurs versions différentes en une seule entité logique. Chaque version appartient à un et un seul :index:`groupe de versions <release group>`. Les groupes de sortie et les sorties sont des "albums" dans un sens général, mais avec une différence importante: une sortie est quelque chose que vous pouvez acheter en tant que support tel qu'un CD ou un disque vinyle, tandis qu'un groupe de sortie embrasse le concept global d'un album - peu importe le nombre de CD ou d'éditions / versions dont il disposait. Par exemple, le groupe de versions `"Sea of No Cares" <https://musicbrainz.org/release-group/7e7ffd2b-3d1b-3487-aaaf-e4e6037f09ca>`_ contient plusieurs versions.

source: Please see the `Release Group <https://musicbrainz.org/doc/Release_Group>`_ page on the MusicBrainz website for additional information.
ca: Consulteu la pàgina `Grup de publicacions <https://musicbrainz.org/doc/Release_Group>`_ al lloc web de MusicBrainz per a més informació.
fr: Veuillez consulter la page `Release Group <https://musicbrainz.org/doc/Release_Group>`_ sur le site Web de MusicBrainz pour plus d'informations.

source: **standalone recording**
ca: **enregistrament independent**
fr: **enregistrement isolé**
