Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/about_picard/introduction.po
Languages: ca, de, fr, lt, pt_br

source: Picard's metadata retrieval is limited to the standard **one request per second** :index:`rate limiting` for the MusicBrainz API. This becomes quite noticeable when trying to process a large list of files, and is exacerbated by extensions that perform additional information requests from the database.
ca: La recuperació de metadades de Picard està limitada a l'estàndard d'**una sol·licitud per segon** :index:`límit de velocitat` de l'API de MusicBrainz. Això es nota especialment en intentar processar una llista de fitxers llarga i ho agreugen les extensions que envien sol·licituds d'informació addicionals a la base de dades.
de: Picard's Metadatenabfrage ist auf den Standard **eine Anfrage pro Sekunde** :index:`Begrenzung` für die MusicBrainz-API beschränkt. Dies macht sich bemerkbar, wenn man versucht, eine große Anzahl an Dateien zu verarbeiten, und wird durch Erweiterungen, die zusätzliche Informationsabfragen von der Datenbank durchführen, noch verschärft.
pt_br: O Picard está limitado à **uma requisição por segundo** :index:`rate limiting` para a API MusicBrainz. Isto se torna perceptível quando processando uma grande quantidade de arquivos, e pode ser exacerbado devido a extensões que fazem requisições adicionais ao banco de dados.

source: **Network File Processing**
ca: **Processament de fitxers de xarxa**
de: **Netzwerk-Dateiverarbeitung**
fr: **Traitement de fichiers réseau**
pt_br: **Processamento de Arquivos pela Rede**

source: Sometimes Picard needs to rewrite the entire music file in order to add or update the tags. This can take a few seconds, and the delay becomes even longer if the file is accessed across a network (e.g.: file is read from or written to a NAS device). The recommended "best practice" is to process all files on a local drive and then move them to the desired remote directory once processing is complete.
ca: De vegades, Picard necessita reescriure el fitxer de música sencer per a afegir o actualitzar les etiquetes. Això pot tardar uns segons i el retard esdevé encara més llarg si s'accedeix al fitxer a través d'una xarxa (p. ex., el fitxer s'emmagatzema en un dispositiu NAS). La «pràctica recomanada» és processar tots els fitxers en una unitat local i moure'ls al directori remot desitjat un cop s'ha completat el processament.
de: Manchmal muss Picard die gesamte Musikdatei neu schreiben, um die Tags hinzuzufügen oder zu aktualisieren. Dies kann einige Sekunden dauern, und die Verzögerung wird noch länger, wenn auf die Datei über ein Netzwerk zugegriffen wird (z. B. wird die Datei von einem NAS-Gerät gelesen oder darauf geschrieben). Es wird empfohlen, alle Dateien auf einem lokalen Laufwerk zu verarbeiten und sie dann nach Abschluss der Verarbeitung in das gewünschte Remote-Verzeichnis zu verschieben.
pt_br: Pode ser necessário reescrever o arquivo de música inteiro para adicionar ou atualizar etiquetas. Isto pode levar alguns segundos, porém pode demorar mais quando acessando arquivos na rede (por exemplo: um arquivo sendo lido e/ou escrito para um servidor de arquivos NAS). Recomenda-se que todos os arquivos sejam processados localmente e movidos para a pasta remota quando concluído.

source: In order to effectively use Picard, it is important to understand what the program can do and, equally important, what it cannot do. Picard is primarily intended to tag and organize albums containing tracks, guided by the user to the specific release of the album that they have, and then to keep the metadata for these tracks up to date as users around the world enhance the quality of the MusicBrainz data associated with that particular release and track; Picard does this very well indeed. However, it is not intended to automatically organize your collection of thousands of random music files, and if this is what you are hoping for then you will likely be disappointed. To quote from the Picard website, *"Picard is not built to be a mass single-track tag fixer. Picard believes in quality over quantity and provides a plethora of customizations to tweak music collections to your needs."*
fr: Afin d'utiliser efficacement Picard, il est important de comprendre ce que le programme peut faire et, tout aussi important, ce qu'il ne peut pas faire. Picard est principalement destiné à étiqueter et organiser les albums contenant des pistes, guidé par l'utilisateur vers la sortie spécifique de l'album dont il dispose, puis à maintenir les métadonnées de ces pistes à jour à mesure que les utilisateurs du monde entier améliorent la qualité de MusicBrainz. les données associées à cette version et à cette piste particulières ; Picard le fait très bien en effet. Cependant, il n'est pas destiné à organiser automatiquement votre collection de milliers de fichiers musicaux aléatoires, et si c'est ce que vous espérez, vous serez probablement déçu. Pour citer le site Web de Picard, *"Picard n'est pas conçu pour être un fixateur d'étiquettes à piste unique de masse. Picard croit en la qualité plutôt que la quantité et propose une pléthore de personnalisations pour adapter les collections de musique à vos besoins."*

source: Picard currently supports most music file formats, with Matroska (.mka) being one notable exception. Microsoft WAVE (.wav) files can be fingerprinted and renamed and can be tagged using ID3v2 tags, but this is not supported by all playback software. In addition, Picard does not support writing custom tags for all formats.
fr: Picard prend actuellement en charge la plupart des formats de fichiers musicaux, Matroska (.mka) étant une exception notable. Les fichiers Microsoft WAVE (.wav) peuvent être empreintes digitales et renommés et peuvent être marqués à l'aide de balises ID3v2, mais cela n'est pas pris en charge par tous les logiciels de lecture. De plus, Picard ne prend pas en charge l'écriture de balises personnalisées pour tous les formats.

source: The :doc:`Picard Tag Mappings <../appendices/tag_mapping>` section provides more information regarding the mapping between Picard internal tag names and various tagging formats.
fr: La section :doc:`Correspondances des balises Picardes <../appendices/tag_mapping>` fournit plus d'informations concernant le mappage entre les noms de balises internes Picard et divers formats de balisage.

source: Picard's metadata retrieval is limited to the standard **one request per second** :index:`rate limiting` for the MusicBrainz API. This becomes quite noticeable when trying to process a large list of files, and is exacerbated by extensions that perform additional information requests from the database.
fr: La récupération des métadonnées de Picard est limitée à la limitation de débit standard **une demande par seconde** pour l'API MusicBrainz. Cela devient tout à fait visible lorsque vous essayez de traiter une grande liste de fichiers, et est exacerbé par les extensions qui effectuent des demandes d'informations supplémentaires à partir de la base de données.

source: Sometimes Picard needs to rewrite the entire music file in order to add or update the tags. This can take a few seconds, and the delay becomes even longer if the file is accessed across a network (e.g.: file is read from or written to a NAS device). The recommended "best practice" is to process all files on a local drive and then move them to the desired remote directory once processing is complete.
fr: Parfois, Picard doit réécrire l'intégralité du fichier de musique afin d'ajouter ou de mettre à jour les balises. Cela peut prendre quelques secondes et le délai devient encore plus long si le fichier est accédé via un réseau (par exemple : le fichier est lu ou écrit sur un périphérique NAS). La "meilleure pratique" recommandée consiste à traiter tous les fichiers sur un lecteur local, puis à les déplacer vers le répertoire distant souhaité une fois le traitement terminé.
