Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/about_picard/introduction.po
Languages: ca, de, fr, lt, pt_br

source: Introduction
ca: Introducció
de: Einführung
lt: Įvadas
pt_br: Introdução

source: MusicBrainz Picard is a cross-platform music file tagger. For any people who don't know what this means, here is a quick explanation which can be skipped by those people who already know.
ca: MusicBrainz Picard és un editor d'etiquetes de fitxers de música multiplataforma. Per a les persones que no sàpiguen què vol dir això, aquí hi ha una explicació ràpida que poden ometre les persones que ja ho coneguin.
de: MusicBrainz Picard ist ein plattformübergreifender Tagger für Musikdateien. Für alle, die nicht wissen, was das bedeutet, hier eine kurze Erklärung, die von denjenigen, die es bereits wissen, übersprungen werden kann.
fr: MusicBrainz Picard est un tagueur de fichiers musicaux multiplateforme. Pour toutes les personnes qui ne savent pas ce que cela signifie, voici une explication rapide qui peut être ignorée par les personnes qui le savent déjà.
lt: „MusicBrainz Picard“ – tai tarpplatforminė muzikos failų žymėklė. Tiems, kurie nežino, ką tai reiškia, štai greitas paaiškinimas, kurį jau žinantys žmonės gali praleisti.
pt_br: O MusicBrainz Picard é um etiquetador de músicas multiplataforma. Para quem não sabe do que se trata, aqui vai uma breve explicação que pode ser pulada por quem já sabe.

source: Your music files don't just contain music. They also contain "metadata", consisting of "tags" which consist of a tag name or type and associated data, for example the album or track name, the name of the artist, the record label, the year of issue etc. Unless you rip the music files yourself with a very basic tool, your music files probably already contain some basic metadata, however there are literally hundreds of tags that can be applied to your music if you are interested.
ca: Els vostres fitxers de música no contenen només música. També contenen «metadades», formades per «etiquetes», que alhora estan formades per un nom o tipus d'etiqueta i dades associades: per exemple, el nom de l'àlbum o de la pista, el nom de l'artista, el segell discogràfic, l'any de publicació, etc. Tret que extraieu els fitxers de música pel vostre compte amb una eina molt bàsica, és probable que els vostres fitxers de música ja continguin metadades bàsiques, però hi ha literalment centenars d'etiquetes que podeu aplicar a la música si us interessa.
de: Deine Musikdateien enthalten nicht nur Musik. Sie enthalten auch „Metadaten“, bestehend aus „Tags“, die aus einem Tag-Namen oder -Typ und zugehörigen Daten bestehen, z. B. dem Album- oder Titelnamen, dem Namen des Künstlers, der Plattenfirma, dem Erscheinungsjahr usw. Wenn du die Musikdateien nicht selbst mit einem sehr einfachen Tool rippst, enthalten deine Musikdateien wahrscheinlich bereits einige grundlegende Metadaten, aber es gibt buchstäblich Hunderte von Tags, die du auf deine Musik anwenden kannst, wenn du daran interessiert bist.
fr: Vos fichiers musicaux ne contiennent pas que de la musique. Ils contiennent également des "métadonnées", constituées de "tags" qui se composent d'un nom ou d'un type de tag et des données associées, par exemple le nom de l'album ou de la piste, le nom de l'artiste, le label, l'année d'émission, etc. Sauf si vous extrayez vous-même les fichiers musicaux avec un outil très basique, vos fichiers musicaux contiennent probablement déjà des métadonnées de base, mais il y a littéralement des centaines de balises qui peuvent être appliquées à votre musique si vous êtes intéressé.
lt: Jūsų muzikos failai turi ne tik muziką. Jie taip pat turi „metaduomenis“, sudarytus iš „žymių“, kurios susideda iš žymės pavadinimo arba tipo ir susijusių duomenų, pavyzdžiui, albumo arba takelio pavadinimo, atlikėjo pavadinimo, leidyklos, išleidimo metų ir pan. Nebent patys iškopijuojate muzikos failus labai paprasta priemone, jūsų muzikos failai tikriausiai jau turi tam tikrus pagrindinius metaduomenis, tačiau, jei jus tai domina, jūsų muzikai galima pritaikyti šimtus žymių.
pt_br: Seus arquivos de música não contêm apenas música, mas também "metadados". Os metadados são compostos por "etiquetas" contendo o nome da etiqueta, ou seu tipo, e dado associado. Exemplos de etiquetas são nome de álbum ou trilha, nome do artista, gravadora, ano de publicação, etc. A menos que você digitalize suas músicas com ferramentas simples, seus arquivos de música provavelmente já contém alguns metadados básicos, porém existem diversas outras que podem ser do seu interesse.

source: Obviously, if you wanted to you could painstakingly research all this information for each album and track individually, and type the data into a tagging tool, but clearly it makes more sense in this internet connected age for one person to do this for each album and track, to upload that data to a shared database and then for the tagging tool to access that database and use the data to tag the music files. And **that** is what MusicBrainz Picard does.
ca: Evidentment, si ho volguéssiu, podríeu fer la tasca pesada de cercar tota aquesta informació per a cada àlbum i pista individualment i escriure les dades amb una eina d'etiquetatge, però clarament té molt més de sentit, a l'era d'Internet, que una persona ho faci per a cada àlbum i pista, que pugi les dades a una base de dades compartida i que l'eina d'etiquetatge accedeixi a la base dades i faci servir les dades per a etiquetar els fitxers de música. **Això** és el que fa MusicBrainz Picard.
de: Natürlich könnte man, wenn man wollte, all diese Informationen für jedes Album und jeden Titel einzeln recherchieren und die Daten in ein Tagging-Tool eingeben, aber im Zeitalter des Internets ist es eindeutig sinnvoller, wenn eine Person dies für jedes Album und jeden Titel tut, diese Daten in eine gemeinsame Datenbank hochlädt und das Tagging-Tool dann auf diese Datenbank zugreift und die Daten zum Taggen der Musikdateien verwendet. Und **das** ist es, was MusicBrainz Picard tut.
fr: Évidemment, si vous le souhaitez, vous pouvez rechercher minutieusement toutes ces informations pour chaque album et suivre vous-même, et saisir les données dans un outil de marquage. Cependant, à l'ère de la connexion Internet, il est clairement plus logique qu'une personne fasse cela pour chaque album et piste, puis télécharge ces données dans une base de données partagée. L'outil de marquage peut alors accéder à cette base de données et utiliser les données pour marquer les fichiers musicaux. Et **c'est** ce que fait MusicBrainz Picard.
pt_br: Obviamente, você pode procurar toda as informações que quiser e preencher as etiquetas para cada álbum e trilha individualmente utilizando um etiquetador. A internet porém nos permite trabalhar em equipe para preencher as informações e compartilhá-las uns com os outros através de bancos de dados. O banco pode ser acessado e utilizado pelo etiquetador para preencher as etiquetas dos arquivos de música. É exatamente isto que o MusicBrainz Picard faz.

source: **MusicBrainz** is the database, and **Picard** is the tool that tags the music files.
ca: **MusicBrainz** és la base de dades i **Picard** és l'eina que etiqueta els fitxers de música.
de: **MusicBrainz** ist die Datenbank, und **Picard** ist das Tool, das die Musikdateien verschlagwortet.
fr: **MusicBrainz** est la base de données et **Picard** est l'outil qui balise les fichiers musicaux.
pt_br: **MusicBrainz** é o banco de dados e **Picard** é a ferramenta que etiqueta arquivos de música.

source: This User Guide is intended to provide comprehensive information related to the use of `MusicBrainz Picard <https://picard.musicbrainz.org/>`_ and additionally to make this available in alternate formats, including a PDF version suitable for printing. Links to additional information such as scripts, plugins and tutorials are provided when available rather than trying to reproduce the information in this document.
ca: Aquesta guia de l'usuari té com a objectiu proporcionar informació exhaustiva en relació amb l'ús de `MusicBrainz Picard <https://picard.musicbrainz.org/>`_ i oferir-la en formats alternatius, incloent-hi una versió imprimible en PDF. Quan estan disponibles, es proporcionen enllaços a informació addicional, com scripts, connectors i tutorials, en comptes d'intentar reproduir la informació en aquest document.
de: Dieses Benutzerhandbuch soll umfassende Informationen über die Verwendung von `MusicBrainz Picard <https://picard.musicbrainz.org/>`_ liefern und darüber hinaus in alternativen Formaten, einschließlich einer zum Ausdrucken geeigneten PDF-Version, zur Verfügung stellen. Links zu zusätzlichen Informationen wie Skripten, Plugins und Tutorials werden angegeben, wenn sie verfügbar sind, anstatt zu versuchen, die Informationen in diesem Dokument zu reproduzieren.
fr: Ce guide de l'utilisateur a pour but de fournir des informations complètes sur l'utilisation de `MusicBrainz Picard <https://picard.musicbrainz.org/>`_ et de le rendre également disponible dans d'autres formats, y compris une version PDF adaptée à l'impression. Des liens vers des informations supplémentaires telles que des scripts, des plugins et des didacticiels sont fournis lorsqu'ils sont disponibles plutôt que d'essayer de reproduire les informations de ce document.
pt_br: Este Guia do Usuário tem como objetivo prover informações relacionadas ao uso do `MusicBrainz Picard <https://picard.musicbrainz.org/>`_ e, adicionalmente, distribuir em formatos diversos, como PDF para impressão. Links para informações adicionais, como scripts, plugins e tutoriais são listados quando disponíveis, ao invés de serem reproduzidos na íntegra neste documento.

source: There is also an :doc:`Introduction to Picard Video Tutorial </tutorials/v_introduction>` available.
ca: També hi ha disponible un :doc:`videotutorial d'introducció a Picard </tutorials/v_introduction>`.
de: Es ist auch ein Video-Tutorial :doc:`Einführung in Picard </tutorials/v_introduction>` verfügbar.

source: In order to effectively use Picard, it is important to understand what the program can do and, equally important, what it cannot do. Picard is primarily intended to tag and organize albums containing tracks, guided by the user to the specific release of the album that they have, and then to keep the metadata for these tracks up to date as users around the world enhance the quality of the MusicBrainz data associated with that particular release and track; Picard does this very well indeed. However, it is not intended to automatically organize your collection of thousands of random music files, and if this is what you are hoping for then you will likely be disappointed. To quote from the Picard website, *"Picard is not built to be a mass single-track tag fixer. Picard believes in quality over quantity and provides a plethora of customizations to tweak music collections to your needs."*
ca: Per tal de fer servir Picard de manera efectiva, és important entendre tant què pot fer el programa com què no pot fer, que té la mateixa importància. Picard està pensat principalment per a etiquetar i organitzar àlbums que contenen pistes seguint el guiatge de l'usuari sobre la publicació específica de l'àlbum que té, i mantenir les metadades d'aquestes pistes actualitzades a mesura que els usuaris de tot el món milloren la qualitat de les dades de MusicBrainz associades a la publicació i la pista; Picard és excel·lent en aquesta tasca. Ara bé, no està pensat per a organitzar automàticament una col·lecció de milers de fitxers de música aleatoris i, si això és el que n'espereu, és probable que us decebi. Citant el lloc web de Picard: *«Picard no s'ha dissenyat com a corrector massiu d'etiquetes en pistes individuals. Picard creu en la qualitat per davant de la quantitat i ofereix una àmplia varietat de personalitzacions per a ajustar les col·leccions de música a les vostres necessitats.»*
de: Um Picard effektiv nutzen zu können, ist es wichtig zu verstehen, was das Programm kann und — ebenso wichtig — was es nicht kann. Picard ist in erster Linie dazu gedacht, Alben, die einzelne Titel enthalten, mit Tags zu versehen und zu organisieren, wobei der Benutzer zu der spezifischen Veröffentlichung des Albums geführt wird, die er besitzt, und dann die Metadaten für diese Titel auf dem neuesten Stand zu halten, wenn Benutzer auf der ganzen Welt die Qualität der MusicBrainz-Daten, die mit dieser speziellen Veröffentlichung und dem Track verbunden sind, verbessern; Picard macht das wirklich sehr gut. Es ist jedoch nicht dazu gedacht, Ihre Sammlung von Tausenden von zufälligen Musikdateien automatisch zu organisieren. Wenn es das ist, was du dir erhoffst, wirst du wahrscheinlich enttäuscht sein. Um von der Picard-Website zu zitieren: *„Picard ist nicht dafür gedacht, ein Massen-Tag-Fixer für einzelne Titel zu sein. Picard setzt auf Qualität statt Quantität und bietet eine Fülle von Anpassungsmöglichkeiten, um Musiksammlungen nach deinen Wünschen zu gestalten.“*
pt_br: É importante entender o que o Picard pode e não pode fazer para utilizá-lo efetivamente. O Picard foi feito para etiquetar e organizar álbuns contendo trilhas, sendo guiado pelo usuário para o lançamento do álbum que ele tem, e então manter os metadados das trilhas atualizadas conforme usuários ao redor do mundo melhoram a qualidade dos dados do MusicBrainz associados com aquele lançamento do álbum e trilha; isto o Picard faz muito bem. Por outro lado, ele não foi feito para organizar a sua coleção de milhares de músicas aleatórias automaticamente, e pode acabar desapontado se é isto que está tentando fazer. Parafraseando o site do Picard (tradução livre), *"O Picard não foi feito para arrumar em massa etiquetas de trilhas individuais. O Picard acredita na qualidade sobre quantidade e provê uma série de opções em como ajustar sua coleção de música para o seu caso de uso."*

source: Picard Can...
ca: Què pot fer Picard
de: Picard kann …
fr: Picard peut...
lt: „Picard“ gali...
pt_br: O Picard pode...

source: ...add metadata tags to your music files, based on information available from the `MusicBrainz website <https://musicbrainz.org/>`_.
ca: Afegir etiquetes de metadades als vostres fitxers de música a partir de la informació disponible al `lloc web de MusicBrainz <https://musicbrainz.org/>`_.
de: … Musik-Dateien mit Metadaten, basierend auf den Informationen von der `MusicBrainz-Website <https://musicbrainz.org/>`_, versehen.
fr: ... ajouter des balises de métadonnées à vos fichiers musicaux, en fonction des informations disponibles sur le `site Web MusicBrainz <https://musicbrainz.org/>`_.
lt: ...pridėti metaduomenų žymes prie jūsų muzikos failų, remdamasis informacija, pasiekiama iš `„MusicBrainz“ svetainės <https://musicbrainz.org/>_;`
pt_br: ... adicionar etiqueta de metadados ao seus arquivos de música, baseado nas informações disponíveis no site do `Musicbrainz <https://musicbrainz.org/>`__.

source: ...look up the metadata either manually or automatically based on existing information, including artist and song name, disc id (for CDs), and a track's AcoustID fingerprint.
ca: Cercar les metadades manualment o automàticament a partir d'informació existent, com ara el nom de l'artista o la cançó, l'ID del disc (per als CD) i l'empremta AcoustID de la pista.
de: … die Metadaten entweder manuell oder automatisch auf der Grundlage vorhandener Informationen nachschlagen, einschließlich Interpret und Titelname, Disc-ID (bei CDs) und des AcoustID-Fingerabdrucks eines Titels.
fr: ... recherchez les métadonnées manuellement ou automatiquement en fonction des informations existantes, notamment le nom de l'artiste et du morceau, l'identifiant du disque (pour les CD) et l'empreinte digitale AcoustID d'une piste.
lt: ...ieškoti metaduomenų rankiniu būdu arba automatiškai, remdamasis esama informacija, įskaitant atlikėjo ir dainos pavadinimą, disko ID (skirti CD) ir takelio „AcoustID“ atspaudą;
pt_br: ...procurar metadados manual, ou automaticamente, baseado nas informações já existentes, incluindo nome de artista e canção, id do disco (para CDs), e digitais AcoustID da trilha.

source: ...retrieve and embed coverart images from a variety of sources.
ca: Recuperar i incrustar imatges de caràtules de diverses fonts.
de: … Cover-Bilder aus einer Vielzahl von Quellen abrufen und einbetten.
fr: ... récupérez et intégrez des images de pochettes à partir d'une variété de sources.
lt: ...gauti ir įterpti viršelio vaizdus iš įvairių šaltinių;
pt_br: ...baixar capas dos álbuns de uma variedade de fontes e embutir nos arquivos de música.

source: ...rename and place the music files in directories based on naming template instructions provided in a naming script.
ca: Canviar el nom dels fitxers de música i organitzar-los en directoris a partir de plantilles de nomenclatura proporcionades en un script de nom dels fitxers.
de: … die Musikdateien umbenennen und in Verzeichnissen ablegen, die auf den in einem Benennungsskript enthaltenen Anweisungen basieren.
fr: ... renommez et placez les fichiers musicaux dans des répertoires en fonction des instructions de modèle de dénomination fournies dans un script de dénomination.
lt: ...pervadinti ir sudėti muzikos failus kataloguose pagal pavadinimų šablono nurodymus, pateiktus pavadinimų skripte;
pt_br: ...renomear e mover arquivos de música para diretórios conforme as instruções do script de renomeação.

source: ...calculate and submit a disc id to the MusicBrainz database, attaching it to a specified release.
ca: Calcular i enviar un ID del disc a la base de dades de MusicBrainz i associar-lo a una publicació especificada.
de: … eine Disc-ID berechnen und an die MusicBrainz-Datenbank übermitteln, um sie mit einer bestimmten Veröffentlichung zu verknüpfen.
fr: ... calculer et soumettre un identifiant de disque à la base de données MusicBrainz, en le joignant à une version spécifiée.
lt: ...suskaičiuoti ir pateikti disko ID į „MusicBrainz“ duomenų bazę, pridedant jį prie konkretaus leidinio;
pt_br: ...calcular e submeter um id de disco para o banco de dados MusicBrainz, anexando-o a um lançamento específico de um álbum.

source: ...calculate and submit a music file's AcoustID fingerprint to the `AcoustID database <https://acoustid.org/>`_.
ca: Calcular i enviar l'empremta AcoustID d'un fitxer de música a la `base de dades AcoustID <https://acoustid.org/>`_.
de: … den AcoustID-Fingerabdruck einer Musikdatei berechnen und an die `AcoustID-Datenbank <https://acoustid.org/>`_ übermitteln.
fr: ... calculer et soumettre l'empreinte digitale AcoustID d'un fichier musical à la `base de données AcoustID <https://acoustid.org/>`_.
lt: ...suskaičiuoti ir pateikti muzikos failo „AcoustID“ atspaudą į `„AcoustID“ duomenų bazę <https://acoustid.org/>`_.
pt_br: ...calcular e submeter as digitais AcoustID de um arquivo de música para o banco de dados `AcoustID <https://acoustid.org/>`__.

source: Picard Cannot...
ca: Què no pot fer Picard
de: Picard kann nicht …
fr: Picard ne peut pas ...
lt: „Picard“ negali...
pt_br: Picard não pode...

source: ...automatically identify and remove all duplicate music files in your collection.
ca: Identificar i suprimir automàticament tots els fitxers de música duplicats de la vostra col·lecció.
de: … automatisch alle doppelten Musikdateien in deiner Sammlung erkennen und entfernen.
fr: ... identifier et supprimer automatiquement tous les fichiers musicaux en double de votre collection.
lt: ...automatiškai identifikuoti ir pašalinti visų dubliuojamų muzikos failų iš jūsų kolekcijos;
pt_br: ...identificar e remover automaticamente arquivos de músicas duplicadas na sua coleção.

source: ...provide metadata not already existing in the MusicBrainz database.
ca: Proporcionar metadades que encara no existeixin a la base de dades de MusicBrainz.
de: … Metadaten bereitstellen, die nicht bereits in der MusicBrainz-Datenbank vorhanden sind.
fr: ... fournir des métadonnées qui n'existent pas déjà dans la base de données MusicBrainz.
lt: ...pateikti metaduomenų, kurių neegzistuoja „MusicBrainz“ duomenų bazėje.
pt_br: ...prover metadados inexistentes no banco de dados MusicBrainz.

source: :index:`Limitations <limitations>`
ca: :index:`Limitacions <limitacions>`
de: :index:`Einschränkungen <limitations>`
fr: :index:`Limites <limites>`
lt: :index:`Ribojimai <ribojimai>`
pt_br: :index:`Limitações <limitações>`

source: **File Formats**
ca: **Formats de fitxer**
de: **Dateiformate**
fr: **Formats de fichier**
lt: **Failų formatai**
pt_br: **Formatos de Arquivos**

source: Picard currently supports most music file formats, with Matroska (.mka) being one notable exception. Microsoft WAVE (.wav) files can be fingerprinted and renamed and can be tagged using ID3v2 tags, but this is not supported by all playback software. In addition, Picard does not support writing custom tags for all formats.
ca: Actualment, Picard és compatible amb la majoria de formats de fitxer de música, amb l'excepció notable de Matroska (.mka). Es poden generar empremtes de fitxers Microsoft WAVE (.wav), canviar-ne el nom i etiquetar-los amb etiquetes ID3v2, però no tot el programari de reproducció ho admet. A més, Picard no admet escriure etiquetes personalitzades en tots els formats.
de: Picard unterstützt derzeit die meisten Musikdateiformate, wobei Matroska (.mka) eine bemerkenswerte Ausnahme darstellt. Microsoft WAVE (.wav)-Dateien können mit Fingerabdrücken versehen und umbenannt sowie mit ID3v2-Tags versehen werden, was jedoch nicht von jeder Wiedergabesoftware unterstützt wird. Darüber hinaus unterstützt Picard nicht für alle Formate das Schreiben von benutzerdefinierten Tags.
lt: „Picard“ šiuo metu palaiko daugumą muzikos failų formatų, išskyrus su Matroskos (.mka) formatą. „Microsoft“ WAVE (.wav) failai gali būti identifikuojami ir pervadinami, taip pat žymimi ID3v2 žymėmis, bet tai palaiko ne visos atkūrimo programos. Be to, „Picard“ nepalaiko pasirinktinių žymų įrašymo visais formatais.
pt_br: O Picard suporta grande parte dos formatos de arquivos, sendo Matroska (.mka) uma exceção notável. Arquivos Microsoft WAVE (.wav) pode ter suas digitais AcoustID tomadas, ser renomeados e etiquetados com etiquetas ID3v2, mas estas não são suportadas por todos os tocadores. Além disto, o Picard não suporta a escrita de etiquetas personalizadas em todos os formatos de arquivos.

source: The :doc:`Picard Tag Mappings </appendices/tag_mapping>` section provides more information regarding the mapping between Picard internal tag names and various tagging formats.
ca: La secció :doc:`Assignacions d'etiquetes de Picard </appendices/tag_mapping>` proporciona més informació en relació amb l'assignació entre els noms d'etiquetes interns de Picard i els diferents formats d'etiquetatge.
de: Der Abschnitt :doc:`Picard Tag-Zuordnung </appendices/tag_mapping>` enthält weitere Informationen über die Zuordnung zwischen Picard-internen Tag-Namen und verschiedenen Tag-Formaten.
lt: :doc:`„Picard“ žymų susiejimų </appendices/tag_mapping>` sekcija pateikia daugiau informacijos apie „Picard“ vidinių žymų pavadinimų ir įvairių žymėjimo formatų susiejimus.

source: **Request Rate Limiting**
ca: **Limitació de velocitat de les sol·licituds**
de: **Begrenzung der Abfragen**
fr: **Demande de limitation de débit**
lt: **Užklausų dažnio ribojimas**
pt_br: **Limitação de Taxa de Requisições**
