Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/functions/func_map.po
Languages: fr

source: Usage: **$map(name,code[,separator])**
fr: Utilisation: **$map(nom,code[,séparateur])**

source: Category: multi-value
fr: Catégorie: multi-valeur

source: Implemented: Picard 2.3
fr: Mis en œuvre: Picard 2.3

source: **Description:**
fr: **La description:**

source: Iterates over each element found in the multi-value variable ``name`` and updates the value of the element to the value returned by ``code``, returning the updated multi-value variable. A literal value representing a multi-value can be substituted for ``name``, using the ``separator`` (or a semicolon followed by a space "; " if not passed) to coerce the value into a proper multi-valued variable.
fr: Itère sur chaque élément trouvé dans la variable à valeurs multiples ``nom`` et met à jour la valeur de l'élément à la valeur renvoyée par ``code``, renvoyant la variable à valeurs multiples mise à jour. Une valeur littérale représentant une valeur multiple peut être remplacée par ``nom``, en utilisant le ``séparateur`` (ou un point-virgule suivi d'un espace "; " s'il n'est pas passé) pour contraindre la valeur à une valeur multiple appropriée variable.

source: For each loop, the element value is first stored in the variable ``_loop_value`` and the count is stored in the variable ``_loop_count``. This allows the element or count value to be accessed within the code script.
fr: Pour chaque boucle, la valeur de l'élément est d'abord stockée dans la variable ``_loop_value`` et le décompte est stocké dans la variable ``_loop_count``. Cela permet d'accéder à l'élément ou à la valeur de comptage dans le script de code.

source: Empty elements are automatically removed from the output.
fr: Les éléments vides sont automatiquement supprimés de la sortie.

source: You cannot save the ``code`` to a variable and then pass the variable to the function as ``%code%`` because it will be evaluated when it is assigned to the variable rather than during the loop.
fr: Vous ne pouvez pas enregistrer le ``code`` dans une variable puis passer la variable à la fonction en tant que ``%code%`` car il sera évalué lorsqu'il sera affecté à la variable plutôt que pendant la boucle.

source: **Example:**
fr: **Exemple:**

source: The following statements will return the values indicated:
fr: Les instructions suivantes renverront les valeurs indiquées :
