Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/functions/func_dateformat.po
Languages: fr

source: Usage: **$dateformat(date,[format],[date order])**
fr: Utilisation: **$dateformat(date,[format],[ordre des dates])**

source: Category: information
fr: Catégorie: information

source: Implemented: Picard 2.7
fr: Implémenté : Picard 2.7

source: Returns the input ``date`` in the specified ``format``, which is based on the standard Python ``strftime`` `format codes <https://strftime.org>`_. If no ``format`` is specified the date will be returned in the form '2020-02-15' (year, month, day).
fr: Retourne la ``date`` d'entrée dans le ``format`` spécifié, qui est basé sur les codes de ``strftime`` `standard de Python <https://strftime.org>`_. Si aucun ``format`` n'est spécifié, la date sera retournée sous la forme '2020-02-15' (année, mois, jour).

source: The "year", "month" and "day" portions of the date must be entered as numbers, and can be separated by any non-numeric characters. The default order for the input date is "ymd" (year, month, day). This can be changed by specifying a ``date order``.
fr: Les parties "année", "mois" et "jour" de la date doivent être saisies sous forme de nombres et peuvent être séparées par des caractères non numériques. L'ordre par défaut pour la date d'entrée est "ymd" (année, mois, jour). Ceci peut être modifié en spécifiant un ``ordre de date``.

source: Valid entries for ``date order`` are:
fr: Les entrées valides pour ``ordre de date`` sont :

source: **ymd** - year, month, day (This is the default order.)
fr: **ymd** - année, mois, jour (il s'agit de l'ordre par défaut).

source: **dmy** - day, month, year
fr: **dmy** - jour, mois, année

source: **mdy** - month, day, year
fr: **mdy** - mois, jour, année

source: If either the ``date`` or ``format`` are invalid an empty string will be returned. If an invalid ``date order`` is specified, the default order "ymd" will be used.
fr: Si la ``date`` ou le ``format`` sont invalides, une chaîne vide sera retournée. Si un ``ordre de date`` invalide est spécifié, l'ordre par défaut "ymd" sera utilisé.

source: Any special characters such as '%', '$', '(', ')' and '\\' will need to be escaped as shown in the examples below.
fr: Tous les caractères spéciaux tels que "%", "$", "(", ")" et "\\" devront être échappés comme indiqué dans les exemples ci-dessous.

source: Platform-specific formatting codes should be avoided to help ensure the portability of scripts across the different platforms. These codes include: remove zero-padding (e.g.: ``%-d`` and ``%-m`` on Linux or macOS, and their equivalents ``%#d`` and ``%#m`` on Windows); element length specifiers (e.g.: ``%3Y``); and hanging '%' at the end of the format string.
fr: Les codes de formatage spécifiques à une plate-forme doivent être évités afin de garantir la portabilité des scripts sur les différentes plates-formes. Ces codes comprennent : la suppression de la troncature zéro (par exemple : ``%-d`` et ``%-m`` sur Linux ou macOS, et leurs équivalents ``%#d`` et ``%#m`` sur Windows) ; les spécificateurs de longueur d'élément (par exemple : ``%3Y``) ; et les "%" suspendus à la fin de la chaîne de format.

source: **Examples:**
fr: **Exemples:**

source: The following statements will return the values indicated:
fr: Les instructions suivantes renverront les valeurs indiquées :
