Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/tutorials/acoustid.po
Languages: fr

source: Understanding :index:`Acoustic Fingerprinting <pair: acoustic; fingerprint>` and :index:`AcoustIDs <acoustid; usage>`
fr: Compréhension :index:`Empreintes acoustiques <paire: acoustique; empreinte digitale>` et :index:`AcoustIDs <acoustid; utilisation>`

source: The fingerprinting is the basis for the whole AcoustID song identification system. The audio fingerprint captures the characteristics of the recording, but there can be slight differences in the fingerprint of files of the same recording caused by such things as different encoding or bitrate. Fingerprints, along with the track metadata, are submitted to the AcoustID website where the AcoustID server combines fingerprints that are similar enough and assigns them a single AcoustID. This is actually what makes the AcoustID system really work for audio identification. The same recording can generate many slightly different fingerprints, but the AcoustID represents what the service identifies as the same recording for all of the associated fingerprints.
fr: L'empreinte digitale est la base de tout le système d'identification des chansons AcoustID. L'empreinte digitale audio capture les caractéristiques de l'enregistrement, mais il peut y avoir de légères différences dans l'empreinte digitale des fichiers du même enregistrement causées par des choses telles qu'un encodage ou un débit binaire différent. Les empreintes digitales, ainsi que les métadonnées de la piste, sont soumises au site Web AcoustID où le serveur AcoustID combine des empreintes digitales suffisamment similaires et leur attribue un seul AcoustID. C'est en fait ce qui fait que le système AcoustID fonctionne vraiment pour l'identification audio. Le même enregistrement peut générer de nombreuses empreintes digitales légèrement différentes, mais l'AcoustID représente ce que le service identifie comme étant le même enregistrement pour toutes les empreintes digitales associées.

source: What Picard does is as follows:
fr: Ce que fait Picard est le suivant:

source: When you click :menuselection:`"Scan"` on a file, Picard generates the audio fingerprint for the file, using the ``fpcalc`` command line utility provided by AcoustID.
fr: Lorsque vous cliquez sur :menuselection:`"Scan"` sur un fichier, Picard génère l'empreinte audio du fichier, en utilisant l'utilitaire de ligne de commande ``fpcalc`` fourni par AcoustID.

source: Picard uses this fingerprint to lookup an AcoustID from the AcoustID server. The AcoustID server will compare the fingerprint and will try to match it to an existing AcoustID. There are three possibilities:
fr: Picard utilise cette empreinte digitale pour rechercher un AcoustID sur le serveur AcoustID. Le serveur AcoustID comparera l'empreinte digitale et essaiera de la faire correspondre à un AcoustID existant. Il existe trois possibilités:

source: It doesn't find an AcoustID. The lookup failed.
fr: Il ne trouve pas d’AcoustID. La recherche a échoué.

source: The AcoustID server finds an existing AcoustID for the submitted fingerprint, but it is not associated with any MusicBrainz recording. The lookup failed.
fr: Le serveur AcoustID trouve un AcoustID existant pour l'empreinte digitale soumise, mais il n'est associé à aucun enregistrement MusicBrainz. La recherche a échoué.

source: The AcoustID server finds an existing AcoustID for the submitted fingerprint and it is associated with a MusicBrainz recording. Picard matches the file to one of the MusicBrainz recordings linked to the AcoustID.
fr: Le serveur AcoustID trouve un AcoustID existant pour l'empreinte digitale soumise et il est associé à un enregistrement MusicBrainz. Picard fait correspondre le fichier à l'un des enregistrements MusicBrainz liés à l'AcoustID.

source: If there was no AcoustID found you can use the :menuselection:`"Submit"` button in Picard to submit the fingerprints to the AcoustID server once you have matched the files to the proper recordings. If there is no AcoustID already existing for a fingerprint, the server will generate a new AcoustID (which can take some time). It will also link the AcoustID to the MusicBrainz recording identified by the submitted metadata. Please see the :doc:`../usage/submit_acoustid` section for a detailed step-by-step procedure.
fr: Si aucun AcoustID n'a été trouvé, vous pouvez utiliser le bouton :menuselection:`"Soumettre"` en Picard pour soumettre les empreintes digitales au serveur AcoustID une fois que vous avez fait correspondre les fichiers aux enregistrements appropriés. S'il n'existe aucun AcoustID pour une empreinte digitale, le serveur générera un nouvel AcoustID (ce qui peut prendre un certain temps). Il reliera également l'AcoustID à l'enregistrement MusicBrainz identifié par les métadonnées soumises. Veuillez consulter la section :doc:`../usage/submit_acoustid` pour une procédure détaillée étape par étape.

source: You don't need the AcoustID fingerprinting software to manually generate new AcoustIDs. The difference is, that the fingerprinting software is meant to be run on already tagged files, so if it cannot find an AcoustID it will immediately do the submission. For Picard the AcoustID is primarily an identification tool, and because the files are considered untagged at this *identification* stage, you can only do the submission once the files have been properly matched to a MusicBrainz recording. You will also find that after submission Picard will not automatically fetch the newly generated AcoustIDs. This is because the generation can take some time, and the response received from the AcoustID server does not contain newly generated AcoustIDs. However, if you do another scan on the files after submission, the AcoustID should be available.
fr: Vous n’avez pas besoin du logiciel d’empreinte digitale AcoustID pour générer manuellement de nouveaux AcoustID. La différence est que le logiciel d'empreintes digitales est conçu pour être exécuté sur des fichiers déjà marqués, donc s'il ne trouve pas d'AcoustID, il effectuera immédiatement la soumission. Pour Picard, l'AcoustID est avant tout un outil d'identification, et comme les fichiers sont considérés comme non étiquetés à ce stade *d'identification*, vous ne pouvez faire la soumission qu'une fois que les fichiers ont été correctement mis en correspondance avec un enregistrement MusicBrainz. Vous constaterez également qu'après la soumission, Picard ne récupérera pas automatiquement les AcoustIDs nouvellement générés. En effet, la génération peut prendre un certain temps et la réponse reçue du serveur AcoustID ne contient pas les AcoustID nouvellement générés. Cependant, si vous effectuez une autre analyse des fichiers après la soumission, l'AcoustID devrait être disponible.

source: If files are matched using :menuselection:`"Scan"` and then :menuselection:`"Generate fingerprints"` is used on them, submission will not be enabled, because they have already been matched by fingerprint. This is the same situation as just using :menuselection:`"Scan"`, because after the files are scanned the resulting fingerprint / recording ID is remembered as already having been submitted.
fr: Si les fichiers sont mis en correspondance en utilisant :menuselection:`"Scan"` puis :menuselection:`"Générer des empreintes digitales"` est utilisé sur eux, la soumission ne sera pas activée, car ils ont déjà été comparés par empreinte digitale. C'est la même situation que d'utiliser simplement :menuselection:`"Scan"`, car une fois les fichiers scannés, l'empreinte digitale / l'ID d'enregistrement résultant est mémorisé comme ayant déjà été soumis.

source: Also if you have files matched to tracks and use :menuselection:`"Generate fingerprints"` and are able to successfully submit the fingerprints, attempting to use :menuselection:`"Generate fingerprints"` for the same files and tracks again does not re-enable submission for those files. The reason is the same: Picard remembers the fingerprint / recording ID combinations already being submitted. However, restarting Picard (or even just removing and re-adding those files) and then using :menuselection:`"Generate fingerprints"` will enable submission again.
fr: Aussi si vous avez des fichiers correspondant aux pistes et que vous utilisez :menuselection:`"Générer des empreintes digitales"` et que vous êtes en mesure de soumettre avec succès les empreintes digitales, essayer d'utiliser :menuselection:`"Générer des empreintes digitales"` pour les mêmes fichiers et pistes à nouveau ne re-activer la soumission de ces fichiers. La raison est la même: Picard se souvient des combinaisons d'empreintes digitales / ID d'enregistrement déjà soumises. Cependant, le redémarrage de Picard (ou même simplement la suppression et l'ajout de ces fichiers) puis l'utilisation de :menuselection:`"Générer des empreintes digitales"` permettra à nouveau de soumettre.

source: Fingerprints are submitted in batches depending on fingerprint size, but often up to 200 or 250 fingerprints can be submitted in one batch. A submission request for a batch might fail due to various reasons such as networking or server issues. If a request fails, all of the fingerprints of this submission batch are still marked as not having been submitted and submission could be retried.
fr: Les empreintes digitales sont soumises par lots en fonction de la taille des empreintes digitales, mais souvent jusqu'à 200 ou 250 empreintes digitales peuvent être soumises en un seul lot. Une demande de soumission pour un lot peut échouer pour diverses raisons, telles que des problèmes de réseau ou de serveur. Si une demande échoue, toutes les empreintes digitales de ce lot de soumission sont toujours marquées comme n'ayant pas été soumises et la soumission peut être réessayée.

source: You can also use :menuselection:`"Generate fingerprints"` on either unmatched or matched files. This will only generate the acoustic fingerprints without doing any lookup on the AcoustID server. This also means there will be no AcoustID tag created. However, you can submit these fingerprints if you match the fingerprinted files to a track.
fr: Vous pouvez également utiliser :menuselection:`"Générer des empreintes digitales"` sur des fichiers non correspondants ou correspondants. Cela ne générera que les empreintes acoustiques sans effectuer de recherche sur le serveur AcoustID. Cela signifie également qu'aucune balise AcoustID ne sera créée. Cependant, vous pouvez soumettre ces empreintes digitales si vous associez les fichiers d'empreintes digitales à une piste.
