Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/tutorials/android_app.po
Languages: fr

source: Loading releases with MusicBrainz for :index:`Android <android; app>`
fr: Chargement des parutions avec MusicBrainz pour :index:`Android <android; app>`

source: If you have an Android phone you can use the MusicBrainz for Android app to search for releases by text search or by barcode and load them into Picard running on your computer.
fr: Si vous disposez d'un téléphone Android, vous pouvez utiliser l'application MusicBrainz for Android pour rechercher les sorties par recherche textuelle ou par code-barres et les charger dans Picard sur votre ordinateur.

source: This is useful for example if you have previously ripped your CDs and now you want to tag your ripped files with Picard using exactly the data for your the releases you own. You can then use your phone to scan the barcodes of your CDs and have their data loaded into Picard, then use this data to tag your local files.
fr: C'est utile par exemple si vous avez déjà extrait vos CD et que vous voulez maintenant étiqueter vos fichiers extraits avec Picard en utilisant exactement les données des disques que vous possédez. Vous pouvez alors utiliser votre téléphone pour scanner les codes-barres de vos CD et charger leurs données dans Picard, puis utiliser ces données pour étiqueter vos fichiers locaux.

source: For this to work you need both your phone and computer to be connected to the same network.
fr: Pour que cela fonctionne, votre téléphone et votre ordinateur doivent être connectés au même réseau.

source: Configuring Picard
fr: Configuration du Picard

source: In :menuselection:`Options --> Options... --> Advanced --> Network` enable "Browser Integration" and disable "Listen only on localhost". It is recommended that you keep the listening port on the default value 8000, but you can change that as well.
fr: Dans :menuselection:`Options --> Options... --> Avancées --> Réseau`, activez "Intégration du navigateur" et désactivez "Écoute uniquement sur localhost". Il est recommandé de conserver le port d'écoute sur la valeur par défaut 8000, mais vous pouvez également le modifier.

source: Once you have saved the options, check whether Picard is showing a message "Listening on port 8000" in the status bar on the lower right of the main window.
fr: Une fois les options enregistrées, vérifiez si Picard affiche le message "Listening on port 8000" dans la barre d'état en bas à droite de la fenêtre principale.

source: Picard status bar showing the listening port number
fr: Barre d'état Picard montrant le numéro du port d'écoute

source: The actual port number can vary, but the default is 8000. Note the port number, you will need it to configure the Android app in the next step.
fr: Le numéro de port réel peut varier, mais le numéro par défaut est 8000. Notez le numéro de port, vous en aurez besoin pour configurer l'application Android à l'étape suivante.

source: :doc:`Network options </config/options_network>`
fr: :doc:`Options de réseau </config/options_network>`

source: Installing and configuring the MusicBrainz Android app
fr: Installation et configuration de l'application MusicBrainz Android

source: Install `MusicBrainz for Android <https://github.com/metabrainz/musicbrainz-android>`_ on your phone. You can download the latest version of the app either from the `Google Play Store <https://play.google.com/store/apps/details?id=org.metabrainz.android>`_ or `F-Droid <https://f-droid.org/packages/org.metabrainz.android/>`_.
fr: Installez `MusicBrainz pour Android <https://github.com/metabrainz/musicbrainz-android>`_ sur votre téléphone. Vous pouvez télécharger la dernière version de l'application soit sur le `Google Play Store <https://play.google.com/store/apps/details?id=org.metabrainz.android>`_ ou `F-Droid <https://f-droid.org/packages/org.metabrainz.android/>`_.

source: Once installed, launch the app and tap on the settings icon on the upper right. Scroll down to the Picard settings. For the IP Address enter the IP address of your computer on which Picard is running. Depending on your local network setup you might also be able to enter the hostname of your computer instead of the IP address.
fr: Une fois installée, lancez l'application et appuyez sur l'icône des paramètres en haut à droite. Faites défiler la liste jusqu'aux paramètres de Picard. Pour l'adresse IP, entrez l'adresse IP de votre ordinateur sur lequel Picard fonctionne. Selon la configuration de votre réseau local, vous pouvez également entrer le nom d'hôte de votre ordinateur au lieu de l'adresse IP.

source: MusicBrainz for Android settings screen
fr: Écran des paramètres de MusicBrainz pour Android

source: For the Port enter Picard's listening port as displayed in Picard's main screen (see the previous section). The default is 8000.
fr: Pour le Port, entrez le port d'écoute de Picard tel qu'il est affiché dans l'écran principal de Picard (voir la section précédente). La valeur par défaut est 8000.

source: Before you continue make sure Picard is running and the "Listening on port..." status message is shown. Also make sure your phone is connected to your local network.
fr: Avant de continuer, assurez-vous que Picard est en cours d'exécution et que le message d'état "Listening on port..." est affiché. Assurez-vous également que votre téléphone est connecté à votre réseau local.

source: Loading releases by barcode
fr: Chargement des communiqués par code-barres

source: You can use your phone as a barcode scanner to load the metadata for your physical media:
fr: Vous pouvez utiliser votre téléphone comme un scanner de codes-barres pour charger les métadonnées de vos supports physiques:

source: On the main screen of the Android app tap on "Scan".
fr: Sur l'écran principal de l'application Android, tapez sur "Scan".

source: MusicBrainz for Android main screen
fr: Écran principal de MusicBrainz pour Android

source: Scan the barcode of a CD, LP or other music media.
fr: Scannez le code-barres d'un CD, d'un disque ou d'un autre support musical.

source: MusicBrainz for Android barcode scanner
fr: Scanner de codes-barres MusicBrainz pour Android

source: If a release with the scanned barcode is found on MusicBrainz the app will load and show the release details.
fr: Si une parution avec le code-barres scanné est trouvée sur MusicBrainz, l'application se chargera et montrera les détails de la parution.

source: MusicBrainz for Android release details
fr: Détails de la sortie de MusicBrainz pour Android

source: Tap on "Send to Picard". If everything was configured correctly the release will be loaded into Picard running on your computer.
fr: Tapez sur « Envoyer à Picard ». Si tout a été configuré correctement, la parution sera chargée dans Picard sur votre ordinateur.

source: Release loaded into Picard
fr: Communiqué chargé dans Picard

source: You can now continue tagging your local files by matching them to the loaded tracks as described in :ref:`ref-match-files`.
fr: Vous pouvez maintenant continuer à étiqueter vos fichiers locaux en les faisant correspondre aux pistes chargées comme décrit dans :ref:`ref-match-files`.

source: If you only want to use the barcode scanner functionality to find and load releases for your physical CDs, LPs or other music media, you can also use the `Picard Barcode Scanner <https://github.com/phw/PicardBarcodeScanner>`_ app. The functionality and setup is similar to what is described above, but the app is focused on the barcode scanning and sending the results to Picard.
fr: Si vous souhaitez uniquement utiliser la fonctionnalité de scanner de codes barres pour trouver et charger les sorties de vos CD physiques, LP ou autres supports musicaux, vous pouvez également utiliser l'application `Picard Barcode Scanner <https://github.com/phw/PicardBarcodeScanner>`_. La fonctionnalité et la configuration sont similaires à ce qui est décrit ci-dessus, mais l'application se concentre sur la lecture des codes barres et l'envoi des résultats à Picard.

source: Loading releases by search
fr: Chargement des communiqués par recherche

source: Instead of searching by barcode you can also do a text search on your phone:
fr: Au lieu d'effectuer une recherche par code-barres, vous pouvez également effectuer une recherche textuelle sur votre téléphone:

source: On the main screen of the Android app tap on "Search".
fr: Sur l'écran principal de l'application Android, tapez sur "Recherche".

source: On the search page select "Release" and enter a search term, e.g. an album title or artist name.
fr: Sur la page de recherche, sélectionnez "Release" et entrez un terme de recherche, par exemple un titre d'album ou un nom d'artiste.

source: MusicBrainz for Android release search
fr: Sortie de MusicBrainz pour Android : recherche

source: The search results will show a list of matching releases. Tap on one to show the release details.
fr: Les résultats de la recherche affichent une liste de communiqués correspondants. Tapez sur l'un d'entre eux pour afficher les détails du communiqué.

source: Loading releases from the Tagger
fr: Chargement des communiqués du Tagger

source: Instead of finding a release by barcode or a search to send to Picard, you can also send a release from a tagged audio file currently stored on your device:
fr: Au lieu de trouver un communiqué par code-barres ou par une recherche pour l'envoyer à Picard, vous pouvez également envoyer un communiqué à partir d'un fichier audio balisé actuellement stocké sur votre appareil:

source: On the main screen of the Android app tap on "Tagger".
fr: Sur l'écran principal de l'application Android, tapez sur "Tagger".

source: On the tagger, select your release and tap the MusicBrainz icon near the bottom of the screen.
fr: Dans le marqueur, sélectionnez votre parution et tapez sur l'icône MusicBrainz en bas de l'écran.

source: MusicBrainz for Android tagger
fr: Tagger MusicBrainz pour Android

source: If everything was configured correctly, the release will be loaded into Picard running on your computer.
fr: Si tout a été configuré correctement, la parution sera chargée dans Picard qui tourne sur votre ordinateur.
