Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/tutorials/multiple_release_countries.po
Languages: fr

source: Handling of :index:`multiple release countries <multiple release countries, release countries; multiple>`
fr: Gestion de :index:`plusieurs pays de sortie <plusieurs pays de sortie, pays de sortie; plusieurs>`.

source: Some releases, especially digital releases, can have a very long list of release countries, sometimes listing all of the world's countries except for a few where the release is not officially available. Picard offers some tools to handle this.
fr: Certaines sorties, en particulier les sorties numériques, peuvent avoir une très longue liste de pays de sortie, listant parfois tous les pays du monde sauf quelques-uns où la sortie n'est pas officiellement disponible. Picard propose quelques outils pour gérer cela.

source: Let’s take the release **Bleach**, by Nirvana (MusicBrainz release `adab3feb-1822-4d27-a997-db7d6c9688c0 <https://musicbrainz.org/release/adab3feb-1822-4d27-a997-db7d6c9688c0>`_) as an example.
fr: Prenons l'exemple de **Bleach**, de Nirvana (MusicBrainz release `adab3feb-1822-4d27-a997-db7d6c9688c0 <https://musicbrainz.org/release/adab3feb-1822-4d27-a997-db7d6c9688c0>`_).

source: By default Picard will write a single ``releasecountry`` tag to the files. Prior to v2.3.1, Picard had been populating the tag with what the MusicBrainz server returned as the country for the release. If there were multiple release events, this country field was just filled with the first one in alphabetical order (Afghanistan in our example). Picard v2.3.1 introduced some options to better handle this.
fr: Par défaut, Picard écrit une seule balise ``releasecountry`` dans les fichiers. Avant la v2.3.1, Picard remplissait cette balise avec ce que le serveur MusicBrainz retournait comme pays pour la sortie. S'il y avait plusieurs sorties, ce champ pays était simplement rempli avec le premier par ordre alphabétique (Afghanistan dans notre exemple). Picard v2.3.1 a introduit quelques options pour mieux gérer ce problème.

source: Using preferred release countries
fr: Utilisation des pays de diffusion préférés

source: If you configure preferred release countries in :menuselection:`"Options --> Metadata --> Preferred Releases"`. Picard will use the first country from the preferred release countries that is also in the list of release events. So if you have configured preferred release countries to be Europe, Canada, Germany and UK, for our example that would mean the ``releasecountry`` tag gets set to Canada.
fr: Si vous configurez les pays de publication préférés dans :menuselection:`"Options --> Metadata --> Preferred Releases"`. Picard utilisera le premier pays de la liste des pays de diffusion préférés qui se trouve également dans la liste des événements de diffusion. Ainsi, si vous avez configuré les pays de diffusion préférés comme étant l'Europe, le Canada, l'Allemagne et le Royaume-Uni, dans notre exemple, cela signifie que la balise ``releasecountry`` sera définie sur le Canada.

source: Using scripting to set a different country
fr: Utilisation de scripts pour définir un pays différent

source: Picard v2.3.1 also added a new variable ``%_releasecountries%``, which provides the complete list of release countries for a release as a multi-value variable. You can use this to set different values for the ``releasecountry`` tag.
fr: Picard v2.3.1 a également ajouté une nouvelle variable ``%_releasecountries%``, qui fournit la liste complète des pays de diffusion d'une version sous la forme d'une variable à plusieurs valeurs. Vous pouvez l'utiliser pour définir différentes valeurs pour la balise ``releasecountry``.

source: For example, the following script would set it to "\[International\]" if there are 10 or more release countries:
fr: Par exemple, le script suivant lui attribue la valeur "\[International\]" s'il y a 10 pays de diffusion ou plus:

source: Of course you can adjust the count and the replacement text to your liking. You can also choose to save the entire list instead of just a single country to this tag using the script:
fr: Bien entendu, vous pouvez ajuster le nombre de pays et le texte de remplacement à votre convenance. Vous pouvez également choisir d'enregistrer la liste entière au lieu d'un seul pays dans cette balise en utilisant le script:

source: Perhaps you prefer to limit this list to the first few entries. The following example just uses the first 6 countries:
fr: Vous préférez peut-être limiter cette liste aux premières entrées. L'exemple suivant utilise uniquement les 6 premiers pays:

source: What’s missing?
fr: Qu'est-ce qui manque?

source: Countries are currently written to the tags as their ISO 3166-1 country code, with some special values added for historical countries and things like \[Europe\] or \[Worldwide\]. These codes are not always easily recognizable or obvious, such as "DZ" for Algeria or "DE" for Germany. You can of course use scripting to make these more readable. For example, if you want to see "United Kingdom" instead of "GB" in this tag use:
fr: Les pays sont actuellement inscrits dans les balises sous leur code pays ISO 3166-1, avec quelques valeurs spéciales ajoutées pour les pays historiques et des choses comme \[Europe\] ou \[Worldwide\]. Ces codes ne sont pas toujours facilement reconnaissables ou évidents, comme "DZ" pour l'Algérie ou "DE" pour l'Allemagne. Vous pouvez bien sûr utiliser des scripts pour les rendre plus lisibles. Par exemple, si vous voulez voir "United Kingdom" au lieu de "GB" dans cette balise, utilisez:

source: This might work if you deal only with a couple of countries in your collection, or you just want to handle some special cases like using "Europe" instead of "XE" such as in the following script:
fr: Cela peut fonctionner si vous ne traitez que quelques pays dans votre collection, ou si vous voulez simplement gérer certains cas particuliers comme l'utilisation de "Europe" au lieu de "XE", comme dans le script suivant:

source: A change has been submitted to Picard to add a ``$countryname()`` function to easily convert the code into a readable name; however this is not scheduled for release until Picard v2.7.
fr: Un changement a été soumis à Picard pour ajouter une fonction ``$countryname()`` afin de convertir facilement le code en un nom lisible ; cependant, cette fonction n'est pas prévue avant la version 2.7 de Picard.
