Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/tutorials/naming_script.po
Languages: fr

source: Writing a :index:`File Naming Script <script; file naming, file naming script>`
fr: Ecriture d'un :index:`script de nommage de fichier <script de nommage de fichier>`

source: Writing a script to organize and name your files is actually not that hard -- just don’t get intimidated by all the '$', '%' and parentheses. If you can write down a pattern like "**ARTIST - (YEAR) ALBUM NAME/TRACK - SONG TITLE**" of how you want the files and folders named, you can quite easily translate this to the proper script.
fr: Ecrire un script pour organiser et nommer vos fichiers n'est en fait pas si difficile - ne vous laissez pas intimider par tous les '$', '%' et les parenthèses. Si vous pouvez écrire un modèle comme "**ARTISTE - (ANNÉE) NOM/PISTE DE L'ALBUM - TITRE DE LA CHANSON**" de la façon dont vous voulez que les fichiers et dossiers soient nommés, vous pouvez facilement traduire cela dans le script approprié.

source: Note that the use of a '/' in the formatting string separates the output directory from the file name. The formatting string is allowed to contain any number of '/' characters. Everything before the last '/' is the directory location, and everything after the last '/' becomes the file's name. In our example, we only have one '/' character, meaning that we will have one directory level for the album which will contain the songs for that album.
fr: Notez que l'utilisation d'un '/' dans la chaîne de formatage sépare le répertoire de sortie du nom de fichier. La chaîne de mise en forme peut contenir n'importe quel nombre de caractères '/'. Tout ce qui précède le dernier '/' est l'emplacement du répertoire, et tout ce qui se trouve après le dernier '/' devient le nom du fichier. Dans notre exemple, nous n'avons qu'un seul caractère '/', ce qui signifie que nous aurons un niveau de répertoire pour l'album qui contiendra les chansons de cet album.

source: First, let's have a look at what we need. You see a list of the available tags in the :doc:`../variables/tags_basic` section. We want the **ARTIST** name, so available tags for this could be ``albumartist`` or ``artist``. This should be the name for an album folder, so ``albumartist`` sounds like what we need. To get the actual value for a tag you need to enclose its name in percent signs. So let’s start:
fr: Voyons d'abord ce dont nous avons besoin. Vous voyez une liste des balises disponibles dans la section :doc:`../variables/tags_basic`. Nous voulons le nom **ARTISTE**, donc les balises disponibles pour cela pourraient être ``albumartist`` ou ``artist``. Cela devrait être le nom d'un dossier d'album, donc ``albumartist`` ressemble à ce dont nous avons besoin. Pour obtenir la valeur réelle d'une balise, vous devez mettre son nom entre des signes de pourcentage. Alors commençons:

source: Now we want the **YEAR**. There is no ``year`` tag, but there is ``date``. Let’s use this for now. If we want to add extra text like the "**-**" just write it down. We need to be careful with the parentheses, because those are special variables in scripting. We need to prefix them with a backslash. Let’s add this all:
fr: Maintenant, nous voulons le **ANNÉE**. Il n'y a pas de balise ``année``, mais il y a ``date``. Utilisons ceci pour le moment. Si nous voulons ajouter du texte supplémentaire comme le "**-**", écrivez-le simplement. Nous devons faire attention aux parenthèses, car ce sont des variables spéciales dans les scripts. Nous devons les préfixer avec une barre oblique inverse. Ajoutons tout cela:

source: Now we want the **ALBUM NAME**. That’s simple, just use ``album``:
fr: Nous voulons maintenant le **NOM DE L'ALBUM**. C'est simple, utilisez simplement ``album``:

source: That takes care of the directory portion of the renaming. The next part is the **TRACK** number and **SONG TITLE**. The track number is available as ``tracknumber`` and the title of the track is simply ``title``. Adding these to our script we get:
fr: Cela prend en charge la partie répertoire du changement de nom. La partie suivante est le numéro **PISTE DE L'ALBUM** et **TITRE DE LA CHANSON**. Le numéro de piste est disponible sous forme de ``tracknumber`` et le titre de la piste est simplement ``title``. En les ajoutant à notre script, nous obtenons:

source: You can see that this looks nearly like the pattern that we said we wanted at the start. It’s not perfect yet for a few reasons. What if there are 10 or more tracks on the album and they don't sort properly in the directory listing? Also, we get a full date instead of just the year. Finally, sometimes if you tag existing files they might not have the ``albumartist`` set, just ``artist``.
fr: Vous pouvez voir que cela ressemble presque au modèle que nous avons dit que nous voulions au début. Ce n’est pas encore parfait pour plusieurs raisons. Que faire s'il y a 10 pistes ou plus sur l'album et qu'elles ne sont pas triées correctement dans la liste du répertoire? De plus, nous obtenons une date complète au lieu de seulement l'année. Enfin, parfois, si vous marquez des fichiers existants, ils peuvent ne pas avoir le jeu ``albumartist``, juste ``artiste``.

source: Let’s fix the track number first. We can take care of that by using the ``$num()`` function to add a leading zero to the number shown for tracks 1 through 9:
fr: Fixons d'abord le numéro de la piste. Nous pouvons nous en occuper en utilisant la fonction ``$num()`` pour ajouter un zéro non significatif au numéro affiché pour les pistes 1 à 9:

source: Now let’s fix the **ARTIST**. We can fallback to using ``artist`` if ``albumartist`` is not available by using:
fr: Maintenant, corrigeons le **ARTISTE**. Nous pouvons revenir à l'utilisation de ``artist`` si ``albumartist`` n'est pas disponible en utilisant:

source: The ``$if2()`` function uses the first value that is not empty, so if ``albumartist`` is empty it uses ``artist`` instead.
fr: La fonction ``$if2()`` utilise la première valeur qui n'est pas vide, donc si ``albumartist`` est vide, il utilise ``artist`` à la place.

source: For the ``date`` tag the dates from MusicBrainz are always formatted as YYYY-MM-DD. We only need the year, so let’s get just the first 4 characters with the ``$left()`` function:
fr: Pour la balise ``date``, les dates de MusicBrainz sont toujours au format AAAA-MM-JJ. Nous n'avons besoin que de l'année, donc n'obtenons que les 4 premiers caractères avec la fonction ``$left()``:

source: What happens if there is no ``date`` tag information? Sometimes MusicBrainz does not have the release date of an album set as it is not yet known or hasn't been entered into the database. It would be great to omit the entire date with the parentheses in this case. Let’s use the ``$if()`` function to check whether the date is set:
fr: Que se passe-t-il s'il n'y a pas d'informations d'étiquette ``date``? Parfois, MusicBrainz n'a pas la date de sortie d'un album, car elle n'est pas encore connue ou n'a pas été entrée dans la base de données. Ce serait bien d'omettre la date entière avec les parenthèses dans ce cas. Utilisons la fonction ``$if()`` pour vérifier si la date est définie:

source: Alternately, we can enter a placeholder such a "**0000**" if the date is missing:
fr: Alternativement, nous pouvons entrer un espace réservé tel que "**0000**" si la date est manquante:

source: And there you have it -- the final script for naming your files developed from the pattern that we used as our starting point.
fr: Et là vous l'avez - le script final pour nommer vos fichiers développé à partir du modèle que nous avons utilisé comme point de départ.

source: For additional information about the available tags and variables please see the :doc:`../variables/variables` section. For information about the script functions available please see the :doc:`../functions/list_by_type` section.
fr: Pour plus d'informations sur les balises et variables disponibles, veuillez consulter la section :doc:`../variables/variables`. Pour plus d'informations sur les fonctions de script disponibles, veuillez consulter la section :doc:`../functions/list_by_type`.
