Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/tutorials/write_plugin.po
Languages: fr, pt_br

source: Writing a :index:`Plugin <plugin; writing>`
fr: Écriture d'un :index:`Plugin <plugin ; écriture>`
pt_br: Criando um :index:`Plugin <plugin; writing>`

source: You have a great idea for extending Picard with a plugin but don't know where to start. Unfortunately, this is a common problem and prevents far too many of those great ideas from ever seeing the light of day. Perhaps this tutorial will help get you started in turning your great idea a reality.
fr: Vous avez une excellente idée pour étendre Picard avec un plugin mais vous ne savez pas par où commencer. Malheureusement, c'est un problème courant qui empêche beaucoup trop de ces grandes idées de voir le jour. Peut-être que ce tutoriel vous aidera à commencer à transformer votre grande idée en réalité.
pt_br: Digamos que você tem uma idéia brilhante de como extender o Picard e poderia fazer isto com um plugin, mas não faz idéia de por onde começar. Infelizmente este é um problema comum e que impede diversas idéias de acontecerem. Talvez este tutorial seja capaz de te ajudar a começar a transformar sua idéia em realidade.

source: Picard plugins are written in Python, so that's the programming language you'll be using. Please check the `INSTALL.md <https://github.com/metabrainz/picard/blob/master/INSTALL.md>`_ file in the Picard repository on GitHub to see the minimum version requirements. This is Python 3.6 as of the time this tutorial was written. Also refer to the :doc:`Plugins API <../appendices/plugins_api>` for additional information, including the parameters passed to each of the function types.
fr: Les plugins Picard sont écrits en Python, c'est donc le langage de programmation que vous utiliserez. Veuillez vérifier le fichier `INSTALL.md <https://github.com/metabrainz/picard/blob/master/INSTALL.md>`_ dans le dépôt Picard sur GitHub pour voir la version minimale requise. Il s'agit de Python 3.6 au moment où ce tutoriel a été écrit. Consultez également la :doc:`Plugins API <../appendices/plugins_api>` pour obtenir des informations supplémentaires, notamment les paramètres passés à chacun des types de fonctions.

source: For the purpose of this tutorial, we're going to develop a simple plugin to save the argument information provided by Picard to ``track`` and ``release`` processing plugins. This will demonstrate how the information is accessed, and will provide a utility that you might find useful when developing your own plugins. This is based on the `Data Dumper <https://github.com/rdswift/picard-plugins/tree/2.0_RDS_Plugins/plugins/data_dumper>`_ plugin.
fr: Pour les besoins de ce tutoriel, nous allons développer un plugin simple pour sauvegarder les informations sur les arguments fournis par Picard aux plugins de traitement ``track`` et ``release``. Cela démontrera comment on accède à ces informations, et fournira un utilitaire que vous pourrez trouver utile lorsque vous développerez vos propres plugins. Ceci est basé sur le plugin `Data Dumper <https://github.com/rdswift/picard-plugins/tree/2.0_RDS_Plugins/plugins/data_dumper>`_.

source: The first thing that we'll need to include is the header information that describes the plugin.
fr: La première chose que nous devons inclure est l'information d'en-tête qui décrit le plugin.
pt_br: A primeira coisa a se fazer é incluir o cabeçalho com informações que descrevem o plugin.

source: Next we list the modules that will be referenced in our code. In this case, we will be using the ``os`` module to build the output file path, and the ``json`` module to format the argument dictionary text for readability. We will be saving our output file to the base directory used for file naming so we import the ``config`` module from Picard, as well as the ``log`` module so that we can write debug or error messages to Picard's log. Finally, we import the appropriate processing hooks and plugin priority settings.
fr: Ensuite, nous listons les modules qui seront référencés dans notre code. Dans ce cas, nous utiliserons le module ``os`` pour construire le chemin du fichier de sortie, et le module ``json`` pour formater le texte du dictionnaire d'arguments pour une meilleure lisibilité. Nous enregistrerons notre fichier de sortie dans le répertoire de base utilisé pour le nommage des fichiers. Nous importons donc le module ``config`` de Picard, ainsi que le module ``log`` pour pouvoir écrire des messages de débogage ou d'erreur dans le journal de Picard. Enfin, nous importons les hooks de traitement appropriés et les paramètres de priorité des plugins.
pt_br: Em seguida, nós listamos os módulos referenciados no nosso código. Neste caso, nós usamos os módulos ``os`` e ``json`` para montar o caminho do arquivo de saída e formatar o dicionário para legibilidade respectivamente. Nós iremos salvar nosso arquivo de saída no diretório base utilizado para renomeação de arquivos, então importamos o módulo ``config`` do Picard, assim como o módulo ``log`` para que possamos escrever mensagens de depuração e erro no arquivo de log do Picard. Finalmente, importamos funções para registrar ganchos de processamento e configurações de prioridade dos plugins.

source: To ensure maximum compatibility, you should only use standard Python modules, or third-party modules that are already included in Picard. If you use other modules, then the plugin will not function properly if used on a system that doesn't have the proper version of the module installed or if someone is using an executable version of Picard.
fr: Pour assurer une compatibilité maximale, vous ne devez utiliser que des modules Python standard, ou des modules tiers qui sont déjà inclus dans Picard. Si vous utilisez d'autres modules, alors le plugin ne fonctionnera pas correctement s'il est utilisé sur un système qui n'a pas la bonne version du module installé ou si quelqu'un utilise une version exécutable de Picard.
pt_br: Para garantir uma maior compatibilidade, tente usar apenas módulos padrão Python ou módulos de terceiros já inclusos no Picard. Se quiser usar outros, o plugin não funcionará corretamente se utilizado em um sistema sem a versão adequada daquele módulo ou se alguém estiver usando uma versão executável do Picard.

source: Now we can start adding the code that we want Picard to execute. First we'll identify the output file to store the parameter information provided by Picard. This is a file named ``data_dump.txt`` to be stored in the file naming output directory. We find the name of the configuration setting we need, ``move_files_to``, by examining the Picard source code for the corresponding option setting screen. In this case it is `picard/ui/options/renaming.py <https://github.com/metabrainz/picard/blob/master/picard/ui/options/renaming.py#L90>`_.
fr: Maintenant nous pouvons commencer à ajouter le code que nous voulons que Picard exécute. Tout d'abord, nous allons identifier le fichier de sortie pour stocker les informations sur les paramètres fournis par Picard. Il s'agit d'un fichier nommé ``data_dump.txt`` qui sera stocké dans le répertoire de sortie du nommage des fichiers. Nous trouvons le nom du paramètre de configuration dont nous avons besoin, ``move_files_to``, en examinant le code source de Picard pour l'écran de paramétrage des options correspondant. Dans ce cas, il s'agit de `picard/ui/options/renaming.py <https://github.com/metabrainz/picard/blob/master/picard/ui/options/renaming.py#L90>`_.

source: The next part is a function to write a Python object to our output file. To allow the same function to be used for different situations, we include parameters to identify the type of line (input type), the object to write, and options for writing to JSON format and appending or overwriting an existing output file. In our case, we want to overwrite the file each time a new release is processed, but always append the track information to the file.
fr: La partie suivante est une fonction permettant d'écrire un objet Python dans notre fichier de sortie. Pour permettre à la même fonction d'être utilisée dans différentes situations, nous incluons des paramètres pour identifier le type de ligne (type d'entrée), l'objet à écrire, et des options pour écrire au format JSON et ajouter ou écraser un fichier de sortie existant. Dans notre cas, nous voulons écraser le fichier à chaque fois qu'une nouvelle version est traitée, mais toujours ajouter les informations sur les pistes au fichier.
pt_br: A próxima etapa é chamar a função que escreve um objeto Python para o nosso arquivo de saída. Para permitir que a mesma função seja reutilizada em situações diferentes, incluímos os parâmetros que identificam o tipo da linha (tipo de entrada), o objeto a ser escrito, além das opções para escrever em JSON subescrevendo o arquivo de saída ou escrevendo ao seu final (apensar). No nosso caso, queremos sobrescrever o arquivo para cada novo lançamento processado, mas apensar informações das trilhas do lançamento ao documento.

source: We also include error checking to write an entry to the Picard log in the event of an exception.
fr: Nous avons également inclus un contrôle d'erreur pour écrire une entrée dans le journal Picard en cas d'exception.
pt_br: Também incluímos uma checagem de erro que escreve uma entrada no log de eventos do Picard em caso de exceção.

source: Now we include the functions to be called when releases and tracks are retrieved by Picard. The release function hook provides three arguments, and the track function hook provides four arguments. The argument types are described in the :doc:`Plugins API <../appendices/plugins_api>` section. The first argument, ``album``, is an object that holds information about the selected album. See the ``Album`` class in the `picard/album.py <https://github.com/metabrainz/picard/blob/master/picard/album.py#L112>`_ file in Picard's source code for more information.
fr: Maintenant, nous incluons les fonctions qui seront appelées lorsque les releases et les tracks seront récupérés par Picard. Le hook de la fonction release fournit trois arguments, et le hook de la fonction track fournit quatre arguments. Les types d'arguments sont décrits dans la section :doc:`Plugins API <../appendices/plugins_api>`. Le premier argument, ``album``, est un objet qui contient des informations sur l'album sélectionné. Voir la classe ``Album`` dans le fichier `picard/album.py <https://github.com/metabrainz/picard/blob/master/picard/album.py#L112>`_ du code source de Picard pour plus d'informations.

source: The second argument, ``metadata``, is an object that holds the tags and variables that Picard has assigned for the current release and track. This is where you can add or edit the tags and variables that Picard makes available to the user for scripts. See the ``Metadata`` class in the `picard/metadata.py <https://github.com/metabrainz/picard/blob/master/picard/metadata.py#L146>`_ file in Picard's source code for more information.
fr: Le second argument, ``metadata``, est un objet qui contient les tags et les variables que Picard a assignés pour la version et la piste en cours. C'est ici que vous pouvez ajouter ou modifier les tags et les variables que Picard met à disposition de l'utilisateur pour les scripts. Voir la classe ``Metadata`` dans le fichier `picard/metadata.py <https://github.com/metabrainz/picard/blob/master/picard/metadata.py#L146>`_ du code source de Picard pour plus d'informations.

source: The ``track`` and ``release`` arguments are Python dictionaries containing the information provided in response to Picard's calls to the MusicBrainz API. The information may differ, depending on the user's :doc:`../config/options_metadata` settings for things like "*Use release relationships*" or "*Use track relationships*".
fr: Les arguments ``track`` et ``release`' sont des dictionnaires Python contenant les informations fournies en réponse aux appels de Picard à l'API MusicBrainz. Les informations peuvent différer selon les paramètres :doc:`../config/options_metadata` de l'utilisateur pour des choses comme "*Utiliser les relations de validation*" ou "*Utiliser les relations de suivi*".

source: Finally, we need to register our functions so that they are processed with the appropriate events. In our case, we set the priority to ``HIGH`` so that we output the parameter information as it is received by Picard before any other plugins have an opportunity to modify it.
fr: Enfin, nous devons enregistrer nos fonctions afin qu'elles soient traitées avec les événements appropriés. Dans notre cas, nous mettons la priorité à "HIGH" pour que nous puissions sortir les informations des paramètres dès qu'elles sont reçues par Picard avant que d'autres plugins aient l'opportunité de les modifier.
pt_br: Finalmente, precisamos registrar nossas funções para que sejam processadas pelos eventos apropriados. No nosso caso, podemos setar a prioridade do plugin para ALTO (``HIGH``), de maneira que gravemos as informações recebidas pelo Picard antes que outros plugins tenham a oportunidade de alterá-los.

source: The complete plugin code file looks something like:
fr: Le fichier de code complet du plugin ressemble à quelque chose comme:
pt_br: O código completo para o plugin deve se parecer com:

source: That's it for our plugin code. Now we need to package it so that we can install it into Picard. If we're going to just use it locally for ourself, the easiest way is to just name the file something like :file:`my_plugin.py`. If there are multiple files, such as plugins that include additional settings screens, then the files should be saved in a directory such as :file:`my_plugin` with the main file named :file:`__init__.py`. The directory is then archived into a :file:`my_plugin.zip` file, with the file name the same as the included directory name. The the contents of the archive would show as something like::
fr: C'est tout pour le code de notre plugin. Maintenant nous devons l'empaqueter afin de pouvoir l'installer dans Picard. Si nous voulons juste l'utiliser localement pour nous-mêmes, le plus simple est de nommer le fichier comme :file:`my_plugin.py`. S'il y a plusieurs fichiers, comme des plugins qui incluent des écrans de réglages supplémentaires, alors les fichiers doivent être enregistrés dans un répertoire tel que :file:`my_plugin` avec le fichier principal nommé :file:`__init__.py`. Le répertoire est ensuite archivé dans un fichier :file:`my_plugin.zip`, dont le nom de fichier est identique au nom du répertoire inclus. Le contenu de l'archive s'affiche comme suit::

source: If you've made it this far, congratulations! You've just created your first Picard plugin. Now you have a starting point for turning that great idea into reality.
fr: Si vous êtes arrivé jusqu'ici, félicitations ! Vous venez de créer votre premier plugin Picard. Vous avez maintenant un point de départ pour transformer cette grande idée en réalité.
pt_br: Se você chegou até aqui, parabéns! Você acabou de criar seu primeiro plugin para o Picard. Agora você tem um ponto de partida para transformar sua idéia em realidade.

source: Relevant portions of Picard's source code including:
fr: Des portions pertinentes du code source de Picard, y compris:
pt_br: Porções relevantes do código fonte do Picard incluindo:

source: Option settings modules in `picard/ui/options/ <https://github.com/metabrainz/picard/tree/master/picard/ui/options>`_ for names used to access the settings.
fr: Modules de paramétrage des options dans `picard/ui/options/ <https://github.com/metabrainz/picard/tree/master/picard/ui/options>`_ pour les noms utilisés pour accéder aux paramètres.
pt_br: Para nomes usados para acessar configurações, módulos de Opções das configurações em `picard/ui/options/ <https://github.com/metabrainz/picard/tree/master/picard/ui/options>`_.

source: ``Album`` class in the `picard/album.py <https://github.com/metabrainz/picard/blob/master/picard/album.py#L112>`_ file.
fr: La classe ``Album`` dans le fichier `picard/album.py <https://github.com/metabrainz/picard/blob/master/picard/album.py#L112>`_.

source: ``Metadata`` class and metadata processing plugin registration functions in the `picard/metadata.py <https://github.com/metabrainz/picard/blob/master/picard/metadata.py#L146>`_ file.
fr: La classe ``Metadata`` et les fonctions d'enregistrement du plugin de traitement des métadonnées dans le fichier `picard/metadata.py <https://github.com/metabrainz/picard/blob/master/picard/metadata.py#L146>`_.

source: ``PluginPriority`` class in the `picard/plugin.py <https://github.com/metabrainz/picard/blob/master/picard/plugin.py#L217>`_ file.
fr: La classe ``PluginPriority`` dans le fichier `picard/plugin.py <https://github.com/metabrainz/picard/blob/master/picard/plugin.py#L217>`_.

source: For the purpose of this tutorial, we're going to develop a simple plugin to save the argument information provided by Picard to ``track`` and ``release`` processing plugins. This will demonstrate how the information is accessed, and will provide a utility that you might find useful when developing your own plugins.
pt_br: Neste tutorial mostraremos o desenvolvimento de um plugin simples que salva os argumentos providos pelo Picard para plugins processando trilhas (``tracks``) e lançamentos (``releases``). Dessa forma mostraremos como se acessar as informações que deseja processar e utilidades que você pode achar útil durante o desenvolvimento de seus próprios plugins.

source: Now we can start adding the code that we want Picard to execute. First we'll identify the output file to store the parameter information provided by Picard. This is a file named ``data_dump.txt`` to be stored in the file naming output directory. We find the name of the configuration setting we need, ``move_files_to``, by examining the Picard source code for the corresponding option setting screen. In this case it is a TextOption in the ``RenamingOptionsPage`` class found in the file `picard/ui/options/renaming.py <https://github.com/metabrainz/picard/blob/master/picard/ui/options/renaming.py>`_.
pt_br: Agora podemos adicionar o código que queremos que o Picard execute. Primeiro identificaremos o arquivo de saída que guardará os parâmetros fornecidos pelo Picard. O arquivo será chamado ``data_dump.txt`` e será guardado no diretório de destino do script de renomeação. O diretório pode ser encontrado com o valor da configuração ``move_files_to``, que pode ser encontrado iexaminando o código fonte da tela de configurações correspondente do Picard. Neste caso a existe uma opção de texto (TextOption) na classe ``RenamingOptionsPage`` do arquivo `picard/ui/options/renaming.py <https://github.com/metabrainz/picard/blob/master/picard/ui/options/renaming.py>`_.

source: The second argument, ``metadata``, is an object that holds the tags and variables that Picard has assigned for the current release and track. This is where you can add or edit the tags and variables that Picard makes available to the user for scripts. See the ``Metadata`` class in the `picard/metadata.py <https://github.com/metabrainz/picard/blob/master/picard/metadata.py>`_ file in Picard's source code for more information.
pt_br: O segundo argumento, ``metadata``, é um objeto que contém as etiquetas e variáveis que o Picard recuperou para o lançamento e trilha. É neste objeto em que você pode adicionar ou remover etiquetas e outras variáveis que o Picard disponibiliza para scripts de usuários. Para mais informações, veja a classe ``Metadata`` no arquivo `picard/metadata.py <https://github.com/metabrainz/picard/blob/master/picard/metadata.py>`_ do código fonte do Picard.

source: ``Album`` class in the `picard/album.py <https://github.com/metabrainz/picard/blob/master/picard/album.py>`_ file.
pt_br: Classe ``Album`` no arquivo `picard/album.py <https://github.com/metabrainz/picard/blob/master/picard/album.py>`_.

source: ``Metadata`` class and metadata processing plugin registration functions in the `picard/metadata.py <https://github.com/metabrainz/picard/blob/master/picard/metadata.py>`_ file.
pt_br: Classe ``Metadata`` e funções de registro para processamento de plugins no arquivo `picard/metadata.py <https://github.com/metabrainz/picard/blob/master/picard/metadata.py>`_.

source: ``PluginPriority`` class in the `picard/plugin.py <https://github.com/metabrainz/picard/blob/master/picard/plugin.py>`_ file.
pt_br: Classe ``PluginPriority`` no arquivo `picard/plugin.py <https://github.com/metabrainz/picard/blob/master/picard/plugin.py>`_.
