Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/configuration.po
Languages: ca, fr, pt_br

source: Configuration
ca: Configuració
pt_br: Configuração

source: Once Picard has been installed on your system, the next step is to configure it to your preferences. The configuration consists of enabling the desired screen sections for display, selecting the desired actions, and setting the various options.
ca: Quan hàgiu instal·lat Picard al vostre sistema, el pas següent és configurar-lo segons les vostres preferències. La configuració consisteix a habilitar les seccions de la pantalla que voleu veure, seleccionar les accions desitjades i definir diverses opcions.
pt_br: Logo que o Picard tenha sido instalado em seu sistema, o próximo passo será configurá-lo de acordo com suas preferências. A configuração consiste em habilitar as seções de tela desejadas para exibição, selecionar as ações desejadas e definir várias opções.

source: :index:`Screen Setup <configuration; screen setup>`
ca: :index:`Configuració de la pantalla <configuració; configuració de la pantalla>`
fr: :index:`Configuration de l'écran <configuration; configuration de l'écran>`
pt_br: :index:`Configuração da tela <configuração; configuração da tela>`

source: The screen setup is found under the :menuselection:`"View"` item on the menu bar. To enable the display of an item, simply check the box for the screen option. The items are:
ca: La configuració de la pantalla és a l'element :menuselection:`«Visualitza»` de la barra de menú. Per a mostrar un element, només cal que marqueu la casella de l'opció corresponent. Els elements són:
pt_br: A configuração da tela é encontrada em :menuselection:`"Vista"` em barra de menu. Para ativar a exibição de um item, basta marcar a caixa com a opção de tela. Os itens são:

source: **File Browser**
ca: **Explorador de fitxers**
fr: **Navigateur de fichiers**
pt_br: **Navegador de arquivos**

source: This displays a file browser on the left side of the screen for selecting files and directories for processing. Files can be loaded into Picard by dragging and dropping them to the right panes, double clicking on individual files or by selecting multiple files and folders and selecting "Load selected files" from the context menu.
ca: Això mostra un explorador de fitxers a l'esquerra de la pantalla per a seleccionar els fitxers i directoris que s'han de processar. Es poden carregar fitxers a Picard arrossegant-los i deixant-los anar a les subfinestres de la dreta, fent doble clic sobre fitxers individuals o seleccionant diversos fitxers i carpetes i «Carrega els fitxers seleccionats» al menú contextual.
fr: Ceci affiche un navigateur de fichiers sur le côté gauche de l'écran pour sélectionner les fichiers et répertoires à traiter. Les fichiers peuvent être chargés dans Picard en les faisant glisser et en les déposant dans les volets de droite, en double-cliquant sur des fichiers individuels ou en sélectionnant plusieurs fichiers et dossiers et en sélectionnant "Charger les fichiers sélectionnés" dans le menu contextuel.
pt_br: Isto exibe um navegador de arquivos no lado esquerdo da tela para selecionar arquivos e pastas para processamento. Os arquivos podem ser carregados no Picard arrastando e soltando-os em painéis da direita, via duplo clique em arquivos individuais ou selecionando vários arquivos e pastas e escolhendo "Carregar arquivos selecionados" no menu de contexto.

source: Files and directories can also be selected using your system's file browser by dragging and dropping them onto the Picard application.
ca: També podeu seleccionar fitxers i directoris a l'explorador de fitxers del sistema i arrossegar-los i deixar-los anar a Picard.
fr: Les fichiers et répertoires peuvent également être sélectionnés à l'aide du navigateur de fichiers de votre système en les faisant glisser et en les déposant sur l'application Picard.
pt_br: Os arquivos e pastas também podem ser selecionados usando o navegador de arquivos de seu sistema, arrastando e soltando-os diretamente no Picard.

source: **Cover Art**
ca: **Caràtules**
fr: **Couverture Art**
pt_br: **Arte da capa***

source: This displays the cover art for the currently selected item (track or release) in a window to the right of the tags section of the display. This allows you to select or replace the cover art saved with the release.
ca: Això mostra la caràtula de l'element seleccionat actualment (pista o publicació) en una finestra a la dreta de la secció d'etiquetes en pantalla. Això us permet seleccionar o substituir la caràtula desada amb la publicació.
pt_br: Isto exibe a arte da capa do item atualmente selecionado (faixa ou álbum) em uma janela à direita da seção de ids do display. Isto permite selecionar ou substituir a arte da capa salva com o álbum.

source: **Actions**
ca: **Accions**
pt_br: **Ações**

source: This displays the button bar of the actions performed by Picard, located just below the menu bar.
ca: Això mostra la barra de botons de les accions de Picard, just a sota de la barra de menú.
fr: Cela affiche la barre de boutons des actions effectuées par Picard, située juste en dessous de la barre de menu.
pt_br: Isto exibe a barra de botões das ações executadas por Picard, localizada logo abaixo da barra de menu.

source: **Search**
ca: **Cerca**
fr: **Chercher**
pt_br: **Procurar**

source: This displays the manual search box to the right of the "Actions" button bar.
ca: Això mostra el quadre de cerca manual a la dreta de la barra de botons «Accions».
fr: Cela affiche la zone de recherche manuelle à droite de la barre de boutons "Actions".
pt_br: Isto exibe a caixa de busca manual à direita da barra de botões "Ações".

source: **Player**
ca: **Reproductor**
fr: **Joueur**
pt_br: **Reprodutor**

source: This displays the built-in player for playing selected audio files.
ca: Això mostra el reproductor integrat per a reproduir els fitxers d'àudio seleccionats.
fr: Ceci affiche le lecteur intégré pour la lecture des fichiers audio sélectionnés.
pt_br: Isto exibe o reprodutor incorporado de reprodução de arquivos de áudio selecionados.

source: :index:`Action Options <configuration; action options>`
ca: :index:`Opcions d'acció <configuració; opcions d'acció>`
fr: :index:`Options d'action <configuration; options d'action>`
pt_br: :index:`Opções de ação <configuração; opções de ação>`

source: The action options are found under the :menuselection:`"Options"` item on the menu bar. There are three available actions that Picard can perform when saving selected music files:
ca: Les opcions d'acció són a l'element :menuselection:`«Opcions»` de la barra de menú. Hi ha tres accions disponibles que Picard pot fer en desar els fitxers de música seleccionats:
pt_br: As opções de ação são encontradas em :menuselection:`"Opções"` na barra de menu. Há três ações disponíveis que o Picard pode executar ao salvar arquivos de música selecionados:

source: **Rename Files**
ca: **Canvia el nom dels fitxers**
fr: **Renommer les fichiers**
pt_br: **Renomear arquivos***

source: Picard will rename each file in accordance with the naming script.
ca: Picard canviarà el nom de cada fitxer d'acord amb l'script de nom dels fitxers.
fr: Picard renommera chaque fichier conformément au script de nommage.
pt_br: O Picard renomeará cada arquivo de acordo com a esquema aplicada.

source: **Move Files**
ca: **Mou els fitxers**
fr: **Déplacer des fichiers**
pt_br: **Mover arquivos**

source: Picard will move files to the target directory in accordance with the naming script.
ca: Picard mourà els fitxers al directori de destinació d'acord amb l'script de nom dels fitxers.
fr: Picard déplacera les fichiers vers le répertoire cible conformément au script de nommage.
pt_br: O Picard moverá os arquivos para a pasta de destino de acordo com a esquema aplicada.

source: **Save Tags**
ca: **Desa les etiquetes**
fr: **Enregistrer les tags**
pt_br: **Salvar ids**

source: Picard will update the metadata tags in the files in accordance with the specified option settings and tagging scripts.
ca: Picard actualitzarà les etiquetes de metadades dels fitxers d'acord amb els paràmetres i scripts d'etiquetatge especificats.
fr: Picard mettra à jour les balises de métadonnées dans les fichiers conformément aux paramètres d'option et aux scripts de balisage spécifiés.
pt_br: O Picard atualizará as ids de metadados nos arquivos de acordo com as configurações de opções e a esquema de identificação aplicada.

source: :index:`Option Settings <see: option settings; configuration>`
ca: :index:`Paràmetres <see: paràmetres; configuració>`
fr: :index:`Paramètres des options <see: paramètres des options; configuration>`
pt_br: :index:`Configurações de opção <ver: configurações de opção; configuração>`

source: The option settings are found under the :menuselection:`"Options --> Options..."` item on the menu bar. On macOS they can be accessed with :menuselection:`"MusicBrainz Picard --> Preferences..."`. This will open a new window with the option groups listed in a tree format on the left hand side, and the individual settings on the right hand side. This is where the majority of Picard's customization is performed.
ca: Els paràmetres són a l'element :menuselection:`«Opcions --> Opcions...»` de la barra de menú. Al macOS s'hi pot accedir amb :menuselection:`«MusicBrainz Picard --> Preferències...»`. Això obrirà una finestra nova amb els grups d'opcions en format d'arbre a l'esquerra i els paràmetres individuals a la dreta. Aquí és on es pot personalitzar la major part del comportament de Picard.
fr: Les paramètres des options se trouvent sous l'élément :menuselection:`"Options --> Options..."` de la barre de menu. Sur macOS, on peut y accéder avec :menuselection:`"MusicBrainz Picard --> Préférences..."`. Ceci ouvrira une nouvelle fenêtre avec les groupes d'options listés sous forme d'arbre sur le côté gauche, et les réglages individuels sur le côté droit. C'est ici que la majorité des réglages de Picard sont effectués.

source: When running your code from the source in a macOS environment, you can access the option settings by navigating to the :menuselection:`"Python --> Preferences..."` option in the menu bar. This allows you to configure and customize various settings for your development environment.
ca: En executar el programa des del codi font en un entorn macOS podeu accedir als paràmetres navegant a l'opció :menuselection:`«Python --> Preferències...»` de la barra de menú. Això us permet configurar i personalitzar diversos paràmetres de l'entorn de desenvolupament.
fr: Lorsque vous exécutez votre code à partir des sources dans un environnement macOS, vous pouvez accéder aux paramètres des options en naviguant vers l'option :menuselection:`"Python --> Préférences..."` dans la barre de menu. Cela vous permet de configurer et de personnaliser divers paramètres pour votre environnement de développement.

source: In addition to the basic "user settings", this is also where option setting changes are made to individual option profiles. This is covered in greater detail in the :doc:`/usage/option_profiles` section.
ca: A més dels «paràmetres d'usuari» bàsics, aquí també és on es poden modificar els paràmetres de perfils d'opcions individuals. Això es tracta amb més detall a la secció :doc:`/usage/option_profiles`.

source: Changes made to a profile's options settings, enabled status, or position in the profile stack will be reflected in the option settings displayed on the other pages. Options that are controlled by an enabled profile will be shown as highlighted. Hovering your cursor over the highlighted option will identify which profile currently controls the setting. Settings are always displayed based on the first enabled profile in the profile stack, which corresponds to the setting that will be used during processing.
ca: Els canvis aplicats als paràmetres d'un perfil d'opcions, l'estat d'habilitació o la posició a la llista de perfils es reflectiran als paràmetres que es mostren a la resta de pàgines. Les opcions controlades per un perfil habilitat es mostraran ressaltades. Si passeu el cursor sobre l'opció ressaltada, podreu identificar quin perfil controla el paràmetre actualment. Els paràmetres sempre es mostren en funció del primer perfil habilitat a la llista, que correspon al paràmetre que es farà servir durant el processament.
pt_br: As mudanças feitas nas configurações de opções de perfil, status habilitado ou posição na pilha de perfis serão refletidas em configurações de opções exibidas nas outras páginas. As opções que são controladas por um perfil habilitado serão mostradas como destacadas. Passando o cursor sobre a opção destacada, identificará qual perfil atualmente controla a configuração. As configurações são sempre exibidas com base no primeiro perfil habilitado na pilha de perfis, que corresponde à configuração que será usada durante o processamento.

source: Once Picard has been installed on your system, the next step is to configure it to your preferences. The configuration consists of enabling the desired screen sections for display, selecting the desired actions, and setting the various options.
fr: Une fois Picard installé sur votre système, l'étape suivante consiste à le configurer selon vos préférences. La configuration consiste à activer les sections d'écran souhaitées pour l'affichage, à sélectionner les actions souhaitées et à définir les différentes options.

source: The screen setup is found under the :menuselection:`"View"` item on the menu bar. To enable the display of an item, simply check the box for the screen option. The items are:
fr: La configuration de l'écran se trouve sous l'élément :menuselection:`"View"` de la barre de menu. Pour activer l'affichage d'un élément, cochez simplement la case de l'option écran. Les éléments sont :

source: This displays the cover art for the currently selected item (track or release) in a window to the right of the tags section of the display. This allows you to select or replace the cover art saved with the release.
fr: Cela affiche la pochette de l'élément actuellement sélectionné (piste ou version) dans une fenêtre à droite de la section des balises de l'affichage. Cela vous permet de sélectionner ou de remplacer la pochette enregistrée avec la version.

source: The action options are found under the :menuselection:`"Options"` item on the menu bar. There are three available actions that Picard can perform when saving selected music files:
fr: Les options d'action se trouvent sous l'élément :menuselection:`"Options"` de la barre de menu. Il y a trois actions disponibles que Picard peut effectuer lors de l'enregistrement des fichiers musicaux sélectionnés :
