Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_metadata.po
Languages: fr

source: :index:`Metadata Options <configuration; metadata options>`
fr: :index:`Options de métadonnées <configuration; options de métadonnées>`

source: **Translate artist names to this locale where possible**
fr: **Traduisez les noms d'artistes dans cette langue lorsque cela est possible**

source: When checked, Picard will see whether an artist has an alias for the selected locale. If it does, Picard will use that alias instead of the artist name when tagging. When "English" is the selected locale, the artist sort name (which is, by Style Guideline, stored in Latin script) is used as a fallback if there is no English alias.
fr: Lorsqu'elle est cochée, Picard verra si un artiste a un alias pour la langue sélectionnée. Si c'est le cas, Picard utilisera cet alias au lieu du nom de l'artiste lors du marquage. Lorsque "English" est la langue sélectionnée, le nom de tri de l'artiste (qui est, par Style Guideline, stocké en script latin) est utilisé comme solution de secours s'il n'y a pas d'alias anglais.

source: **Use standardized artist names**
fr: **Utilisez des noms d'artistes standardisés**

source: Check to only use standard Artist names, rather than Artist Credits which may differ slightly across tracks and releases.
fr: Cochez pour n'utiliser que des noms d'artistes standard, plutôt que des crédits d'artiste qui peuvent différer légèrement selon les pistes et les versions.

source: If the "Translate artist names" option above is also checked, it will override this option if a suitable alias is found.
fr: Si l'option "Traduire les noms d'artistes" ci-dessus est également cochée, elle remplacera cette option si un alias approprié est trouvé.

source: **Use standardized instrument and vocal credits**
fr: **Utilisez des crédits d'instruments et vocaux standardisés**

source: Check to only use standard names for instruments and vocals in performer relationships. Uncheck to use the instruments and vocals as credited in the relationship.
fr: Cochez pour n'utiliser que des noms standard pour les instruments et les voix dans les relations interprètes. Décochez pour utiliser les instruments et les voix comme crédités dans la relation.

source: **Convert Unicode punctuation characters to ASCII**
fr: **Convertir les caractères de ponctuation Unicode en ASCII**

source: Converts Unicode punctuation characters in MusicBrainz data to ASCII for consistent use of punctuation in tags. For example, right single quotation marks are converted to ASCII apostrophes ('), and horizontal ellipses are converted to three full stops (...).
fr: Convertit les caractères de ponctuation Unicode des données MusicBrainz en ASCII pour une utilisation cohérente de la ponctuation dans les balises. Par exemple, les guillemets simples droits sont convertis en apostrophes ASCII (') et les ellipses horizontales sont converties en trois points (...).

source: **Use release relationships**
fr: **Utiliser les relations de version**

source: Check to retrieve and write release-level relationships (e.g.: URLs, composer, lyricist, performer, conductor, or DJ mixer) to your files. You must have this enabled to use Picard to retrieve cover art.
fr: Cochez pour récupérer et écrire les relations au niveau de la version (par exemple: URL, compositeur, parolier, interprète, chef d'orchestre ou mixeur DJ) dans vos fichiers. Vous devez l'activer pour utiliser Picard pour récupérer l'art de couverture.

source: **Use track relationships**
fr: **Utiliser les relations de suivi**

source: Check to write track-level relationships (e.g.: composer, lyricist, performer, or remixer) to your files.
fr: Cochez pour écrire des relations au niveau de la piste (par exemple: compositeur, parolier, interprète ou remixeur) dans vos fichiers.

source: **Original release date**
fr: **Date de sortie d'origine**

source: This option allows the user to select the information source used for the ``originaldate`` and ``originalyear`` tags, from either:
fr: Cette option permet à l'utilisateur de sélectionner la source d'informations utilisée pour les balises ``originaldate`` et ``originalyear``, soit:

source: the first release date of the recording (varies by track)
fr: la première date de sortie de l'enregistrement (varie selon la piste)

source: the first release date of the release group (varies by album)
fr: la première date de sortie du groupe de sortie (varie selon l'album)

source: The default is to use the first release by release group, which is consistent with the values provided in these tags prior to Picard version 2.6, when this option was first implemented.
fr: La valeur par défaut est d'utiliser la première version par groupe de versions, ce qui est cohérent avec les valeurs fournies dans ces balises avant la version 2.6 de Picard, lorsque cette option a été implémentée pour la première fois.

source: If the option to use the recording release date is selected and the ``originaldate`` or ``originalyear`` tags are used in the path portion of your file naming script, this may (and likely will) cause your album to be scattered across multiple directories. To help prevent this from happening, the ``_releaseoriginaldate`` variable has been added, which will provide a consistent value across all tracks on a release, regardless of this option setting. To get just the year portion of this variable, simply use ``$left(%_releaseoriginaldate%,4)``. Similarly the ``_recordingoriginaldate`` variable will always provide the date based on the recording, regardless of this option setting.
fr: Si l'option permettant d'utiliser la date de sortie de l'enregistrement est sélectionnée et que les balises ``originaldate`` ou ``originalyear`` sont utilisées dans la partie chemin de votre script de dénomination de fichier, cela peut (et probablement) entraînera la dispersion de votre album. sur plusieurs répertoires. Pour éviter que cela ne se produise, la variable ``_releaseoriginaldate`` a été ajoutée, ce qui fournira une valeur cohérente sur toutes les pistes d'une version, quel que soit le réglage de cette option. Pour obtenir uniquement la partie année de cette variable, utilisez simplement ``$left(%_releaseoriginaldate%, 4)``. De même, la variable ``_recordingoriginaldate`` fournira toujours la date en fonction de l'enregistrement, quel que soit le réglage de cette option.

source: **Various artists**
fr: **Artistes variés**

source: Choose how you want the "Various Artists" artist spelled.
fr: Choisissez comment vous voulez que l'artiste "Various Artists" soit orthographié.

source: **Non-album tracks**
fr: **Pistes hors album**

source: Choose how you want "non-album tracks" to be grouped.
fr: Choisissez la manière dont vous souhaitez regrouper les "pistes hors album".

source: Details: :doc:`options_releases` / :doc:`options_genres` / :doc:`options_ratings`
fr: Détails: :doc:`options_releases` / :doc:`options_genres` / :doc:`options_ratings`
