Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_genres.po
Languages: fr, pt_br

source: **Use genres from MusicBrainz**
fr: **Utilisez les genres de MusicBrainz**
pt_br: **Utilize gêneros do MusicBrainz***

source: Use genres provided by MusicBrainz and save them to the genre tag.
fr: Utilisez les genres fournis par MusicBrainz et enregistrez-les dans la balise de genre.
pt_br: Use os gêneros fornecidos pelo MusicBrainz e salve-os na id do gênero.

source: **Fall back on album's artists genres if no genres are found for the release or release group**
fr: **Revenez aux genres d'artistes de l'album si aucun genre n'est trouvé pour la sortie ou le groupe de sortie**

source: If there is no genre set for the release or release group on MusicBrainz, use the genre of the album artist instead.
fr: S'il n'y a pas de genre défini pour la sortie ou le groupe de sortie sur MusicBrainz, utilisez plutôt le genre de l'artiste de l'album.
pt_br: Se não houver um gênero definido para o lançamento ou grupo de lançamento no MusicBrainz, use o gênero de artista de álbum em seu lugar.

source: **Only use my genres**
fr: **N'utiliser que mes genres**
pt_br: **Utilizar somente meus gêneros**

source: When enabled, Picard will only write genres you personally have submitted to MusicBrainz. You'll need to set your username and password to use this feature.
fr: Lorsqu'il est activé, Picard n'écrira que les genres que vous avez personnellement soumis à MusicBrainz. Vous devrez définir votre nom d'utilisateur et votre mot de passe pour utiliser cette fonctionnalité.
pt_br: Quando habilitado, o Picard só salvará gêneros que você tenha submetido pessoalmente ao MusicBrainz. Você precisará definir seu nome de usuário e senha para usar este recurso.

source: **Use folksonomy tags as genres**
fr: **Utilisez des balises folksonomy comme genres**

source: Check to use all folksonomy tags to set the genre. Otherwise only the tags considered by MusicBrainz to be proper genres will be used.
fr: Cochez pour utiliser toutes les balises folksonomy pour définir le genre. Sinon, seules les balises considérées par MusicBrainz comme des genres appropriés seront utilisées.
pt_br: Marque para usar todas as ids de folksonomia para definir o gênero. Caso contrário, somente as ids consideradas pelo MusicBrainz como gêneros adequados serão usadas.

source: **Minimal genre usage**
fr: **Utilisation minimale du genre**
pt_br: **Utilização mínima do gênero**

source: Choose how popular the genre must be before it is written by Picard. Default: 90%. Lowering the value here will lead to more, but possibly less relevant, genres in your files.
fr: Choisissez la popularité du genre avant qu'il ne soit écrit par Picard. Par défaut: 90%. Réduire la valeur ici conduira à plus de genres, mais peut-être moins pertinents, dans vos fichiers.
pt_br: Escolha o quão popular o gênero deve ser antes de ser salvo pelo Picard. Padrão: 90%. A redução deste valor levará a mais e possivelmente menos relevantes, gêneros em seus arquivos.

source: **Maximum number of genres**
fr: **Nombre maximum de genres**
pt_br: **Número máximo de gêneros**

source: Choose how many genres to use. Default: 5. If you only want a single genre, set this to 1.
fr: Choisissez le nombre de genres à utiliser. Par défaut: 5. Si vous ne voulez qu'un seul genre, réglez-le sur 1.
pt_br: Escolha quantos gêneros usar. Padrão: 5. Se você quiser apenas um gênero, defina este para 1.

source: **Join multiple genres with**
fr: **Rejoignez plusieurs genres avec**
pt_br: **Agrupar vários gêneros com**

source: Select which character should be used to separate multiple genres.
fr: Sélectionnez le caractère à utiliser pour séparer plusieurs genres.
pt_br: Selecione qual caractere deve ser usado para separar vários gêneros.

source: **Genres or folksonomy tags to include or exclude**
fr: **Balises de genres ou de folksonomy à inclure ou à exclure**
pt_br: **Gêneros ou ids de folksonomia para incluir ou excluir**

source: One expression per line, case-insensitive. You can use the "Playground" text field to enter some genres and test the rules you have setup. Genres that will be excluded will be marked red, included genres will be marked green.
fr: Une expression par ligne, insensible à la casse. Vous pouvez utiliser le champ de texte "Cour de récréation" pour saisir certains genres et tester les règles que vous avez configurées. Les genres qui seront exclus seront marqués en rouge, les genres inclus seront marqués en vert.
pt_br: Uma expressão por linha, não sensível a maiúsculas e minúsculas. Você pode usar o campo de texto "Playground" para digitar alguns gêneros e testar as regras que você tem configurado. Os gêneros que serão excluídos serão marcados em vermelho, os gêneros incluídos serão marcados em verde.

source: **Comments**: Lines not starting with '-' or '+' are ignored. (e.g.: ``#comment``, ``!comment`` or ``comment``)
fr: **Commentaires**: Les lignes ne commençant pas par '-' ou '+' sont ignorées. (par exemple: ``# commentaire``, ``! comment`` ou ``comment``)
pt_br: **Comments**: As linhas que não começam com '-' ou '+' são ignoradas. (por exemplo: ``#comment``, ``!comment`` ou ``comment``)

source: **Strict filtering**: Exclude exact word by prefixing it with '-' (e.g.: ``-word``). Include exact word, even if another rule would exclude it, by prefixing it with '+' (e.g.: ``+word``).
fr: **Filtrage strict**: excluez le mot exact en le préfixant avec '-' (par exemple: ``-word``). Incluez le mot exact, même si une autre règle l'exclurait, en le préfixant avec '+' (par exemple: ``+mot``).

source: **Wildcard filtering**: Exclude all genres ending with "word" (e.g.: ``-*word``). Include all genres starting with "word" (e.g.: ``+word*``). Exclude all genres starting with 'w' and ending with "rd" (e.g.: ``-w*rd``).
fr: **Filtrage des caractères génériques**: exclut tous les genres se terminant par "mot" (par exemple: ``-*mot``). Incluez tous les genres commençant par "mot" (par exemple: ``+mot*``). Excluez tous les genres commençant par 'm' et se terminant par "t" (par exemple: ``-m*t``).

source: **Regular expressions filtering (Python "re" syntax)**: Exclude genres starting with 'w' followed by any character, then 'r' followed by at least one 'd' (e.g.: ``-/^w.rd+/``).
fr: **Filtrage des expressions régulières (syntaxe Python "re")**: exclut les genres commençant par 'w' suivi de n'importe quel caractère, puis 'r' suivi d'au moins un 'd' (par exemple: ``-/^w.rd+/``).
pt_br: **Filtragem via expressões regulares (sintaxe "re" Python)**: Excluir gêneros começando com 'w' seguido de qualquer caractere, depois 'r' seguido de pelo menos um 'd' (por exemplo: ``-/^w.rd+/``).

source: **Playground for genres or folksonomy tags filters:**
fr: **Aire de jeu pour les filtres de balises de genres ou de folksonomy:**
pt_br: **O playground para filtros de ids de gênero ou folksonomia:**

source: This area allows you to enter genre tags, one per line, to test your filters. If a tag is marked in red, it will be filtered out. A tag marked green will be allowed.
fr: Cette zone vous permet de saisir des balises de genre, une par ligne, pour tester vos filtres. Si une étiquette est marquée en rouge, elle sera filtrée. Un tag marqué en vert sera autorisé.

source: This list of test tags will be cleared when you exit the configuration section.
fr: Cette liste de balises de test sera effacée lorsque vous quitterez la section de configuration.
pt_br: Esta lista de ids de teste será eliminada quando você sair da seção de configuração.

source: :index:`Genres <configuration; genres>`
pt_br: :index:`Gêneros <configuração; gêneros>`

source: **Strict filtering**: Exclude exact word by prefixing it with '-' (e.g.: ``-word``). Include exact word, even if another rule would exclude it, by prefixing it with '+' (e.g.: ``+word``).
pt_br: **Filtragem restrita**: Excluir palavra exata prefixando-a com '-' (por exemplo: ``-palavra``). Incluir a palavra exata, mesmo que outra regra a exclua, prefixando-a com '+' (por exemplo: ``+palavra``).

source: **Wildcard filtering**: Exclude all genres ending with "word" (e.g.: ``-*word``). Include all genres starting with "word" (e.g.: ``+word*``). Exclude all genres starting with 'w' and ending with "rd" (e.g.: ``-w*rd``).
pt_br: **Filtragem com caracteres universais**: Excluir todos os gêneros terminados com "palavra" (por exemplo: ``-*palavra``). Incluir todos os gêneros que começam com "palavra" (por exemplo: ``+palavra*``). Excluir todos os gêneros que começam com 'w' e terminam com "rd" (por exemplo: ``-w*rd``).

source: This area allows you to enter genre tags, one per line, to test your filters. If a tag is marked in red, it will be filtered out. A tag marked green will be allowed.
pt_br: Esta área permite que você insira ids de gênero, uma por linha, para testar seus filtros. Se uma id for marcada em vermelho, ela será descartada. Uma id marcada em verde será permitida.
