Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_matching.po
Languages: fr

source: :index:`Matching <configuration; matching preferences>`
fr: :index:`Correspondance <configuration; préférences correspondantes>`

source: It is recommended for most users to leave these settings at their default values. For advanced users, these allow you to tune the way Picard matches your files and clusters to MusicBrainz releases and tracks.
fr: Il est recommandé à la plupart des utilisateurs de laisser ces paramètres à leurs valeurs par défaut. Pour les utilisateurs avancés, ceux-ci vous permettent d'ajuster la façon dont Picard fait correspondre vos fichiers et vos clusters aux versions et pistes de MusicBrainz.

source: **Minimal similarity for file lookups**
fr: **Similitude minimale pour les recherches de fichiers**

source: The higher the percentage value, the more similar an individual file's metadata must be to the metadata from MusicBrainz for it to be matched to a release on the right-hand side.
fr: Plus la valeur en pourcentage est élevée, plus les métadonnées d'un fichier individuel doivent être similaires aux métadonnées de MusicBrainz pour qu'elles correspondent à une version sur le côté droit.

source: This setting is used when you do a lookup on individual files. The files' metadata is compared to the recordings found on MusicBrainz. If the similarity is below the threshold the recording is ignored completely.
fr: Ce paramètre est utilisé lorsque vous effectuez une recherche sur des fichiers individuels. Les métadonnées des fichiers sont comparées aux enregistrements trouvés sur MusicBrainz. Si la similarité est inférieure au seuil fixé, l'enregistrement est complètement ignoré.

source: **Minimal similarity for cluster lookups**
fr: **Similitude minimale pour les recherches de cluster**

source: The higher the percentage value, the more similar a cluster of files from the left-hand pane must be to a MusicBrainz release for the entire cluster to be matched to a release on the right-hand side.
fr: Plus la valeur de pourcentage est élevée, plus un cluster de fichiers du volet de gauche doit être similaire à une version de MusicBrainz pour que l'ensemble du cluster soit mis en correspondance avec une version sur le côté droit.

source: **Minimal similarity for matching files to tracks**
fr: **Similitude minimale pour faire correspondre les fichiers aux pistes**

source: This setting is used when a file is assigned to a release and Picard needs to decide which track to assign it to. This happens on cluster lookup after the release has been chosen, or if you manually drag files onto a loaded release (as opposed to dragging it onto a track directly). If none of the tracks gives a match above the threshold the file is moved into an "unmatched files" section on that release.
fr: Ce paramètre est utilisé lorsqu'un fichier est affecté à une release et que Picard doit décider à quelle piste l'affecter. Cela se produit lors de la consultation des clusters après que la version ait été choisie, ou si vous faites glisser manuellement les fichiers sur une version chargée (par opposition à un glisser sur une piste directement). Si aucune des pistes n'offre une correspondance supérieure au seuil fixé, le fichier est déplacé dans une section "fichiers non appariés" sur cette version.

source: If you have absolutely no metadata in your current files, and you are using "Scan" to match tracks, you may find that you need to lower the value of "Minimal similarity for matching files to tracks" in order for Picard to match the files within a release. Otherwise you may find that Picard matches the track to a release but then is not sure which track is correct; and leaves it in an "unmatched files" group within that release.
fr: Si vous n'avez absolument aucune métadonnée dans vos fichiers actuels et que vous utilisez "Scan" pour faire correspondre les pistes, vous constaterez peut-être que vous devez réduire la valeur de "Similitude minimale pour faire correspondre les fichiers aux pistes" afin que Picard corresponde aux fichiers dans une version. Sinon, vous constaterez peut-être que Picard associe la piste à une version mais ne sait pas quelle piste est correcte; et le laisse dans un groupe "fichiers sans correspondance" dans cette version.

source: As a general rule, lowering the percentages may increase the chance of finding a match at the risk of false positives and incorrect matches.
fr: En règle générale, abaisser les pourcentages peut augmenter les chances de trouver une correspondance au risque de faux positifs et de correspondances incorrectes.
