Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_filerenaming.po
Languages: ca, fr

source: :index:`File Naming Options <pair: configuration; file naming>`
ca: :index:`Opcions de nom dels fitxers <pair: configuració; nom dels fitxers>`
fr: :index:`Options de nom de fichier <pair: configuration; dénomination des fichiers>`

source: These options determine how Picard handles files when they are saved with updated metadata.
ca: Aquestes opcions determinen com Picard gestiona els fitxers quan es desen amb metadades actualitzades.
fr: Ces options déterminent la manière dont Picard gère les fichiers lorsqu'ils sont enregistrés avec des métadonnées mises à jour.

source: **Move files when saving**
ca: **Mou els fitxers en desar-los**
fr: **Déplacer les fichiers lors de l'enregistrement**

source: If selected, this option tells Picard to move your audio files to a new directory when it saves them. One use for this is to keep your work organized: all untagged files are under "Directory A", and when Picard tags them it moves them to "Directory B". When "Directory A" is empty, your tagging work is done.
ca: Si se selecciona, aquesta opció indica a Picard que s'han de moure els fitxers d'àudio a un directori nou en desar-los. Pot servir per a mantenir la feina organitzada: tots els fitxers sense etiquetar són a «Directori A» i, després d'etiquetar-los amb Picard, es mouen a «Directori B». Quan «Directori A» està buit, heu enllestit l'etiquetatge.
fr: Si elle est sélectionnée, cette option indique à Picard de déplacer vos fichiers audio vers un nouveau répertoire lorsqu'il les enregistre. Une utilisation pour cela est de garder votre travail organisé : tous les fichiers non étiquetés sont sous "Répertoire A", et lorsque Picard les marque, il les déplace vers "Répertoire B". Lorsque "Répertoire A" est vide, votre travail de marquage est terminé.

source: If this option is left unchecked, then Picard will leave the files in the same directory when they are saved.
ca: Si aquesta opció es deixa sense marcar, Picard deixarà els fitxers al mateix directori on s'han desat.
fr: Si cette option n'est pas cochée, Picard laissera les fichiers dans le même répertoire lorsqu'ils seront enregistrés.

source: The "Rename Files" and "Move Files" options are independent of one another. "Rename Files" refers to Picard changing file names, typically based on artist and track names. "Move Files" refers to Picard moving files to new directories, based on a specified parent directory and subdirectories, typically based on album artist name and release title. However, they both use the same "file naming string". "Move files" uses the portion up until the last '/'. "Rename files" uses the portion after the last '/'.
ca: Les opcions «Canvia el nom dels fitxers» i «Mou els fitxers» són independents. «Canvia el nom dels fitxers» fa referència al fet que Picard canviï el nom dels fitxers, normalment segons els noms de l'artista i la pista. «Mou els fitxers» fa referència al fet que Picard mogui els fitxers a directoris nous a partir d'un directori principal i subdirectoris, normalment segons el nom de l'artista de l'àlbum i el títol de la publicació. Ara bé, totes dues opcions fan servir la mateixa «cadena de nom dels fitxers». «Mou els fitxers» fa servir la part fins a la darrera «/». «Canvia el nom dels fitxers» fa servir la part després de la darrera «/».
fr: Notez que les options "Renommer les fichiers" et "Déplacer les fichiers" sont indépendantes les unes des autres. «Renommer les fichiers» fait référence à Picard changeant les noms de fichiers, généralement en fonction des noms d'artiste et de piste. "Déplacer les fichiers" fait référence au déplacement de fichiers Picard vers de nouveaux répertoires, en fonction d'un répertoire parent et de sous-répertoires spécifiés, généralement basés sur le nom de l'artiste de l'album et le titre de la sortie. Cependant, ils utilisent tous les deux la même «chaîne de dénomination de fichier». "Déplacer les fichiers" utilise la partie vers le haut jusqu'au dernier '/'. "Renommer les fichiers" utilise la partie après le dernier '/'.

source: **Destination directory**
ca: **Directori de destinació**
fr: **Répertoire de destination**

source: This specifies the destination parent directory to which files are moved when they are saved, if the "Move files when saving" option is selected. If you use the directory "." the files will be moved relative to their current location. If they are already in some sort of directory structure, this will probably not do what you want!
fr: Cela spécifie le répertoire parent de destination vers lequel les fichiers sont déplacés lorsqu'ils sont enregistrés, si l'option "Déplacer les fichiers lors de l'enregistrement" est sélectionnée. Si vous utilisez le répertoire "." les fichiers seront déplacés par rapport à leur emplacement actuel. S'ils sont déjà dans une sorte de structure de répertoires, cela ne fera probablement pas ce que vous voulez !

source: **Move additional files**
ca: **Mou els fitxers addicionals**
fr: **Déplacer des fichiers supplémentaires**

source: **Pattern**
ca: **Patró**
fr: **Modèle**

source: **Meaning**
ca: **Significat**
fr: **Signification**

source: matches everything
ca: concideix amb tot
fr: correspond à tout

source: matches any single character
ca: coincideix amb qualsevol caràcter (només un)
fr: correspond à tout caractère unique

source: matches any character in *seq*
ca: coincideix amb qualsevol caràcter de *seq*
fr: correspond à n'importe quel caractère de *seq*

source: matches any character not in *seq*
ca: coincideix amb qualsevol caràcter que no és a *seq*
fr: correspond à tout caractère ne figurant pas dans *seq*

source: For a literal match, wrap the meta-characters in brackets. For example, '\[?\]' matches the character '?'.
ca: Per a una coincidència literal, escriviu els metacaràcters entre claudàtors. Per exemple, «\[?\]» coincideix amb el caràcter «?».
fr: Pour une correspondance littérale, mettez les métacaractères entre parenthèses. Par exemple, "\[?\]" correspond au caractère "?".

source: When these additional files are moved they will end up in the release directory with your music files. In a pattern, the '\*' character matches zero or more characters. Other text, like ".jpg", matches those exact characters. Thus "\*.jpg" matches "cover.jpg", "liner.jpg", "a.jpg", and ".jpg", but not "nomatch.jpg2".
ca: Quan es mouen aquests fitxers addicionals, van a parar al directori de la publicació amb els fitxers de música. En un patró, el caràcter «\*» coincideix amb zero o més caràcters. Un altre text, com «.jpg», coincideix amb aquests caràcters exactes. Per tant, «\*.jpg» coincideix amb «cover.jpg», «liner.jpg», «a.jpg» i «.jpg», però no amb «sensecoincidència.jpg2».
fr: Lorsque ces fichiers supplémentaires sont déplacés, ils se retrouvent dans le répertoire de sortie avec vos fichiers musicaux. Dans un modèle, le caractère "\*" correspond à zéro ou plusieurs caractères. Un autre texte, comme ".jpg", correspond à ces caractères exacts. Ainsi, "\*.jpg" correspond à "cover.jpg", "liner.jpg", "a.jpg" et ".jpg", mais pas à "nomatch.jpg2".

source: This option can also be used to move subdirectories to the new release directory. This is done by specifying the name of the subdirectory in the list of files to be moved. For example, if your album folders have a subfolder called "Artwork", "covers" or "scans" that contains additional image files that you also want to move to the new release directory, simply add "artwork", "covers" and "scans" to the list of additional file matching patterns.
fr: Cette option peut également être utilisée pour déplacer des sous-répertoires vers le nouveau répertoire de la version. Cela se fait en spécifiant le nom du sous-répertoire dans la liste des fichiers à déplacer. Par exemple, si vos dossiers d'albums ont un sous-dossier appelé "Artwork", "covers" ou "scans" qui contient des fichiers images supplémentaires que vous souhaitez également déplacer vers le nouveau répertoire de sortie, il suffit d'ajouter "artwork", "covers" et "scans" à la liste des modèles de correspondance des fichiers supplémentaires.

source: **Delete empty directories**
ca: **Suprimeix els directoris buits**
fr: **Supprimer les répertoires vides**

source: When selected, Picard will remove directories that have become empty once a move is completed. Leave this unchecked if you want Picard to leave the source directory structure unchanged. Checking this box may be convenient if you are using the "move files" option to organize your work. An empty directory has no more work for you to do, and deleting the directory makes that clear.
ca: Si ho seleccioneu, Picard suprimirà els directoris que hagin quedat buits després de moure fitxers. Deixeu-ho sense marcar si voleu que Picard deixi l'estructura de directoris original sense canvis. Marcar la casella pot ser pràctic si feu servir l'opció «Mou els fitxers» per a organitzar la feina. Un directori buit no conté cap feina pendent i suprimir el directori ho deixa clar.
fr: Lorsqu'il est sélectionné, Picard supprimera les répertoires devenus vides une fois le déplacement terminé. Laissez cette case non cochée si vous voulez que Picard laisse la structure du répertoire source inchangée. Cochez cette case peut être pratique si vous utilisez l'option "déplacer les fichiers" pour organiser votre travail. Un répertoire vide n'a plus de travail à faire, et la suppression du répertoire le clarifie.

source: **Rename files when saving**
ca: **Canvia el nom dels fitxers en desar-los**
fr: **Renommer les fichiers lors de l'enregistrement**

source: Select this option to let Picard change the file and directory names of your files when it saves them, in order to make the file and directory names consistent with the new metadata.
ca: Seleccioneu aquesta opció perquè Picard canviï els noms dels fitxers i directoris en desar els fitxers, de manera que els noms dels fitxers i directoris siguin coherents amb les metadades noves.
fr: Sélectionnez cette option pour permettre à Picard de modifier les noms de fichier et de répertoire de vos fichiers lorsqu'il les enregistre, afin de rendre les noms de fichier et de répertoire cohérents avec les nouvelles métadonnées.

source: **Replace non-ASCII characters**
fr: **Remplacer les caractères non ASCII**

source: Select this option to replace non-ASCII characters with their ASCII equivalent (e.g.: 'á', 'ä' and 'ǎ' with 'a'; 'é', 'ě' and 'ë' with 'e'; 'æ' with "ae"). More information regarding ASCII characters can be found on `Wikipedia <https://en.wikipedia.org/wiki/ASCII>`_.
fr: Sélectionnez cette option pour remplacer les caractères non ASCII par leur équivalent ASCII (par exemple : 'á', 'ä' et 'ǎ' par 'a' ; 'é', 'ě' et 'ë' par 'e' ; 'æ' avec "ae"). Plus d'informations sur les caractères ASCII peuvent être trouvées sur `Wikipedia <https://en.wikipedia.org/wiki/ASCII>`_.

source: **Windows compatibility**
fr: **Compatibilité Windows**

source: This option tells Picard to replace all Windows-incompatible characters with an underscore. This is enabled by default on Windows systems, with no option to disable.
fr: Cette option indique à Picard de remplacer tous les caractères incompatibles avec Windows par un trait de soulignement. Ceci est activé par défaut sur les systèmes Windows, sans option de désactivation.

source: **Selected file naming script**
ca: **Script de nom dels fitxers seleccionat**
fr: **Système de dénomination des fichiers sélectionnés**

source: As of Picard version 2.7, multiple file naming scripts are supported. This option allows the user to select the file naming script to use from the list of scripts available. Scripts can be either system preset scripts or user-defined scripts. The available scripts are managed in the :doc:`File naming script editor <options_filerenaming_editor>` screen, which is displayed when the :guilabel:`Edit script...` button is selected.
fr: Depuis la version 2.7 de Picard, plusieurs scripts de nommage de fichiers sont supportés. Cette option permet à l'utilisateur de sélectionner le script de nom de fichier à utiliser à partir de la liste des scripts disponibles. Les scripts peuvent être des scripts prédéfinis par le système ou des scripts définis par l'utilisateur. Les scripts disponibles sont gérés dans l'écran :doc:`Éditer le script… <options_filerenaming_editor>`, qui s'affiche lorsque le bouton "Ouvrir l'éditeur de script de nommage de fichier" est sélectionné.

source: **Files will be named like this**
ca: **El nom dels fitxers serà el següent**
fr: **Les fichiers seront nommés comme ceci**

source: Below the file naming script selector is a section showing examples of the output of the script in two columns: Before and After. If you select files from the Cluster pane or Album pane prior to opening the Options screen, up to 10 files will be randomly chosen from your selection as file naming examples. If you have not selected any files, then some default examples will be provided.
fr: Sous le sélecteur de script de nom de fichier se trouve une section montrant des exemples de sortie du script en deux colonnes : Avant et Après. Si vous sélectionnez des fichiers dans le volet Cluster ou Album avant d'ouvrir l'écran Options, jusqu'à 10 fichiers seront choisis au hasard parmi votre sélection comme exemples de noms de fichiers. Si vous n'avez sélectionné aucun fichier, des exemples par défaut seront fournis.

source: You can change the randomly selected example files from your selected files list by clicking on the :guilabel:`Reload examples` button.
ca: Podeu fer clic en el botó :guilabel:`Torna a carregar els exemples` per a canviar els fitxers d'exemple seleccionats a l'atzar a partir de la llista de fitxers seleccionats.
fr: Les scripts sont souvent abordés dans le `MetaBrainz Community Forum <https://community.metabrainz.org/>`_, et il existe un fil de discussion spécifique à `la dénomination de fichier et les extraits de script <https://community.metabrainz.org/t/repository-for-neat-file-name-string-patterns-and-tagger-script-snippets/2786/>`_.

source: Any new tags set or tags modified by the file naming script will not be written to the output files' metadata.
ca: Qualsevol etiqueta nova o modificada per l'script de nom dels fitxers no s'escriurà a les metadades dels fitxers de sortida.
fr: Les nouvelles balises définies ou les balises modifiées par le script de dénomination des fichiers ne seront pas écrites dans les métadonnées des fichiers de sortie.

source: This specifies the destination parent directory to which files are moved when they are saved, if the "Move files when saving" option is selected. If you use the directory "." the files will be moved relative to their current location. If they are already in some sort of directory structure, this will probably not do what you want!
ca: Això especifica el directori principal de destinació al qual s'han de moure els fitxers després de desar-los si l'opció «Mou els fitxers en desar-los» està seleccionada. Si feu servir el directori «.», els fitxers es mouran de manera relativa a la ubicació actual. Si ja són dins d'una estructura de directoris, és probable que no vulgueu fer això!

source: Enter patterns that match any other files you want Picard to move when saving music files (e.g.: "Folder.jpg", "\*.png", "\*.cue", "\*.log"). Patterns support the Unix shell-style wildcards, and are separated by spaces. The wildcard patterns available are:
ca: Introduïu patrons que coincideixin amb altres fitxers que voleu que Picard mogui en desar fitxers de música (p. ex., «Folder.jpg», «\*.png», «\*.cue», «\*.log»). Els patrons admeten comodins de l'intèrpret d'ordres de l'Unix, separats per espais. Els patrons de comodins disponibles són:

source: This option can also be used to move subdirectories to the new release directory. This is done by specifying the name of the subdirectory in the list of files to be moved. For example, if your album folders have a subfolder called "Artwork", "covers" or "scans" that contains additional image files that you also want to move to the new release directory, simply add "artwork", "covers" and "scans" to the list of additional file matching patterns.
ca: Aquesta opció també es pot fer servir per a moure subdirectoris al directori nou de la publicació. Això es pot aconseguir especificant el nom del subdirectori a la llista de fitxers que s'han de moure. Per exemple, si les carpetes dels vostres àlbums contenen una subcarpeta anomenada «Material gràfic», «Caràtules» o «Imatges» que conté fitxers d'imatge addicionals que també voleu moure al directori nou de la publicació, només cal que afegiu «material gràfic», «caràtules» i «imatges» a la llista de patrons de coincidències de fitxers addicionals.

source: As of Picard version 2.7, multiple file naming scripts are supported. This option allows the user to select the file naming script to use from the list of scripts available. Scripts can be either system preset scripts or user-defined scripts. The available scripts are managed in the :doc:`File naming script editor <options_filerenaming_editor>` screen, which is displayed when the :guilabel:`Edit script...` button is selected.
ca: A partir de la versió 2.7 de Picard s'admeten diversos scripts de nom dels fitxers. Aquesta opció permet a l'usuari seleccionar l'script de nom dels fitxers de la llista de scripts disponibles. Els scripts poden ser predefinits del sistema o definits per l'usuari. Els scripts disponibles s'administren a la pantalla :doc:`Editor de scripts de nom dels fitxers <options_filerenaming_editor>`, que es mostra en seleccionar el botó :guilabel:`Edita l'script...`.

source: Below the file naming script selector is a section showing examples of the output of the script in two columns: Before and After. If you select files from the Cluster pane or Album pane prior to opening the Options screen, up to 10 files will be randomly chosen from your selection as file naming examples. If you have not selected any files, then some default examples will be provided.
ca: Sota el selector de script de nom dels fitxers hi ha una secció que mostra exemples de la sortida de l'script en dues columnes: «Abans» i «Després». Si seleccioneu fitxers de la subfinestra «Agrupació» o «Àlbum» abans d'obrir les opcions, es triaran fins a 10 fitxers de la selecció a l'atzar com a exemples de nom dels fitxers. Si no heu seleccionat cap fitxer, es mostraran alguns exemples per defecte.
