Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_fingerprinting.po
Languages: ca, fr

source: :index:`Fingerprinting Options <configuration; fingerprinting>`
ca: :index:`Opcions de les empremtes <configuració; empremtes>`
fr: :index:`Options d'empreintes digitales <configuration; empreinte digitale>`

source: If you select a file or cluster in the left-hand side of the Picard screen and select :menuselection:`"Tools --> Scan"`, Picard will invoke a program to scan the files and produce a fingerprint for each that can then be used to look up the file on MusicBrainz.
ca: Si seleccioneu un fitxer o una agrupació a l'esquerra de la interfície de Picard i seleccioneu :menuselection:`«Eines --> Analitza»`, Picard invocarà un programa per a analitzar els fitxers i generar una empremta de cadascun que es pugui fer servir per a cercar el fitxer a MusicBrainz.
fr: Si vous sélectionnez un fichier ou un cluster dans la partie gauche de l'écran de Picard et sélectionnez :menuselection:`"Outils --> Scan"`, Picard invoquera un programme pour scanner les fichiers et produire une empreinte pour chacun qui pourra alors être utilisé pour rechercher le fichier sur MusicBrainz.

source: MusicBrainz currently supports only `AcoustID <https://musicbrainz.org/doc/AcoustID>`_ (an Open Source `acoustic fingerprinting <https://musicbrainz.org/doc/Fingerprinting>`_ system created by `Lukáš Lalinský <https://oxygene.sk/>`_) but has previously supported TRM and MusicID PUID.
ca: Actualment, MusicBrainz només és compatible amb `AcoustID <https://musicbrainz.org/doc/AcoustID>`_ (un sistema lliure d'`empremtes d'àudio <https://musicbrainz.org/doc/Fingerprinting>`_ creat per `Lukáš Lalinský <https://oxygene.sk/>`_), però anteriorment ha estat compatible amb TRM i PUID de MusicID.
fr: MusicBrainz ne prend actuellement en charge que `AcoustID <https://musicbrainz.org/doc/AcoustID>`_ (un système Open Source `acoustic fingerprinting <https://musicbrainz.org/doc/Fingerprinting>`_ créé par `Lukáš Lalinský <https://oxygene.sk/>`_) mais a précédemment pris en charge TRM et MusicID PUID.

source: **Audio Fingerprinting**
ca: **Empremtes d'àudio**
fr: **Empreinte audio**

source: This allows you to select whether or not to enable acoustic fingerprinting within Picard. If acoustic fingerprinting is disabled then all remaining options in this tab will be locked and ignored.
ca: Això us permet seleccionar si voleu habilitar o no les empremtes d'àudio a Picard. Si les empremtes d'àudio estan inhabilitades, les opcions restants d'aquesta pestanya es bloquejaran i s'ignoraran.
fr: Cette option vous permet de choisir d'activer ou non l'empreinte acoustique dans Picard. Si la prise d'empreintes acoustiques est désactivée, toutes les autres options de cet onglet seront verrouillées et ignorées.

source: **Ignore existing AcoustID fingerprints**
ca: **Ignora les empremtes AcoustID existents**
fr: **Ignorer les empreintes digitales AcoustID existantes**

source: When checked, any existing AcoustID fingerprint information will not be used, and the files will be rescanned.
ca: Si ho marqueu, la informació de les empremtes AcoustID existents no es farà servir i es tornaran a analitzar els fitxers.
fr: Lorsqu'elle est cochée, les informations d'empreinte digitale AcoustID existantes ne seront pas utilisées et les fichiers seront à nouveau analysés.

source: **Save AcoustID fingerprints to file tags**
ca: **Desa les empremtes AcoustID a les etiquetes dels fitxers**
fr: **Enregistrer les empreintes digitales AcoustID dans des étiquettes de fichiers**

source: When checked, the AcoustID fingerprint information from scanned files will be saved to the ``acoustid_fingerprint`` tag. Note that this option is disabled by default because the fingerprint can always be calculated again from the audio file, and it can add a rather long data tag to the file. The option to save this information has been added as of Picard v2.7 to accommodate use cases such as a workflow where the user adds this tag directly after ripping to avoid having to redo the calculation in the future.
ca: Si ho marqueu, la informació de les empremtes AcoustID dels fitxers analitzats es desarà a l'etiqueta ``acoustid_fingerprint``. Tingueu en compte que aquesta opció està inhabilitada per defecte perquè l'empremta sempre es pot tornar a calcular a partir del fitxer d'àudio i pot afegir una etiqueta de dades llarga al fitxer. L'opció de desar aquesta informació s'ha afegit a partir de Picard 2.7 per a casos d'ús com un flux de treball en què l'usuari afegeix l'etiqueta directament després de l'extracció per a evitar repetir el càlcul en el futur.

source: **Maximum threads to use for calculator**
ca: **Nombre màxim de fils que farà servir la calculadora**
fr: **Fils maximum à utiliser pour la calculatrice**

source: This allows you to specify the maximum number of fingerprint calculations to be run concurrently. The default value is 2.
ca: Això us permet especificar el nombre màxim de càlculs d'empremtes simultanis. El valor per defecte és 2.

source: **Fingerprint calculator**
ca: **Calculadora d'empremtes**
fr: **Calculateur d'empreintes digitales**

source: This identifies the external program on your system that will be used to calculate the AcoustID fingerprints. By default, Picard uses the `Chromaprint <https://acoustid.org/chromaprint>`_ (:program:`fpcalc`) utility which is included with the Picard installation.
ca: Identifica el programa extern del sistema que es farà servir per a calcular les empremtes AcoustID. Per defecte, Picard fa servir l'eina `Chromaprint <https://acoustid.org/chromaprint>`_ (:program:`fpcalc`) inclosa amb la instal·lació de Picard.

source: Picard will auto-detect the path unless you have specifically overwritten it with something different than the detected path. :menuselection:`"Options --> Fingerprinting"` will show the auto detected path as a placeholder hint in the text input, and also uses it for validating the executable. The user only needs to actually select something if auto detection does not work. If the user has selected a specific path this will be used.
ca: Picard detectarà el camí automàticament excepte si l'heu substituït per un camí diferent del detectat. :menuselection:`«Opcions --> Empremtes»` mostrarà el camí detectat automàticament com a suggeriment al quadre d'entrada de text i també el farà servir per a validar l'executable. L'usuari només ha de fer una selecció si la detecció automàtica no funciona. Si l'usuari ha seleccionat un camí específic, es farà servir.
fr: Picard détectera automatiquement le chemin à moins que vous ne l'ayez spécifiquement écrasé avec quelque chose de différent du chemin détecté. :menuselection:`"Options --> Empreinte digitale"` affichera le chemin détecté automatiquement comme un indicateur d'espace réservé dans l'entrée de texte, et l'utilisera également pour valider l'exécutable. L'utilisateur n'a besoin de sélectionner réellement quelque chose que si la détection automatique ne fonctionne pas. Si l'utilisateur a sélectionné un chemin spécifique, celui-ci sera utilisé.

source: **API key**
ca: **Clau de l'API**
fr: **Clé API**

source: The key used to access the AcoustID API to lookup and submit AcoustID fingerprints. There is no cost to obtain an API key.
ca: Clau utilitzada per a accedir a l'API d'AcoustID per a cercar i enviar empremtes AcoustID. Obtenir una clau de l'API no té cap cost.

source: When checked, the AcoustID fingerprint information from scanned files will be saved to the ``acoustid_fingerprint`` tag. Note that this option is disabled by default because the fingerprint can always be calculated again from the audio file, and it can add a rather long data tag to the file. The option to save this information has been added as of Picard v2.7 to accommodate use cases such as a workflow where the user adds this tag directly after ripping to avoid having to redo the calculation in the future.
fr: Lorsque cette option est cochée, les informations de l'empreinte AcoustID des fichiers scannés seront enregistrées dans la balise ``acoustid_fingerprint``. Notez que cette option est désactivée par défaut car l'empreinte peut toujours être recalculée à partir du fichier audio, et cela peut ajouter une balise de données assez longue au fichier. L'option permettant de sauvegarder cette information a été ajoutée à partir de Picard v2.7 pour s'adapter à des cas d'utilisation tels qu'un workflow où l'utilisateur ajoute ce tag directement après le rippage pour éviter d'avoir à refaire le calcul dans le futur.

source: This allows you to specify the maximum number of fingerprint calculations to be run concurrently. The default value is 2.
fr: Cela vous permet de spécifier le nombre maximum de calculs d'empreintes digitales à exécuter simultanément. La valeur par défaut est 2.

source: This identifies the external program on your system that will be used to calculate the AcoustID fingerprints. By default, Picard uses the `Chromaprint <https://acoustid.org/chromaprint>`_ (:program:`fpcalc`) utility which is included with the Picard installation.
fr: Cela identifie le programme externe de votre système qui sera utilisé pour calculer les empreintes digitales AcoustID. Par défaut, Picard utilise l'utilitaire `Chromaprint <https://acoustid.org/chromaprint>`_ (:program:`fpcalc`) qui est inclus avec l'installation de Picard.

source: The key used to access the AcoustID API to lookup and submit AcoustID fingerprints. There is no cost to obtain an API key.
fr: Clé utilisée pour accéder à l'API AcoustID pour rechercher et soumettre des empreintes digitales AcoustID. Il n'y a aucun coût pour obtenir une clé API.
