Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_plugins.po
Languages: fr, pt_br

source: :index:`Plugins Options <pair: configuration; plugins>`
fr: :index:`Options des plugins <pair: configuration; plugins>`
pt_br: :index:`Opções de Plugins <pair:configuration; plugins>`

source: This section allows you to manage the plugins used by Picard. You can install new plugins or enable, disable or uninstall plugins that are currently installed. Picard provides a list of plugins that have been submitted to the project. A list of the standard plugins is available on the `plugins page <https://picard.musicbrainz.org/plugins/>`_ on the Picard website.
fr: Cette section vous permet de gérer les plugins utilisés par Picard. Vous pouvez installer de nouveaux plugins ou activer, désactiver ou désinstaller des plugins actuellement installés. Picard fournit une liste des plugins qui ont été soumis au projet. Une liste des plugins standards est disponible sur la `page des plugins <https://picard.musicbrainz.org/plugins/>`_ sur le site Picard.

source: There are also a number of plugins available by :index:`third-party developers <plugins; third party>`. Often these are discussed on the `Community Discussion Forum <https://community.metabrainz.org/>`_ so if you're looking for a particular enhancement or functionality, a search there might be useful. In addition, one of the MusicBrainz editors, `Colby Ray <https://wiki.musicbrainz.org/User:Colbydray>`_ maintains an unofficial list of available plugins on a `wiki page <https://wiki.musicbrainz.org/User:Colbydray/PicardPlugins>`_. Instructions regarding installation of third-party plugins are included in the :ref:`"Installing Third-Party Plugins" <ref_installingplugins>` section below.
fr: Il existe également un certain nombre de plugins disponibles par :index:`des développeurs tiers <plugins; tierce personne>`. Souvent, ceux-ci sont discutés sur le `Forum de discussion communautaire <https://community.metabrainz.org/>`_ donc si vous recherchez une amélioration ou une fonctionnalité particulière, une recherche peut être utile. De plus, l'un des utilisateurs de MusicBrainz, `Colby Ray <https://wiki.musicbrainz.org/User:Colbydray>`_ maintient une liste non officielle des plugins disponibles sur une `page wiki <https://wiki.musicbrainz.org/User:Colbydray/PicardPlugins>`_. Les instructions concernant l'installation de plugins tiers sont incluses dans la section :ref:`"Installation de plugins tiers" <ref_installingplugins>` ci-dessous.

source: Plugins List
fr: Liste des plugins
pt_br: Lista de Plugins

source: The screen displays a list of the standard plugins and any others that have been installed. Each plugin is displayed on a separate line showing the version number and one or more status / action icons. The icons are:
fr: L'écran affiche une liste des plugins standard et de tous les autres qui ont été installés. Chaque plugin est affiché sur une ligne distincte indiquant le numéro de version et une ou plusieurs icônes d'état / d'action. Les icônes sont:

source: This icon indicates that the plugin is not installed. Clicking the icon will download and install the plugin.
fr: Cette icône indique que le plugin n'est pas installé. Cliquez sur l'icône pour télécharger et installer le plugin.

source: This icon indicates that a newer version of the plugin is available. Clicking the icon will download and install the updated version.
fr: Cette icône indique qu'une version plus récente du plugin est disponible. Cliquez sur l'icône pour télécharger et installer la version mise à jour.

source: This icon indicates that the plugin is installed and currently enabled. Clicking the icon will disable the plugin, but it will still be installed.
fr: Cette icône indique que le plugin est installé et actuellement activé. Cliquer sur l'icône désactivera le plugin, mais il sera toujours installé.

source: This icon indicates that the plugin is installed but currently disabled. Clicking the icon will enable the plugin.
fr: Cette icône indique que le plugin est installé mais actuellement désactivé. Cliquez sur l'icône pour activer le plugin.

source: This icon indicates that the plugin is currently installed. Clicking the icon will uninstall the plugin.
fr: Cette icône indique que le plugin est actuellement installé. Cliquez sur l'icône pour désinstaller le plugin.

source: When a plugin in the list is selected (i.e.: highlighted), a brief description of the plugin will be shown in the "Details" section below the list.
fr: Lorsqu'un plugin dans la liste est sélectionné (c'est-à-dire: mis en évidence), une brève description du plugin sera affichée dans la section "Détails" sous la liste.

source: Some plugins have their own option page which will typically appear under the "Plugins" section of the Options.
fr: Certains plugins ont leur propre page d'options qui apparaîtra généralement sous la section "Plugins" des options.
pt_br: Alguns plugins tem sua própria página de opções, que tipicamente aparece na seção "Plugins" da tela de Opções.

source: :index:`Installing Third-Party Plugins <plugins; installing>`
fr: :index:`Installation de plugins tiers <plugins; installation>`
pt_br: :index:`Instalando Plugins de Terceiros <plugins; installing>`

source: You can install a third-party plugin that does not appear in the plugins list, using the following steps:
fr: Vous pouvez installer un plugin tiers qui n'apparaît pas dans la liste des plugins, en suivant les étapes suivantes:
pt_br: Você pode instalar plugins de terceiros que não aparecem na lista de plugins padrão seguindo as seguintes etapas:

source: Download the plugin and save it to a local drive.
fr: Téléchargez le plugin et enregistrez-le sur un lecteur local.
pt_br: Baixe o plugin e salve-o num disco local.

source: Select the :guilabel:`Install plugin...` action, located just below the list of plugins.
fr: Sélectionnez l'action :guilabel:`Installer le plugin...`, située juste en dessous de la liste des plugins.

source: Navigate to the file you downloaded in Step 1 and select it. The file will be copied to the plugin folder, and will appear in the list of plugins.
fr: Accédez au fichier que vous avez téléchargé à l'étape 1 et sélectionnez-le. Le fichier sera copié dans le dossier du plugin et apparaîtra dans la liste des plugins.

source: Enable the plugin if desired, and select the :guilabel:`Make It So!` action button at the bottom of the window.
fr: Activez le plugin si vous le souhaitez et sélectionnez :guilabel:`Faire en sorte que!` bouton d'action en bas de la fenêtre.

source: This section allows you to manage the plugins used by Picard. You can install new plugins or enable, disable or uninstall plugins that are currently installed. Picard provides a list of plugins that have been submitted to the project. A list of the standard plugins is available on the `plugins page <https://picard.musicbrainz.org/plugins/>`_ on the Picard website.
pt_br: Esta seção te permite gerenciar os plugins utilizados pelo Picard. Você pode instalar, desinstalar, habilidar e desabilitar plugins. O Picard conta com uma lista de plugins submetidos ao projeto. A lista de plugins padrão está disponível na `página de plugins <https://picard.musicbrainz.org/plugins/>`__ no site do Picard.

source: There are also a number of plugins available by :index:`third-party developers <plugins; third party>`. Often these are discussed on the `Community Discussion Forum <https://community.metabrainz.org/>`_ so if you're looking for a particular enhancement or functionality, a search there might be useful. In addition, one of the MusicBrainz editors, `Colby Ray <https://wiki.musicbrainz.org/User:Colbydray>`_ maintains an unofficial list of available plugins on a `wiki page <https://wiki.musicbrainz.org/User:Colbydray/PicardPlugins>`_. Instructions regarding installation of third-party plugins are included in the :ref:`"Installing Third-Party Plugins" <ref_installingplugins>` section below.
pt_br: Existem plugins disponíveis feitos por :index:`terceiros <plugins; third-party>`. Alguns deles tem discussões associadas no `Fórum de Discussão da Comunidade <https://community.metabrainz.org/>`__. Entre na discussão se estiver procurando por alguma melhoria ou funcionalidade. Além disto, um dos editores do MusicBrainz, `Colby Ray <https://wiki.musicbrainz.org/User:Colbydray>`__ mantém uma lista paralela de plugins disponíveis na `página wiki <https://wiki.musicbrainz.org/User:Colbydray/PicardPlugins>`__. Instruções de como instalar plugins de terceiros estão disponíveis na seção abaixo: :ref:`"Instalando Plugins de Terceiros <ref_installingplugins>`.

source: The screen displays a list of the standard plugins and any others that have been installed. Each plugin is displayed on a separate line showing the version number and one or more status / action icons. The icons are:
pt_br: A tela mostra a lista de plugins padrão e quaisquer outros instalados. Cada plugin é mostrado numa linha distinta junto com sua versão e seu estado / ícone de ações. Os ícones são:

source: This icon indicates that the plugin is not installed. Clicking the icon will download and install the plugin.
pt_br: Este ícone indica que o plugin não está instalado. Clicando o ícone, o plugin será baixado e instalado.

source: This icon indicates that a newer version of the plugin is available. Clicking the icon will download and install the updated version.
pt_br: Este ícone indica que uma nova versão do plugin está disponível. Clicando o ícone, a nova versão será baixada e instalada.

source: This icon indicates that the plugin is installed and currently enabled. Clicking the icon will disable the plugin, but it will still be installed.
pt_br: Este ícone indica que o plugin está instalado e habilitado. Clicando o ícone, o plugin será desabilitado porém continuará instalado.

source: This icon indicates that the plugin is installed but currently disabled. Clicking the icon will enable the plugin.
pt_br: O ícone indica que o plugin está instalado mas está desabilitado. Clicando o ícone, o plugin será habilitado.

source: This icon indicates that the plugin is currently installed. Clicking the icon will uninstall the plugin.
pt_br: Este ícone indica que o plugin está instalado. Clicando o ícone, o plugin será desinstalado.

source: When a plugin in the list is selected (i.e.: highlighted), a brief description of the plugin will be shown in the "Details" section below the list.
pt_br: Quando um plugin é selecionado na lista (marcado), uma pequena descrição será mostrada abaixo da lista na seção "Detalhes" .

source: Select the "Install plugin..." action, located just below the list of plugins.
pt_br: Selecione a ação "Instalar plugin...", localizada abaixo da lista de plugins.

source: Navigate to the file you downloaded in Step 1 and select it. The file will be copied to the plugin folder, and will appear in the list of plugins.
pt_br: Navegue para o arquivo que baixou na Etapa 1 e o selecione. O arquivo será copiado para a pasta de plugin e aparecerá na lista de plugins.

source: Enable the plugin if desired, and select the "Make It So!" action button at the bottom of the window.
pt_br: Habilite o plugin se desejar e selecione o botão "Faça assim!" na parte de baixo da janela.
