Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_cover_art_providers.po
Languages: ca, fr

source: :index:`Cover Art Providers <configuration; cover art providers>`
ca: :index:`Proveïdors de caràtules <configuració; proveïdors de caràtules>`
fr: :index:`Fournisseurs d'art de couverture <configuration; fournisseurs d'art de couverture>`

source: Picard can download Cover Art from a number of sources, and you can choose which sources you want Picard to use. You can activate more than one provider and choose the order in which the providers are queried. Picard will try the providers from top to bottom until an image is returned.
ca: Picard pot baixar caràtules de diverses fonts i podeu triar quines fonts voleu que Picard faci servir. Podeu activar més d'un proveïdor i triar l'ordre de consulta dels proveïdors. Picard provarà els proveïdors del principi al final fins que es retorni una imatge.
fr: Picard peut télécharger Cover Art à partir d'un certain nombre de sources, et vous pouvez choisir les sources que vous souhaitez que Picard utilise. Vous pouvez activer plus d'un fournisseur et choisir l'ordre dans lequel les fournisseurs sont interrogés. Picard essaiera les fournisseurs de haut en bas jusqu'à ce qu'une image soit renvoyée.

source: **Cover Art Archive: Release**
ca: **Cover Art Archive: Publicació**

source: The Cover Art Archive (CAA) is the MusicBrainz archive of cover art in cooperation with the `Internet Archive <https://archive.org>`_. The Cover Art Archive is the most comprehensive database of cover art (e.g.: front covers, back covers, booklets, CDs).
ca: Cover Art Archive (CAA) és l'arxiu de caràtules de MusicBrainz en cooperació amb `Internet Archive <https://archive.org>`_. Cover Art Archive és la base de dades més extensa de caràtules (p. ex., caràtules frontals, posteriors, llibrets, CD, etc.).
fr: Les Cover Art Archive (CAA) sont les archives MusicBrainz des couvertures en coopération avec `Internet Archive <https://archive.org>`_. Le Cover Art Archive est la base de données la plus complète des couvertures (par exemple : couvertures avant, arrière, livrets, CD).

source: **Cover Art Archive: Release Group**
ca: **Cover Art Archive: Grup de publicacions**

source: This provider uses the Cover Art Archive cover image assigned to the release group. This is usually the image that best describes the release group as a whole or the image with the best visual quality, but is not necessarily the exact cover of the release you are tagging. This provider is a good choice if you care more about visual quality then having an exact representation of your release. It is also a good fallback for the Cover Art Archive provider.
ca: Aquest proveïdor fa servir la imatge de la caràtula de Cover Art Archive assignada al grup de publicacions. Normalment, és la imatge que descriu millor el grup de publicacions en conjunt o la imatge amb la qualitat visual més bona, però no necessàriament la caràtula exacta de la publicació que esteu etiquetant. Aquest proveïdor és una bona opció si us preocupa més la qualitat visual que tenir una representació exacta de la publicació. També és una bona opció secundària per al proveïdor de Cover Art Archive.
fr: Ce fournisseur utilise l'image de couverture de Cover Art Archive attribuée au groupe de versions. Il s'agit généralement de l'image qui décrit le mieux le groupe de versions dans son ensemble ou l'image avec la meilleure qualité visuelle, mais ce n'est pas nécessairement la couverture exacte de la version que vous marquez. Ce fournisseur est un bon choix si vous vous souciez davantage de la qualité visuelle que d'avoir une représentation exacte de votre version. C'est également une bonne solution de secours pour le fournisseur de Cover Art Archive.

source: **Allowed Cover Art URLs**
ca: **URL de caràtules permesos**
fr: **URL de Couverture Autorisées**

source: This will use images provided from approved third-party sites. The image location is stored as a URL relationship for the release within the MusicBrainz database, and only approved sites can be used for this relationship.
ca: Això farà servir imatges proporcionades per llocs de tercers aprovats. La ubicació de la imatge s'emmagatzema com a relació d'URL per a la publicació a la base de dades de MusicBrainz i només es poden fer servir llocs aprovats per a aquesta relació.
fr: Cela utilisera des images fournies par des sites tiers approuvés. L'emplacement de l'image est stocké en tant que relation URL pour la version dans la base de données MusicBrainz, et seuls les sites approuvés peuvent être utilisés pour cette relation.

source: This relationship type is now deprecated in MusicBrainz, and is no longer used. See `Cover art whitelist <https://wiki.musicbrainz.org/History:Style/Relationships/URLs/Cover_art_whitelist>`_ in the Style Guide for more information.
ca: Aquest tipus de relació està obsolet a MusicBrainz i ja no es fa servir. Per a més informació, consulteu `Llista de caràtules permeses <https://wiki.musicbrainz.org/History:Style/Relationships/URLs/Cover_art_whitelist>`_ a la Guia d'estil.

source: **Local Files**
ca: **Fitxers locals**
fr: **Fichiers locaux**

source: Load cover art from local files. The file names to load can be configured in the :ref:`ref-local-files` provider options.
ca: Carrega caràtules de fitxers locals. Els noms dels fitxers que s'han de carregar es poden configurar a les opcions del proveïdor :ref:`ref-local-files`.
fr: Chargez la pochette à partir de fichiers locaux. Les noms de fichiers à charger peuvent être configurés dans les options du fournisseur :ref:`ref-local-files`.

source: In addition to the built-in cover art providers described above, additional cover art providers can be installed as `plugins <https://picard.musicbrainz.org/plugins/>`_.
ca: A més dels proveïdors de caràtules integrats descrits anteriorment, es poden instal·lar proveïdors addicionals com a `connectors <https://picard.musicbrainz.org/plugins/>`_.
fr: En plus des fournisseurs de couvertures intégrés décrits ci-dessus, des fournisseurs de couvertures supplémentaires peuvent être installés en tant que `plugins <https://picard.musicbrainz.org/plugins/>`_.

source: **Amazon**: Amazon often has cover art when other sites don't, however while this art is almost always for the correct Artist and Album, it may not be the absolute correct cover art for the specific Release with which you have tagged your music. *Note: The Amazon cover art provider was built-in in Picard 2.1.3 and earlier versions. For later versions it needs to be installed as a separate plugin.*
ca: **Amazon**: sovint, Amazon disposa de caràtula quan altres llocs no en tenen. Ara bé, encara que la caràtula gairebé sempre correspon a l'artista i l'àlbum correctes, és possible que no sigui la caràtula absolutament correcta per a la publicació específica segons la qual heu etiquetat la música. *Nota: el proveïdor de caràtules d'Amazon estava integrat a Picard 2.1.3 i les versions anteriors. Cal instal·lar-lo com a connector independent en versions posteriors.*
fr: **Amazon** : Amazon a souvent une pochette alors que d'autres sites ne le font pas, cependant, bien que cette illustration soit presque toujours pour le bon artiste et l'album, elle peut ne pas être la pochette absolument correcte pour la version spécifique avec laquelle vous avez tagué ta musique. *Remarque : le fournisseur de couvertures Amazon était intégré à Picard 2.1.3 et aux versions antérieures. Pour les versions ultérieures, il doit être installé en tant que plugin séparé.*

source: **fanart.tv**: Uses cover art from `fanart.tv <https://fanart.tv/>`_, which focuses on cover art with high visual quality. This provider provides cover art representative for the release group and not the individual release.
ca: **fanart.tv**: fa servir caràtules de `fanart.tv <https://fanart.tv/>`_, que se centra en caràtules amb una alta qualitat visual. Aquest proveïdor proporciona una representació de la caràtula del grup de publicacions i no les publicacions específiques.
fr: **fanart.tv** : utilise la pochette de `fanart.tv <https://fanart.tv/>`_, qui se concentre sur la pochette avec une haute qualité visuelle. Ce fournisseur fournit un représentant de la pochette pour le groupe de versions et non pour la version individuelle.

source: **TheAudioDB**: Uses cover art from `TheAudioDB <https://www.theaudiodb.com/>`_, which focuses on cover art with high visual quality. This provider provides cover art representative for the release group and not the individual release.
ca: **TheAudioDB**: fa servir caràtules de `TheAudioDB <https://www.theaudiodb.com/>`_, que se centra en caràtules amb una alta qualitat visual. Aquest proveïdor proporciona una representació de la caràtula del grup de publicacions i no les publicacions específiques.
fr: **TheAudioDB** : utilise la pochette de `TheAudioDB <https://www.theaudiodb.com/>`_, qui se concentre sur la pochette avec une haute qualité visuelle. Ce fournisseur fournit un représentant de la pochette pour le groupe de versions et non pour la version individuelle.

source: **Cover Art Archive**
fr: **Archives d'art de couverture**

source: **CAA Release Group**
fr: **Groupe de version CAA**

source: This relationship type is now deprecated in MusicBrainz, and is no longer used. See `Cover art whitelist <https://wiki.musicbrainz.org/History:Style/Relationships/URLs/Cover_art_whitelist>`_ in the Style Guide for more information.
fr: Ce type de relation est désormais obsolète dans MusicBrainz et n'est plus utilisé. Voir `Liste blanche des couvertures <https://wiki.musicbrainz.org/History:Style/Relationships/URLs/Cover_art_whitelist>`_ dans le Guide de style pour plus d'informations.
