Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_cover_art_archive.po
Languages: ca, fr

source: :index:`Cover Art Archive <pair: configuration; cover art archive>`
ca: :index:`Cover Art Archive <pair: configuració; cover art archive>`
fr: :index:`Cover Art Archive <pair: configuration; archives de l'art de la couverture>`

source: In this section you can decide which types of cover art you would like to download from the Cover Art Archive, and what quality (size) you want to download. Obviously, the better the quality, the larger the size of the files.
ca: En aquesta secció podeu decidir quins tipus de caràtules voleu baixar de Cover Art Archive i en quina qualitat (mida). Evidentment, com més bona sigui la qualitat, més gran serà la ida dels fitxers.
fr: Dans cette section, vous pouvez décider quels types de pochettes vous souhaitez télécharger à partir des archives de pochettes et quelle qualité (taille) vous voulez télécharger. Évidemment, meilleure est la qualité, plus la taille des fichiers est grande.

source: **Download only cover art images matching the selected types**
ca: **Baixa només les imatges de caràtules que coincideixin amb els tipus seleccionats**
fr: **Télécharger uniquement les images de couverture correspondant aux types sélectionnés**

source: When selecting the cover art image types, you can select the types to both include and exclude from the download list. CAA images with an image type found in the "Include" list will be downloaded and used unless they also have an image type found in the "Exclude" list. Images with types found in the "Exclude" list will never be used. Image types not appearing in either the "Include" or "Exclude" lists will not be considered when determining whether or not to download and use a CAA image.
ca: A l'hora de seleccionar els tipus d'imatges de caràtules, podeu seleccionar els tipus que voleu incloure i excloure de la llista de baixades. Les imatges de CAA amb un tipus d'imatge a la llista de tipus inclosos es baixaran i faran servir excepte si també tenen un tipus d'imatge de la llista de tipus exclosos. Les imatges amb tipus de la llista de tipus exclosos no es faran servir mai. Els tipus d'imatges que no apareguin a les llistes de tipus inclosos o exclosos no es tindran en compte a l'hora de determinar si s'ha de baixar i fer servir una imatge de CAA o no.
fr: Lors de la sélection des types d'images de couverture, vous pouvez sélectionner les types à inclure et à exclure de la liste de téléchargement. Les images CAA avec un type d'image trouvé dans la liste "Inclure" seront téléchargées et utilisées à moins qu'elles n'aient également un type d'image trouvé dans la liste "Exclure". Les images dont les types se trouvent dans la liste "Exclure" ne seront jamais utilisées. Les types d'images n'apparaissant pas dans les listes "Inclure" ou "Exclure" ne seront pas pris en compte pour déterminer s'il faut ou non télécharger et utiliser une image CAA.

source: Most music players will display only one piece of cover art for the album, and most people select Front (cover) for that.
ca: La majoria de reproductors de música només mostraran una caràtula per a l'àlbum i la majoria de persones seleccionen «Frontal» (caràtula).
fr: La plupart des lecteurs de musique n'afficheront qu'une seule pièce de couverture pour l'album, et la plupart des gens choisissent Front (couverture) pour cela.

source: **Only use images of the following size**
ca: **Fes servir només imatges de la mida següent**
fr: **N'utilisez que des images de la taille suivante**

source: This identifies what size of image to download from the CAA. The options are 250px, 500px, 1200px amd full size. The fixed sizes are generated automatically from the full size image, provided that it is greater than or equal to the fixed size being generated. The generated images are square and padded as required if the original image is not square.
ca: Això identifica la mida d'imatge que s'ha de baixar de CAA. Les opcions són 250px, 500px, 1200px i la mida completa. Les mides fixes es generen automàticament a partir de la imatge de mida completa sempre que sigui més gran o igual que la mida fixa generada. Les imatges generades són quadrades i es farceixen, si cal, si la imatge original no és quadrada.
fr: Cela identifie la taille de l'image à télécharger à partir du CAA. Les options sont 250px, 500px, 1200px et pleine taille. Les tailles fixes sont générées automatiquement à partir de l'image pleine taille, à condition qu'elle soit supérieure ou égale à la taille fixe générée. Les images générées sont carrées et remplies selon les besoins si l'image d'origine n'est pas carrée.

source: If the selected size is not available, then Picard will use the largest available size below the selected size.
ca: Si la mida seleccionada no està disponible, Picard farà servir la mida disponible més gran per sota de la mida seleccionada.

source: **Download only approved images**
ca: **Baixa només imatges aprovades**
fr: **Télécharger uniquement les images approuvées**

source: When checked, Picard will only download images that have been approved (i.e.: the edit to add the image has been accepted and applied). To allow using images from pending edits, leave this option unchecked.
ca: Si marqueu això, Picard només baixarà les imatges que s'hagin aprovat (p. ex., l'edició per a afegir la imatge s'ha acceptat i aplicat). Per a permetre l'ús d'imatges d'edicions pendents, deixeu aquesta opció sense marcar.
fr: Lorsqu'elle est cochée, Picard ne téléchargera que les images qui ont été approuvées (c'est-à-dire: la modification pour ajouter l'image a été acceptée et appliquée). Pour autoriser l'utilisation d'images issues de modifications en attente, laissez cette option décochée.

source: Since Picard 1.3, you can also decide whether or not to use the image from the release group (if any) if no front image is found for the release. In this case, the cover may not match the exact release you are tagging (eg.: a 1979 vinyl front cover may be used in place of the Deluxe 2010 CD reissue).
ca: A partir de Picard 1.3, també podeu decidir si voleu fer servir o no la imatge del grup de publicacions (si n'hi ha) si no es troba cap imatge frontal per a la publicació. En aquest cas, és possible que la caràtula no coincideixi amb la publicació exacta que esteu etiquetant (p. ex., pot ser que es faci servir la caràtula d'un vinil de 1979 en comptes de la del CD de la reedició deluxe de 2010).
fr: Depuis Picard 1.3, vous pouvez également décider d'utiliser ou non l'image du groupe de versions (le cas échéant) si aucune image de face n'est trouvée pour la version. Dans ce cas, la pochette peut ne pas correspondre à la version exacte que vous étiquetez (par exemple: une pochette en vinyle de 1979 peut être utilisée à la place de la réédition du CD Deluxe 2010).
