Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_scripting.po
Languages: ca, fr

source: :index:`Scripting Options <configuration; scripting, scripts; tagging>`
ca: :index:`Opcions dels scripts <configuració; creació de scripts; scripts; etiquetes>`
fr: :index:`Options de script <configuration; scripts, scripts; balisage>`

source: This section allows for the management of user-defined tagging scripts.
ca: Aquesta secció permet administrar els scripts d'etiquetatge definits per l'usuari.
fr: Cette section permet la gestion des scripts de balisage définis par l'utilisateur.

source: The "Enable Tagger Script(s)" checkbox at the top of the page allows you to completely disable all tagging scripts. This can be useful when tracking down a problem with Picard's configuration.
ca: La casella de selecció «Habilita els scripts d'etiquetatge» de la part superior de la pàgina us permet inhabilitar completament tots els scripts d'etiquetatge. Això pot ser útil quan s'investiga un problema amb la configuració de Picard.

source: Below the checkbox are two columns showing the list of scripts in the left-hand column, with the content of the selected script shown in the right-hand column. This section allows you to add, remove and reorder the scripts, enable or disable individual scripts, as well as edit the currently selected script.
ca: Sota la casella de selecció hi ha dues columnes: a l'esquerra es mostra la llista de scripts, mentre que a la dreta es mostra el contingut de l'script seleccionat. Aquesta secció us permet afegir, suprimir i canviar l'ordre dels scripts, habilitar o inhabilitar scripts individualment i editar l'script seleccionat actualment.

source: As of Picard v2.7 you can also import a new script from a file, or export an existing script to a file. Files can be stored as either a plain-text script or a Picard Tagging Script Package stored in YAML format.
ca: A partir de Picard 2.7 també podeu un script nou des d'un fitxer o exportar un script existent a un fitxer. Els fitxers es poden emmagatzemar com a script de text sense format o com un paquet de script d'etiquetatge de Picard en format YAML.
fr: Depuis Picard v2.7, vous pouvez également importer un nouveau script à partir d'un fichier, ou exporter un script existant vers un fichier. Les fichiers peuvent être stockés soit sous la forme d'un script en texte brut, soit sous la forme d'un paquet de script de balisage Picard stocké au format YAML.

source: The script editor automatically highlights the elements of the script, including :doc:`function names <../functions/list_by_type>` and :doc:`tag and variable names <../variables/variables>`. Hovering your mouse pointer over one of the highlighted entries will display help information about the entry if available.
ca: L'editor de scripts ressalta automàticament els elements de l'script, incloent-hi els :doc:`noms de les funcions <../functions/list_by_type>` i els :doc:`noms de les etiquetes i les variables <../variables/variables>`. Si passeu el cursor sobre una de les entrades ressaltades, es mostrarà informació d'ajuda sobre l'entrada si està disponible.
fr: L'éditeur de script met automatiquement en surbrillance les éléments du script, notamment :doc:`noms des fonctions <../functions/list_by_type>` et :doc:`noms des balises et des variables <../variables/variables>`. En passant le pointeur de votre souris sur l'une des entrées en surbrillance, vous afficherez des informations d'aide sur cette entrée, si elles sont disponibles.

source: Unicode characters can be entered into the script using the format ``\uXXXX`` where "XXXX" is the hexadecimal value of the unicode character.
ca: Es poden introduir caràcters Unicode a l'script amb el format ``\uXXXX``, en què «XXXX» és el valor hexadecimal del caràcter Unicode.
fr: Les caractères Unicode peuvent être saisis dans le script en utilisant le format ``uXXXX`` où "XXXX" est la valeur hexadécimale du caractère unicode.

source: When the checkbox beside the script is checked, that script will be executed automatically, once for each track in the release, when Picard retrieves information for a release from the MusicBrainz website. If the checkbox is left unchecked, then the script will not be executed automatically.
ca: Si marqueu la casella de selecció al costat de l'script, s'executarà automàticament una vegada per a cada pista de la publicació quan Picard recuperi la informació d'una publicació des del lloc web de MusicBrainz. Si no marqueu la casella de selecció, l'script no s'executarà automàticament.

source: Regardless of whether or not the script is executed automatically, it can also be executed manually by right-clicking on an item in the clustering pane (middle pane) or the tagging pane (right-hand pane) and selecting it from the list displayed when :menuselection:`"Run Scripts"` is selected. If a cluster is selected in the middle pane or a release is selected in the right-hand pane, the script will be executed for each track in the selected cluster or release. If only a single track or file is selected, then the script will only be executed for that track or file.
ca: Independentment de si l'script s'executa automàticament o no, també es pot executar manualment fent clic dret en un element a la subfinestra d'agrupació (central) o a la subfinestra d'etiquetatge (dreta) i seleccionant-lo a la llista que es mostra en seleccionar :menuselection:`«Executa scripts»`. Si s'ha seleccionat una agrupació a la subfinestra central o una publicació a la subfinestra dreta, l'script s'executarà per a cada pista de l'agrupació o la publicació. Si només s'ha seleccionat una única pista o un sol fitxer, l'script només s'executarà per a la pista o el fitxer en qüestió.

source: For additional information about scripting please see the ":doc:`Scripts <../extending/scripts>`" and ":doc:`Scripting <../extending/scripting>`" sections, as well as ":doc:`Tags & Variables <../variables/variables>`".
ca: Per a més informació sobre els scripts, consulteu les seccions «:doc:`Scripts <../extending/scripts>`» i «:doc:`Creació de scripts <../extending/scripting>`», així com «:doc:`Etiquetes i variables <../variables/variables>`».
fr: Pour plus d'informations sur les scripts, veuillez consulter les sections :doc:`"Scripts" <../extending/scripts>` et :doc:`"Scripting" <../extending/scripting>`, ainsi que :doc:`"Balises & Variables" <../variables/variables>`.

source: The "Tagger Script(s)" checkbox at the top of the page allows you to completely disable all tagging scripts. This can be useful when tracking down a problem with Picard's configuration.
fr: La case à cocher "Tagger Script(s)" en haut de la page vous permet de désactiver complètement tous les scripts de balisage. Cela peut être utile lors de la recherche d'un problème avec la configuration de Picard.

source: Below the checkbox are two columns showing the list of scripts in the left-hand column, with the content of the selected script shown in the right-hand column. This section allows you to add, remove and reorder the scripts, enable or disable individual scripts, as well as edit the currently selected script.
fr: Sous la case à cocher se trouvent deux colonnes affichant la liste des scripts dans la colonne de gauche, avec le contenu du script sélectionné affiché dans la colonne de droite. Cette section vous permet d'ajouter, de supprimer et de réorganiser les scripts, d'activer ou de désactiver des scripts individuels, ainsi que de modifier le script actuellement sélectionné.

source: When the checkbox beside the script is checked, that script will be executed automatically, once for each track in the release, when Picard retrieves information for a release from the MusicBrainz website. If the checkbox is left unchecked, then the script will not be executed automatically.
fr: Lorsque la case à cocher à côté du script est cochée, ce script sera exécuté automatiquement, une fois pour chaque piste de la version, lorsque Picard récupérera des informations pour une version sur le site Web de MusicBrainz. Si la case n'est pas cochée, le script ne sera pas exécuté automatiquement.

source: Regardless of whether or not the script is executed automatically, it can also be executed manually by right-clicking on an item in the clustering pane (middle pane) or the tagging pane (right-hand pane) and selecting it from the list displayed when :menuselection:`"Run Scripts"` is selected. If a cluster is selected in the middle pane or a release is selected in the right-hand pane, the script will be executed for each track in the selected cluster or release. If only a single track or file is selected, then the script will only be executed for that track or file.
fr: Que le script soit exécuté automatiquement ou non, il peut également être exécuté manuellement en cliquant avec le bouton droit de la souris sur un élément dans le volet de clustering (volet central) ou dans le volet de balisage (volet de droite) et en le sélectionnant dans la liste affichée lorsque :menuselection:`"Exécuter les scripts"` est sélectionné Si un cluster est sélectionné dans le volet central ou si une version est sélectionnée dans le volet droit, le script sera exécuté pour chaque piste du cluster ou de la version sélectionnée. Si une seule piste ou un seul fichier est sélectionné, le script ne sera exécuté que pour cette piste ou ce fichier.
