Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_filerenaming_editor.po
Languages: ca, fr

source: :index:`File Naming Script Editor <pair: file naming; script editor>`
ca: :index:`Editor de scripts de nom dels fitxers <pair: nom dels fitxers; editor de scripts>`
fr: :index:`Nom de fichier Editeur de script <pair: nom de fichier; editeur de script>`

source: The file naming script editor is used to manage the file naming scripts available for use by Picard. Each script has a title that will show up in the script selection box, and all listed scripts can be edited by the user.
ca: L'editor de scripts de nom dels fitxers es fa servir per a administrar els scripts de nom dels fitxers disponibles per a l'ús a Picard. Cada script té un títol que es mostrarà al quadre de selecció de script i l'usuari pot editar tots els scripts de la llista.
fr: L'éditeur de scripts de nommage de fichiers est utilisé pour gérer les scripts de nommage de fichiers disponibles pour Picard. Chaque script a un titre qui s'affiche dans la boîte de sélection des scripts, et tous les scripts listés peuvent être modifiés par l'utilisateur.

source: The editor screen has the following sections:
ca: La pantalla de l'editor té les seccions següents:
fr: L'écran de l'éditeur comporte les sections suivantes:

source: **Select the file naming script to use**
ca: **Seleccioneu l'script de noms dels fitxers que voleu fer servir**
fr: **Sélectionnez le script de dénomination des fichiers à utiliser**

source: This option allows the user to select the file naming script to use from the list of scripts available. The selected script will show up in the editing section, where it can be modified if required.
ca: Aquesta opció permet a l'usuari seleccionat l'script de nom dels fitxers que es vol fer servir de la llista de scripts disponibles. L'script seleccionat es mostrarà a la secció d'edició, on es pot modificar, si cal.
fr: Cette option permet à l'utilisateur de sélectionner le script de dénomination de fichier à utiliser dans la liste des scripts disponibles. Le script sélectionné s'affichera dans la section d'édition, où il pourra être modifié si nécessaire.

source: **Title**
ca: **Títol**
fr: **Titre**

source: The title assigned to the currently selected script. This can be modified if required.
ca: Títol assignat a l'script seleccionat actualment. Això es pot modificar, si cal.
fr: Le titre attribué au script actuellement sélectionné. Il peut être modifié si nécessaire.

source: **Script**
fr: **Scénario**

source: Below the title is an edit box section containing the :index:`formatting string <scripts; file naming>` of the selected script. This tells Picard what the new name of the file and its containing directories should be in terms of various metadata values. The formatting string is generally referred to as a "file naming script", and is in :doc:`Picard's scripting language <../extending/scripting>`.
ca: Sota el títol hi ha una secció amb un quadre d'edició que conté la :index:`cadena de format <scripts; nom dels fitxers>` de l'script seleccionat. Això indica a Picard quin ha de ser el nom del fitxer i dels directoris segons diversos valors de metadades. Generalment, es fa referència a la cadena de format com a «script de nom dels fitxers» i està escrita en el :doc:`llenguatge de scripts de Picard <../extending/scripting>`.
fr: Sous le titre se trouve une section de boîte d'édition contenant la :index:`chaîne de formatage <scripts; nom de fichier>` du script sélectionné. Ceci indique à Picard quel doit être le nouveau nom du fichier et des répertoires qu'il contient en fonction de diverses valeurs de métadonnées. La chaîne de formatage est généralement appelée "script de nom de fichier", et se trouve dans :doc:`Le langage de script de Picard <../extending/scripting>`.

source: The script editor automatically highlights the elements of the script, including :doc:`function names <../functions/list_by_type>` and :doc:`tag and variable names <../variables/variables>`. Hovering your mouse pointer over one of the highlighted entries will display help information about the entry if available.
ca: L'editor de scripts ressalta automàticament els elements de l'script, incloent-hi els :doc:`noms de les funcions <../functions/list_by_type>` i els :doc:`noms de les etiquetes i les variables <../variables/variables>`. Si passeu el cursor sobre una de les entrades ressaltades, es mostrarà informació d'ajuda sobre l'entrada si està disponible.
fr: L'éditeur de script met automatiquement en surbrillance les éléments du script, notamment :doc:`noms des fonctions <../functions/list_by_type>` et :doc:`noms des balises et des variables <../variables/variables>`. En passant le pointeur de votre souris sur l'une des entrées en surbrillance, vous afficherez des informations d'aide sur cette entrée, si elles sont disponibles.

source: Unicode characters can be entered into the script using the format ``\uXXXX`` where "XXXX" is the hexadecimal value of the unicode character. It is not recommended to include unicode characters in the directory or filename.
ca: Es poden introduir caràcters Unicode a l'script amb el format ``\uXXXX``, on «XXXX» és el valor hexadecimal del caràcter Unicode. No es recomana incloure caràcters Unicode al nom del directori o del fitxer.
fr: Les caractères unicode peuvent être saisis dans le script en utilisant le format ``\uXXXX`` où "XXXX" est la valeur hexadécimale du caractère unicode. Il n'est pas recommandé d'inclure des caractères unicode dans le répertoire ou le nom du fichier.

source: The use of a '/' in the formatting string separates the output directory from the file name. The formatting string is allowed to contain any number of '/' characters. Everything before the last '/' is the directory location, and everything after the last '/' becomes the file's name.
ca: L'ús de «/» a la cadena de format separa el directori de sortida del nom del fitxer. Es permet que la cadena de format contingui qualsevol nombre de caràcters «/». Tot el que hi ha abans del darrer «/» és la ubicació del directori i tot el que hi ha després és el nom del fitxer.
fr: L'utilisation d'un '/' dans la chaîne de formatage permet de séparer le répertoire de sortie du nom du fichier. La chaîne de formatage peut contenir un nombre quelconque de caractères '/'. Tout ce qui précède le dernier '/' est l'emplacement du répertoire, et tout ce qui suit le dernier '/' devient le nom du fichier.

source: Each file naming script can vary from a simple one-line script such as ``%album%/%title%`` to a very complex script using different file naming formats based on different criteria. In all cases, the files will be saved using the text output by the script.
ca: Els scripts de nom dels fitxers poden variar d'un script senzill d'una sola línia com ara ``%album%/%title%`` a un script molt complex amb diferents formats de nom dels fitxers segons criteris diferents. En qualsevol cas, els fitxers es desaran amb la sortida de text de l'script.
fr: Chaque script de dénomination de fichier peut varier d'un simple script d'une ligne tel que ``%album%/%title%`` à un script très complexe utilisant différents formats de dénomination de fichier basés sur différents critères. Dans tous les cas, les fichiers seront enregistrés en utilisant le texte produit par le script.

source: Scripts are often discussed in the `MetaBrainz Community Forum <https://community.metabrainz.org/>`_, and there is a thread specific to `file naming and script snippets <https://community.metabrainz.org/t/repository-for-neat-file-name-string-patterns-and-tagger-script-snippets/2786/>`_. There is also a tutorial on :doc:`../tutorials/naming_script` available.
ca: Sovint es parla de scripts al `fòrum de la comunitat de MetaBrainz <https://community.metabrainz.org/>`_ i hi ha un fil específic de `nom dels fitxers i fragments de scripts <https://community.metabrainz.org/t/repository-for-neat-file-name-string-patterns-and-tagger-script-snippets/2786/>`_. També hi ha un tutorial disponible a :doc:`../tutorials/naming_script`.
fr: Les scripts sont souvent discutés dans le `Forum communautaire de MetaBrainz <https://community.metabrainz.org/>`_, et il existe un fil de discussion spécifique au `nommage des fichiers et aux extraits de script <https://community.metabrainz.org/t/repository-for-neat-file-name-string-patterns-and-tagger-script-snippets/2786/>`_. Il y a aussi un tutoriel sur :doc:`../tutorials/naming_script` disponible.

source: Any new tags set or tags modified by the file naming script will not be written to the output files' metadata.
ca: Qualsevol etiqueta nova o modificada per l'script de nom dels fitxers no s'escriurà a les metadades dels fitxers de sortida.
fr: Les nouvelles balises définies ou les balises modifiées par le script de dénomination des fichiers ne seront pas écrites dans les métadonnées des fichiers de sortie.

source: **Files will be named like this**
ca: **El nom dels fitxers serà el següent**
fr: **Les fichiers seront nommés comme ceci**

source: Below the file naming script is a section showing examples of the output of the script in two columns: Before and After. If you select files from the Cluster pane or Album pane prior to opening the Options screen, up to 10 files will be randomly chosen from your selection as file naming examples. If you have not selected any files, then some default examples will be provided.
ca: Sota l'script de nom dels fitxers hi ha una secció que mostra exemples de la sortida de l'script en dues columnes: «Abans» i «Després». Si seleccioneu fitxers de la subfinestra «Agrupació» o «Àlbum» abans d'obrir les opcions, es triaran fins a 10 fitxers de la selecció a l'atzar com a exemples de nom dels fitxers. Si no heu seleccionat cap fitxer, es mostraran alguns exemples per defecte.
fr: Sous le script de dénomination des fichiers se trouve une section montrant des exemples de sortie du script en deux colonnes : Avant et Après. Si vous sélectionnez des fichiers dans le volet Cluster ou Album avant d'ouvrir l'écran Options, jusqu'à 10 fichiers seront choisis au hasard parmi votre sélection comme exemples de noms de fichiers. Si vous n'avez sélectionné aucun fichier, des exemples par défaut seront fournis.

source: **Menu bar**
ca: **Barra de menú**
fr: **Barre de menu**

source: At the top of the screen is a menu bar that provides script management functions as well as display settings options. The display settings include:
ca: A la part superior de la pantalla hi ha una barra de menú que proporciona funcions d'administració dels scripts i paràmetres de visualització. Els paràmetres de visualització inclouen:
fr: En haut de l'écran se trouve une barre de menu qui fournit des fonctions de gestion de script ainsi que des options de paramètres d'affichage. Les paramètres d'affichage comprennent:

source: Word wrap script - This will toggle word wrap on and off in the script edit box.
ca: Ajusta les línies de l'script: això activarà o desactivarà l'ajustament de les línies al quadre d'edició de l'script.
fr: Word wrap script - Ceci permet d'activer et de désactiver le word wrap dans la boîte d'édition du script.

source: Show help tooltips - This will determine whether or not the information is displayed when hovering over a highlighted item.
ca: Mostra els indicadors de funció d'ajuda: això determina si es mostra o no informació en passar el cursor sobre un element ressaltat.
fr: Afficher les infobulles d'aide - Ceci déterminera si les informations sont affichées ou non lors du survol d'un élément en surbrillance.

source: Show documentation - This will toggle displaying the scripting documentation in a sidebar on the screen.
ca: Mostra la documentació: això activarà o desactivarà la documentació dels scripts en una barra lateral a la pantalla.
fr: Afficher la documentation - Cette option permet d'afficher la documentation des scripts dans une barre latérale à l'écran.

source: There is also an option to update the randomly selected example files from your selected files list.
ca: També hi ha una opció per a actualitzar els fitxers d'exemple seleccionats a l'atzar a partir de la llista de fitxers seleccionats.
fr: Il existe également une option permettant de mettre à jour les fichiers d'exemple choisis au hasard dans votre liste de fichiers sélectionnés.

source: The script management functionality includes:
ca: La funcionalitat d'administració de scripts inclou:
fr: La fonctionnalité de gestion des scripts comprend:

source: Import a new script from a file, either as a plain-text script or a Picard Naming Script Package.
ca: Importar un script nou des d'un fitxer, sigui un script de text sense formato un paquet de script de nom dels fitxers de Picard.
fr: Importez un nouveau script à partir d'un fichier, qu'il s'agisse d'un script en texte brut ou d'un paquet de scripts de dénomination Picard.

source: Export the current script to a file, either as a plain-text script or a Picard Naming Script Package.
ca: Exportar l'script actual a un fitxer, sigui un script de text sense format o un paquet de script de nom dels fitxers de Picard.
fr: Exporte le script actuel vers un fichier, soit sous forme de script en texte brut, soit sous forme de paquet de scripts de dénomination Picard.

source: Add a new (default) script. This can be a blank script or one of the basic system preset scripts provided by Picard.
ca: Afegir un script nou (per defecte). Pot ser un script en blanc o un dels scripts bàsics predefinits del sistema que proporciona Picard.
fr: Ajouter un nouveau script (par défaut). Il peut s'agir d'un script vierge ou d'un des scripts prédéfinis du système de base fournis par Picard.

source: Copy the current script as a new script.
ca: Copiar l'script actual com a script nou.
fr: Copie le script actuel comme un nouveau script.

source: Delete the current script.
ca: Suprimir l'script actual.
fr: Supprime le script actuel.

source: Reset all scripts, also available via the :guilabel:`Reset` button.
ca: Reinicialitzar tots els scripts, disponible també amb el botó :guilabel:`Reinicialitza`.
fr: Réinitialise tous les scripts, également disponible via le bouton :guilabel:`Reset`.

source: Save all changes, also available via the :guilabel:`Make It So!` button.
ca: Desar tots els canvis, disponible també amb el botó :guilabel:`Aplica`.
fr: Enregistrer toutes les modifications, également disponible via le bouton :guilabel:`Faites-le donc!`.

source: Exit without saving changes, also available via the :guilabel:`Cancel` button.
ca: Sortir sense desar els canvis, disponible també amb el botó :guilabel:`Cancel·la`.
fr: Quitter sans enregistrer les modifications, également disponible via le bouton :guilabel:`Annuler`.

source: **Script Metadata**
ca: **Metadades de l'script**
fr: **Métadonnées du scénario**

source: There is also an option to view/edit the metadata details for the current script. These details include such things as title, author, version, license, description, and date and time of the last update. It is recommended that the description include things such as any required plugins, settings, or tagging scripts. This can also be triggered by double clicking the script title text box.
ca: També hi ha una opció per a veure/editar els detalls de les metadades de l'script actual. Aquests detalls inclouen el títol, l'autor, la versió, la llicència, la descripció i la data i hora de la darrera actualització. Es recomana que la descripció inclogui detalls com els connectors, paràmetres o scripts d'etiquetatge necessaris. Això també es pot obrir fent doble clic en el quadre de text del títol de l'script.
fr: Il existe également une option pour afficher/modifier les détails des métadonnées du script actuel. Ces détails comprennent des éléments tels que le titre, l'auteur, la version, la licence, la description, ainsi que la date et l'heure de la dernière mise à jour. Il est recommandé d'inclure dans la description des éléments tels que les plugins, les paramètres ou les scripts de marquage requis. Cette opération peut également être déclenchée en double-cliquant sur la zone de texte du titre du script.

source: This information is saved in the Picard Naming Script Package file, and is included when a script package file is imported.
ca: Aquesta informació es desa al fitxer de paquet de script de nom dels fitxers de Picard i s'inclou quan s'importa un fitxer de paquet de script.
fr: Ces informations sont enregistrées dans le fichier Picard Naming Script Package, et sont incluses lorsqu'un fichier script package est importé.
