Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_before_tagging.po
Languages: ca, fr

source: :index:`Before Tagging <configuration; before tagging>`
ca: :index:`Abans de l'etiquetatge <configuració; abans de l'etiquetatge>`
fr: :index:`Avant de baliser <configuration; avant le balisage>`

source: **Clear existing tags**
ca: **Esborra les etiquetes existents**
fr: **Effacer les balises existantes**

source: Checking this will remove all existing metadata and leave your files with only MusicBrainz metadata. Information you may have added through another media player such as "genre", "comments" or "ratings" will be removed.
ca: Si marqueu aquesta opció, se suprimiran totes les metadades existents i els fitxers només contindran metadades de MusicBrainz. Se suprimirà la informació que hàgiu afegit des d'un altre reproductor, com ara el gènere, els comentaris o les puntuacions.
fr: Cochez cette case pour supprimer toutes les métadonnées existantes et laisser vos fichiers avec uniquement les métadonnées MusicBrainz. Les informations que vous avez peut-être ajoutées via un autre lecteur multimédia, telles que "genre", "commentaires" ou "évaluations", seront supprimées.

source: **Keep embedded images when clearing tags**
ca: **Conserva les imatges incrustades en esborrar les etiquetes**
fr: **Garder les images intégrées lors de l'effacement des balises**

source: The default is for Picard to remove any embedded images from the files when clearing existing tags. Checking this option will keep the embedded images in the files.
ca: Per defecte, Picard suprimeix totes les imatges incrustades dels fitxers en esborrar les etiquetes existents. Si marqueu aquesta opció, les imatges incrustades es conservaran.
fr: Par défaut, Picard supprime toutes les images intégrées dans les fichiers lorsqu'il efface les tags existants. En cochant cette option, les images incorporées seront conservées dans les fichiers.

source: **Remove ID3 tags from FLAC files**
ca: **Suprimeix les etiquetes ID3 dels fitxers FLAC**
fr: **Supprimer les balises ID3 des fichiers FLAC**

source: Check to remove ID3 tags from FLAC files – Vorbis Comments are recommended for FLAC files. Picard will write Vorbis Comments to FLAC files regardless of this setting.
ca: Marqueu aquesta opció per a suprimir les etiquetes ID3 dels fitxers FLAC; es recomanen els comentaris Vorbis per als fitxers FLAC. Picard escriurà comentaris Vorbis als fitxers FLAC independentment d'aquest paràmetre.
fr: Cochez pour supprimer les balises ID3 des fichiers FLAC - Les commentaires Vorbis sont recommandés pour les fichiers FLAC. Picard écrira les commentaires Vorbis dans les fichiers FLAC quel que soit ce paramètre.

source: **Remove APEv2 tags from MP3 files**
ca: **Suprimeix les etiquetes APEv2 dels fitxers MP3**
fr: **Supprimer les balises APEv2 des fichiers MP3**

source: Check to remove APEv2 tags from MP3 files – ID3 is recommended for MP3 files. Picard will write ID3 tags to MP3 files regardless of this setting.
ca: Marqueu aquesta opció per a suprimir les etiquetes APEv2 dels fitxers MP3; es recomana ID3 per als fitxers MP3. Picard escriurà etiquetes ID3 als fitxers MP3 independentment d'aquest paràmetre.
fr: Cochez pour supprimer les balises APEv2 des fichiers MP3 - ID3 est recommandé pour les fichiers MP3. Picard écrira les balises ID3 sur les fichiers MP3 quel que soit ce paramètre.

source: **Fix missing seekpoints for FLAC files**
ca: **Corregeix els punts de cerca absents en els fitxers FLAC**
fr: **Réparation des seekpoints manquants pour les fichiers FLAC**

source: Some software has issues handling FLAC files that have an empty seek table metadata block. When this option is enabled empty and hence unused seek table blocks will be removed from the files on saving.
ca: Alguns programes tenen problemes amb els fitxers FLAC amb un bloc de metadades de taula de cerca buit. Quan habiliteu aquesta opció, se suprimiran els blocs de taula de cerca buits (i, per tant, sense ús) dels fitxers en desar-los.
fr: Certains logiciels ont des difficultés à gérer les fichiers FLAC qui ont un bloc de métadonnées de table de recherche vide. Lorsque cette option est activée, les blocs de table de recherche vides et donc inutilisés seront supprimés des fichiers lors de l'enregistrement.

source: **Preserve these tags from being cleared or overwritten with MusicBrainz data**
ca: ^Impedeix que aquestes etiquetes s'esborrin o siguin reemplaçades per dades de MusicBrainz**
fr: **Empêchez ces balises d'être effacées ou écrasées par les données MusicBrainz**

source: This is an advanced option: If you have tags which you need to preserve, enter their names here to stop Picard from overwriting them.
ca: Això és una opció avançada: si hi ha etiquetes que voleu preservar, indiqueu-ne el nom aquí perquè Picard deixi de sobreescriure-les.
fr: Ceci est une option avancée : si vous avez des balises que vous devez conserver, entrez leurs noms ici pour empêcher Picard de les écraser.
