Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_interface.po
Languages: ca, fr, pt_br

source: :index:`User Interface Options <pair: configuration; user interface>`
ca: :index:`Opcions de la interfície d'usuari <pair: configuració; interfície d'usuari>`
fr: :index:`Options de l'interface utilisateur <pair: configuration; interface utilisateur>`
pt_br: :Index:`Opções da Interface do Usuário <pair: configuration; user interface>`

source: If this option is disabled, the text labels under the icons in the toolbar will not be displayed, causing the toolbar to appear a little smaller.
ca: Si aquesta opció està inhabilitada, no es mostraran les etiquetes de text sota les icones de la barra d'eines, de manera que la barra d'eines serà una mica més petita.
fr: Si cette option est désactivée, les étiquettes de texte sous les icônes de la barre d'outils ne seront pas affichées, ce qui fait que la barre d'outils apparaîtra un peu plus petite.
pt_br: Se esta opção estiver desabilitada, as legendas abaixo dos ícones da barra de ferramenta não serão mostradas, fazendo com que a barra seja menos espaçosa.

source: **Show icons in menus**
ca: **Mostra icones als menús**
fr: **Afficher les icônes dans les menus**

source: Some users prefer to disable menu icons, which is the default behavior for macOS systems. This option allows the user to select whether the icons are displayed in the menus.
ca: Alguns usuaris prefereixen inhabilitar les icones dels menús, que és el comportament per defecte en sistemes macOS. Aquesta opció permet a l'usuari seleccionar si s'han de mostrar les icones als menús.
fr: Certains utilisateurs préfèrent désactiver les icônes de menu, ce qui est le comportement par défaut des systèmes macOS. Cette option permet à l'utilisateur de choisir si les icônes sont affichées dans les menus.

source: **User interface language**
ca: **Llengua de la interfície d'usuari**
fr: **Langue de l'interface utilisateur**
pt_br: **Linguagem da interface do usuário**

source: By default, Picard will display in the language displayed by your operating system, however you can override this and select a different language if needed.
ca: Per defecte, Picard es mostrarà en la llengua del sistema operatiu, però podeu canviar aquest comportament i seleccionar una llengua diferent si cal.
fr: Par défaut, Picard s'affichera dans la langue affichée par votre système d'exploitation, mais vous pouvez le remplacer et sélectionner une autre langue si nécessaire.
pt_br: Por padrão, o Picard usa a língua do seu sistema operacional, porém você pode escolher uma outra linguagem se achar necessário.

source: **User interface color theme**
ca: **Tema de color de la interfície d'usuari**
fr: **Thème de couleurs de l'interface utilisateur**
pt_br: **Tema de cores da interface do usuário**

source: This option allows the user to select the color theme used by Picard. On macOS and Windows systems, the available choices are:
ca: Aquesta opció permet a l'usuari seleccionar el tema de colors que fa servir Picard. En sistemes macOS i Windows, les opcions disponibles són:
fr: Cette option permet à l'utilisateur de sélectionner le thème de couleurs utilisé par Picard. Sur les systèmes macOS et Windows, les choix disponibles sont les suivants:
pt_br: Esta opção permite que o usuário selecione o tema de cores usado pelo Picard. No macOS e no Windows, as opções disponíveis são:

source: Default - The default color scheme based on the operating system display settings.
ca: Per defecte: esquema de colors per defecte basat en els paràmetres d'aparença del sistema operatiu.
fr: Défaut - Le schéma de couleurs par défaut basé sur les paramètres d'affichage du système d'exploitation.
pt_br: Padrão - O tema padrão baseado nas configurações do sistema.

source: Light - A light display theme.
ca: Clar: un tema clar.
fr: Light - Un thème d'affichage lumineux.
pt_br: Claro - O tema claro.

source: Dark - A dark display theme.
ca: Fosc: un tema fosc.
fr: Dark - Un thème d'affichage sombre.
pt_br: Escuro - O tema escuro.

source: The colors for the light and dark themes can be customized in the :doc:`options_interface_colors` section. Separate sets of color selections are maintained for the light and dark themes. The colors for the currently displayed theme are the ones displayed for editing.
ca: Els colors dels temes clar i fosc es poden personalitzar a la secció :doc:`options_interface_colors`. Es mantenen seleccions de colors independents per als temes clar i fosc. Els colors del tema que es mostra actualment són els que es mostren per a l'edició.
fr: Les couleurs des thèmes clair et foncé peuvent être personnalisées dans la section :doc:`options_interface_colors`. Des ensembles distincts de sélections de couleurs sont gérés pour les thèmes clairs et foncés. Les couleurs du thème actuellement affiché sont celles qui sont affichées pour l'édition.

source: **Allow selection of multiple directories**
ca: **Permet la selecció de diversos directoris**
fr: **Autoriser la sélection de plusieurs répertoires**
pt_br: **Permitir a seleção de múltiplos diretórios**

source: Enabling this option will bypass the native directory selector and use Qt's file dialog. This may be desirable since the native directory selector generally doesn't allow you to select more than one directory. This applies to the :menuselection:`"File --> Add folder"` dialog. The file browser always allows multiple directory selection.
ca: Si habiliteu aquesta opció, s'ignorarà el selector de directoris natiu i es farà servir el diàleg de fitxers del Qt. Això pot ser desitjable, ja que el selector de directoris natiu no permet seleccionar més d'un directori. Això s'aplica al diàleg :menuselection:`«Fitxer --> Afegeix una carpeta»`. L'explorador de fitxers sempre permet seleccionar diversos directoris.
fr: L'activation de cette option contournera le sélecteur de répertoire natif et utilisera la boîte de dialogue de fichier de Qt. Cela peut être souhaitable car le sélecteur de répertoire natif ne vous permet généralement pas de sélectionner plus d'un répertoire. Ceci s'applique à la boîte de dialogue :menuselection:`"Fichier --> Ajouter un dossier"`. Le navigateur de fichiers permet toujours la sélection de plusieurs répertoires.

source: When enabling the multiple directories option setting Picard will no longer use the system file picker for selecting directories. This may result in reduced functionality.
ca: Si habiliteu l'opció de diversos directoris, Picard ja no farà servir el selector de fitxers del sistema per a seleccionar directoris. Això pot reduir la funcionalitat.
fr: Lors de l'activation de l'option des répertoires multiples, Picard n'utilisera plus le sélecteur de fichiers du système pour sélectionner les répertoires. Cela peut entraîner une réduction des fonctionnalités.

source: **Use built-in search rather than looking in browser**
ca: **Fes servir la cerca incorporada en comptes de la cerca al navegador**
fr: **Utilisez la recherche intégrée plutôt que de rechercher dans le navigateur**
pt_br: **Usar busca integrada ao invés de buscar no navegador**

source: When this option is enabled the search for albums, artists or tracks will show the results in a dialog. By default this option is enabled. If this option is disabled Picard will open a search on MusicBrainz.org in your default web browser.
ca: Quan aquesta opció està habilitada, la cerca d'àlbums, artistes o pistes mostrarà els resultats en un diàleg. Aquesta opció està habilitada per defecte. Si inhabiliteu aquesta opció, Picard obrirà una cerca a MusicBrainz.org al navegador per defecte.
fr: Lorsque cette option est activée, la recherche d'albums, d'artistes ou de pistes affichera les résultats dans une boîte de dialogue. Par défaut, cette option est activée. Si cette option est désactivée, Picard ouvrira une recherche sur MusicBrainz.org dans votre navigateur Web par défaut.
pt_br: Quando esta opção está habilitada, a busca por álbuns, artistas ou trilhas serão mostradas numa janela. Se esta opção estiver desabilitada, Picard continuará a busca no MusicBrainz.org utilizando seu navegador padrão.

source: **Use advanced query syntax**
ca: **Fes servir la sintaxi de consulta avançada**
fr: **Utilisez la syntaxe de requête avancée**
pt_br: **Usar sintaxe de busca avançada**

source: This will enable advanced query syntax parsing on your searches. This only applies to the search box at the top right of Picard, not the lookup buttons.
ca: Això habilitarà la sintaxi de consulta avançada a les cerques. Només s'aplica al quadre de cerca a la cantonada superior dreta de Picard, no als botons de cerca.
fr: Cela activera l'analyse de la syntaxe de requête avancée sur vos recherches. Cela s'applique uniquement à la zone de recherche en haut à droite de Picard, pas aux boutons de recherche.
pt_br: Isto habilitará o processamento da sintaxe de busca avançada em suas buscas. Isto só se aplica à caixa de busca na lateral superior direita do Picard, e não aos botões de busca.

source: **Show the new user dialog when starting Picard**
ca: **Mostra el diàleg d'usuari nou en iniciar Picard**
fr: **Afficher le dialogue nouvel utilisateur au démarrage de Picard**

source: When this is enabled, Picard will show a dialog intended for new users when you start the program. This displays a warning about the consequences of saving files, along with a suggestion for minimizing the impact until you have confirmed that your configuration produces the expected results. It also provides a link to the on-line documentation.
ca: Si ho habiliteu, Picard mostrarà un diàleg per als usuaris nous quan inicieu el programa. Es mostra un avís sobre les conseqüències de desar els fitxers i un suggeriment per a minimitzar l'impacte fins que hàgiu confirmat que la configuració produeix els resultats esperats. També proporciona un enllaç a la documentació en línia.
fr: Lorsque cette option est activée, Picard affiche une boîte de dialogue destinée aux nouveaux utilisateurs lorsque vous démarrez le programme. Cette boîte de dialogue affiche un avertissement sur les conséquences de l'enregistrement des fichiers, ainsi qu'une suggestion pour minimiser l'impact jusqu'à ce que vous ayez confirmé que votre configuration produit les résultats escomptés. Il fournit également un lien vers la documentation en ligne.

source: **Show a quit confirmation dialog for unsaved changes**
ca: **Mostra una confirmació en sortir si hi ha canvis sense desar**
fr: **Afficher une boîte de dialogue de confirmation de fermeture pour les modifications non enregistrées**
pt_br: **Mostrar janela de confirmação do fechamento para mudanças não salvas**

source: When this is enabled, Picard will show a dialog when you try to quit the program with unsaved files loaded. This may help prevent accidentally losing tag changes you've made, but not yet saved.
ca: Si ho habiliteu, Picard mostrarà un diàleg quan intenteu sortir del programa amb fitxers sense desar carregats. Això pot impedir que perdeu per accident els canvis que heu fet a les etiquetes, però que encara no heu desat.
fr: Lorsque cela est activé, Picard affichera une boîte de dialogue lorsque vous essayez de quitter le programme avec des fichiers non enregistrés chargés. Cela peut aider à éviter de perdre accidentellement les modifications de balises que vous avez apportées, mais pas encore enregistrées.
pt_br: Quando habilitado, o Picard mostrará uma janela ao tentar fechar o programa com arquivos modificados não salvos. Isto é feito para evitar que etiquetas modificadas por você sejam perdidas.

source: **Show a confirmation dialog when saving files**
ca: **Mostra un diàleg de confirmació en desar els fitxers**
fr: **Afficher une boîte de dialogue de confirmation lors de l'enregistrement des fichiers**

source: When this is enabled, Picard will show a dialog when you save files, indicating what actions will be performed on the files and the number of files to be saved. This may help prevent accidentally making changes that you are not expecting.
ca: Si ho habiliteu, Picard mostrarà un diàleg quan deseu els fitxers indicant quines accions s'aplicaran als fitxers i el nombre de fitxers que es desaran. Això pot ajudar a impedir canvis accidentals inesperats.
fr: Lorsque cette option est activée, Picard affiche une boîte de dialogue lorsque vous enregistrez des fichiers, indiquant les actions qui seront effectuées sur les fichiers et le nombre de fichiers à enregistrer. Cela peut permettre d'éviter d'effectuer accidentellement des modifications auxquelles vous ne vous attendiez pas.

source: **Adjust horizontal position in file browser automatically**
ca: **Ajusta la posició horitzontal a l'explorador de fitxers automàticament**
fr: **Ajustement automatique de la position horizontale dans le navigateur de fichiers**

source: When this is enabled, Picard will automatically scroll the file browser display to keep relevant content visible.
ca: Si ho habiliteu, Picard desplaçarà automàticament l'explorador de fitxers perquè el contingut rellevant es mantingui visible.
fr: Lorsque cette option est activée, Picard fera automatiquement défiler l'affichage du navigateur de fichiers pour que le contenu pertinent reste visible.

source: **Begin browsing in the following directory**
ca: **Inicia l'exploració al directori següent**
fr: **Commencez à naviguer dans le répertoire suivant**
pt_br: **Comece a navegar no seguinte diretório**

source: By default, Picard remembers the last directory used to load files. If you enable this option and provide a directory, Picard will always start in the directory provided.
ca: Per defecte, Picard recorda el darrer directori des d'on s'han carregat fitxers. Si habiliteu aquesta opció i proporcioneu un directori, Picard sempre s'iniciarà al directori proporcionat.
fr: Par défaut, Picard se souvient du dernier répertoire utilisé pour charger les fichiers. Si vous activez cette option et fournissez un répertoire, Picard démarrera toujours dans le répertoire fourni.
pt_br: Por padrão, o Picard se lembra do último diretório usado para carregar arquivos. Se habilitar esta opção e fornecer um diretório, o Picard sempre iniciará por lá.

source: **Show text labels under icon**
pt_br: **Mostrar legenda abaixo dos ícones**

source: On Linux and similar operating systems, the available choices are:
pt_br: Em sistemas Linux ou similares, as opções disponíveis são:

source: System - The Qt5 theme configured in the desktop environment.
pt_br: Sistema - Tema Qt5 configurado pelo ambiente do sistema operacional.

source: The colors for the light and dark themes can be customized in the :doc:`options_interface_colors` section. Separate sets of color selections are maintained for the light and dark themes. The colors for the currently displayed theme are the ones displayed for editing.
pt_br: As cores para os temas claro e escuro podem ser penalizados na seção :doc:`options_interface_colors`. Diferentes conjuntos de cores são mantidas para os temas claro e escuro. As cores disponíveis para modificação modificarão o tema atual.

source: Enabling this option will bypass the native directory selector and use Qt's file dialog. This may be desirable since the native directory selector generally doesn't allow you to select more than one directory. This applies to the :menuselection:`"File --> Add folder"` dialog. The file browser always allows multiple directory selection.
pt_br: Habilitando está opção, o seletor de pastas nativo é substituído pelo seletor do Qt. Pode ser preferível por permitir a seleção de múltiplos diretórios simultaneamente. Isto se aplica apenas à janela aberta por :menuselection:`"Arquivo --> Adicionar Pasta"`. O painel navegador de arquivos sempre permite seleção múltipla.
