Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_filerenaming_compat.po
Languages: ca, fr

source: :index:`File Naming Compatibility Options <pair: configuration; file naming compatibility>`
ca: :index:`Opcions de compatibilitat de nom dels fitxers <pair: configuració; compatibilitat de nom dels fitxers>`
fr: :index:`Options de compatibilité des noms de fichiers <pair: configuration; compatibilité des noms de fichiers>`

source: These options determine how Picard handles compatibility of files when they are saved with updated metadata.
ca: Aquestes opcions determinen com Picard gestiona la compatibilitat dels fitxers quan es desen amb metadades actualitzades.
fr: Ces options déterminent comment Picard gère la compatibilité des fichiers lorsqu'ils sont enregistrés avec des métadonnées mises à jour.

source: **Replace non-ASCII characters**
ca: **Substitueix els caràcters no ASCII**
fr: **Remplacer les caractères non-ASCII**

source: Select this option to replace non-ASCII characters with their ASCII equivalent (e.g.: 'á', 'ä' and 'ǎ' with 'a'; 'é', 'ě' and 'ë' with 'e'; 'æ' with "ae"). More information regarding ASCII characters can be found on `Wikipedia <https://en.wikipedia.org/wiki/ASCII>`_.
ca: Seleccioneu aquesta opció per a substituir els caràcters no ASCII amb l'equivalent ASCII (per exemple, «á», «ä» i «ǎ» per «a»; «é», «ě» i «ë» per «e»; «æ» per «ae»). Podeu trobar més informació sobre els caràcters ASCII a la `Viquipèdia <https://ca.wikipedia.org/wiki/ASCII>`_.
fr: Sélectionnez cette option pour remplacer les caractères non ASCII par leur équivalent ASCII (par exemple : "á", "ä" et "ǎ" par "a"; "é", "ě" et "ë" par "e"; "æ" par "ae"). Vous trouverez de plus amples informations sur les caractères ASCII sur `Wikipedia <https://fr.wikipedia.org/wiki/American_Standard_Code_for_Information_Interchange>`_.

source: **Windows compatibility**
ca: **Compatibilitat amb el Windows**
fr: **Compatibilité avec Windows**

source: This option tells Picard to replace all Windows-incompatible characters with an underscore. This is enabled by default on Windows systems, with no option to disable.
ca: Aquesta opció indica a Picard que substitueixi tots els caràcters incompatibles amb el Windows per una ratlla baixa. Està habilitat per defecte en els sistemes Windows, sense opció per a inhabilitar-ho.
fr: Cette option indique à Picard de remplacer tous les caractères incompatibles avec Windows par un underscore. Cette option est activée par défaut sur les systèmes Windows, sans possibilité de la désactiver.

source: As of version 2.9 Picard allows the user to specify what replacement characters to use as replacements for selected characters.
ca: A partir de la versió 2.9 de Picard, es permet a l'usuari especificar quins caràcters de substitució es faran servir per als caràcters seleccionats.
fr: Depuis la version 2.9, Picard permet à l'utilisateur de spécifier les caractères de remplacement à utiliser pour remplacer les caractères sélectionnés.

source: **Allow paths longer than 259 characters**
ca: **Permet els camins de més de 259 caràcters**
fr: **Autoriser les chemins d'accès de plus de 259 caractères**

source: This option allows the user to disable the 259 character path limit Picard would usually enforce in Windows compatibility mode when renaming and/or moving files. This is possible both on Windows and on other platforms with Windows compatibility enabled.
ca: Aquesta opció permet a l'usuari inhabilitar el límit de 259 caràcters als camins que Picard aplicaria normalment en el mode de compatibilitat amb el Windows en canviar el nom dels fitxers o moure'ls. Això és possible tant al Windows com en altres plataformes amb la compatibilitat amb el Windows habilitada.
fr: Cette option permet à l'utilisateur de désactiver la limite du chemin d'accès de 259 caractères que Picard applique habituellement en mode de compatibilité Windows lors du renommage et/ou du déplacement de fichiers. Ceci est possible à la fois sous Windows et sur d'autres plateformes avec la compatibilité Windows activée.

source: Enabling long paths on Windows might cause files being saved with path names exceeding the 259 character limit traditionally imposed by the Windows API. Some software might not be able to properly access those files. In particular Windows Explorer cannot rename files with long path names or create new files inside folders if the resulting path length would exceed the length limit.
ca: Habilitar els camins llargs al Windows pot fer que es desin fitxers amb noms que superin el límit de 259 caràcters imposat tradicionalment per l'API del Windows. És possible que algunes eines de programari no puguin accedir correctament a aquests fitxers. En concret, l'Explorador del Windows no pot canviar el nom dels fitxers amb un nom llarg ni crear fitxers nous en carpetes si la longitud del camí resultant supera el límit.
fr: L'activation des chemins d'accès longs sous Windows peut entraîner l'enregistrement de fichiers dont les noms de chemin d'accès dépassent la limite de 259 caractères traditionnellement imposée par l'API Windows. Certains logiciels pourraient ne pas être en mesure d'accéder correctement à ces fichiers. En particulier, l'Explorateur Windows ne peut pas renommer les fichiers avec des noms de chemin longs ou créer de nouveaux fichiers à l'intérieur des dossiers si la longueur du chemin résultant dépasse la limite de longueur.

source: **Replace spaces with underscores**
ca: **Substitueix els espais per ratlles baixes**
fr: **Remplacer les espaces par des caractères de soulignement**

source: When enabled, this option directs Picard to replace all spaces with underscores in the file path and name generated by the selected file naming script.
ca: Si l'habiliteu, aquesta opció indica a Picard que substitueixi tots els espais per ratlles baixes en el camí i el nom del fitxer generats per l'script de nom dels fitxers seleccionats.
fr: Lorsqu'elle est activée, cette option indique à Picard de remplacer tous les espaces par des caractères de soulignement dans le chemin d'accès et le nom du fichier générés par le script de dénomination de fichier sélectionné.

source: **Replace directory separators with**
ca: **Substitueix els separadors de directoris per**
fr: **Remplacer les séparateurs de répertoire par**

source: By default Picard will replace any path separators (slash or backslash) with an underscore when using a tag or variable value as part of the file path and name generated by the selected file naming script. This option allows the user to set a different replacement character other than the underscore.
ca: Per defecte, Picard substituirà qualsevol separador de camí (barra inclinada o barra inclinada inversa) per una ratlla baixa si es fa servir una etiqueta o el valor d'una variable com a part del camí i el nom d'un fitxer generat per l'script de nom dels fitxers seleccionat. Aquesta opció permet a l'usuari definir un caràcter de substitució diferent de la ratlla baixa.
fr: Par défaut, Picard remplacera tout séparateur de chemin (slash ou backslash) par un trait de soulignement lorsqu'il utilisera une balise ou une valeur variable comme partie du chemin et du nom du fichier généré par le script de nommage de fichier sélectionné. Cette option permet à l'utilisateur de définir un caractère de remplacement différent de l'underscore.
