Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_interface_toolbar.po
Languages: fr

source: :index:`Toolbar <configuration; toolbar, user interface; toolbar>`
fr: :index:`Barre d'outils <configuration; barre d'outils, interface utilisateur; barre d'outils>`

source: This allows you to to add, remove or rearrange the items displayed in the Action Toolbar.
fr: Cette fonction vous permet d'ajouter, de supprimer ou de réorganiser les éléments affichés dans la Barre d'outils d'action.

source: **Customize Action Toolbar**
fr: **Personnaliser la barre d'outils d'action**

source: Items that can be included in the toolbar include:
fr: Les éléments qui peuvent être inclus dans la barre d'outils sont les suivants :

source: Add Files
fr: Ajouter des fichiers

source: Add Folder
fr: Ajouter un dossier

source: Generate Fingerprints
fr: Générer des empreintes digitales

source: Lookup
fr: Consulter le site

source: Lookup CD...
fr: Rechercher un CD...

source: Lookup in Browser
fr: Recherche dans le navigateur

source: Open in Player
fr: Ouvrir dans le lecteur

source: Parse File Names...
fr: Analyser les noms de fichiers...

source: Remove
fr: Retirer

source: Save
fr: Sauvez

source: Scan
fr: Scanner

source: Submit AcoustIDs
fr: Soumettre des AcoustIDs

source: In addition, separators can be added to allow grouping of items.
fr: En outre, des séparateurs peuvent être ajoutés pour permettre le regroupement des éléments.
