Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_advanced.po
Languages: ca, fr

source: :index:`Advanced Options <configuration; advanced options>`
ca: :index:`Opcions avançades <configuració; opcions avançades>`
fr: :index:`Options avancées <configuration; options avancées>`

source: **Ignore file paths matching the following regular expression**
ca: **Ignora els camins de fitxers que coincideixin amb l'expressió regular següent**
fr: **Ignorer les chemins de fichiers correspondant à l'expression régulière suivante**

source: You can specify patterns for files and directories that Picard should never load. For example, if you set this to the regular expression ``\.bak$`` any file ending in ".bak" will be ignored when loading files.
ca: Podeu especificar patrons de fitxers i directoris que Picard no ha de carregar mai. Per exemple, si aquí indiqueu l'expressió regular ``\.bak$``, qualsevol fitxer que acabi en «.bak» s'ignorarà en carregar els fitxers.
fr: Vous pouvez spécifier des modèles pour les fichiers et répertoires que Picard ne doit jamais charger. Par exemple, si vous définissez ceci sur l'expression régulière ``\.bak$`` tout fichier se terminant par ".bak" sera ignoré lors du chargement des fichiers.

source: **Ignore hidden files**
ca: **Ignora els fitxers ocults**
fr: **Ignorer les fichiers cachés**

source: If this option is enabled then hidden files and directories will not be loaded. This also includes any file or subdirectory inside a hidden directory.
ca: Si aquesta opció està habilitada, no es carregaran els fitxers i directoris ocults. Això també inclou qualsevol fitxer o subdirectori dins d'un directori ocult.
fr: Si cette option est activée, les fichiers et répertoires cachés ne seront pas chargés. Cela inclut également tout fichier ou sous-répertoire dans un répertoire caché.

source: **Include sub-folders when adding files from folders**
ca: **Inclou les subcarpetes en afegir els fitxers de les carpetes**
fr: **Inclure les sous-dossiers lors de l'ajout de fichiers à partir de dossiers**

source: If this option is enabled Picard will load all audio files in the selected directory and all its subdirectories. If disabled only audio files in the selected directory will be loaded.
ca: Si aquesta opció està habilitada, Picard carregarà tots els fitxers d'àudio del directori seleccionat i tots els subdirectoris. Si està inhabilitada, només es carregaran els fitxers d'àudio del directori seleccionat.
fr: Si cette option est activée, Picard chargera tous les fichiers audio dans le répertoire sélectionné et tous ses sous-répertoires. Si elle est désactivée, seuls les fichiers audio du répertoire sélectionné seront chargés.

source: **Ignore track duration difference under this number of seconds**
ca: **Ignora les diferències de durada de les pistes inferiors a aquest nombre de segons**
fr: **Ignorer la différence de durée de la piste sous ce nombre de secondes**

source: This specifies the number of seconds that a file can differ in length from the length in the MusicBrainz database and still be considered to be the same. The default value is 2 seconds.
fr: Ceci spécifie le nombre de secondes pendant lesquelles un fichier peut différer en longueur de la longueur dans la base de données MusicBrainz et toujours être considéré comme identique. La valeur par défaut est de 2 secondes.

source: **Maximum number of entities to return per MusicBrainz query**
ca: **Nombre màxim d'entitats que es retornaran per consulta a MusicBrainz**
fr: **Nombre maximum d'entités à retourner par requête MusicBrainz**

source: This sets the maximum number of results returned for queries made to the MusicBrainz website. The default value is 50 results. On Picard v2.8.1 and earlier, this value was fixed at a maximum of 25 responses.
ca: Això defineix el nombre màxim de resultats que retornen les consultes enviades al lloc web de MusicBrainz. El valor per defecte és de 50 resultats. A Picard 2.8.1 i les versions anteriors, aquest valor tenia un valor màxim fix de 25 respostes.
fr: Ceci définit le nombre maximum de résultats renvoyés pour les requêtes effectuées sur le site Web de MusicBrainz. La valeur par défaut est de 50 résultats. Sur Picard v2.8.1 et antérieures, cette valeur était fixée à un maximum de 25 réponses.

source: **Ignore the following tracks when determining whether a release is complete**
ca: **Ignora les pistes següents a l'hora de determinar si una publicació està completa**
fr: **Ignorez les pistes suivantes pour déterminer si une version est terminée**

source: Missing tracks of the selected type (i.e.: video, pregap, data or silence) will be ignored when determining whether a release is considered to be complete. For example, if "video" is selected then a release with a bonus video will be marked as complete if it has all the audio tracks matched with a file even if the video file is missing.
ca: Les pistes que faltin del tipus seleccionat (vídeo, pregap, dades o silenci) s'ignoraran a l'hora de determinar si una publicació es considera completa. Per exemple, si seleccioneu «vídeo», una publicació amb un vídeo extra es marcarà com a completa si totes les pistes d'àudio coincideixen amb un fitxer encara que falti el fitxer de vídeo.
fr: Les pistes manquantes du type sélectionné (c'est-à-dire : vidéo, pré-séquence, données ou silence) seront ignorées lors de la détermination si une sortie est considérée comme terminée. Par exemple, si "vidéo" est sélectionné, une version avec une vidéo bonus sera marquée comme terminée si toutes les pistes audio correspondent à un fichier même si le fichier vidéo est manquant.

source: **Tags to ignore for comparison**
ca: **Etiquetes que s'ignoraran a les comparacions**
fr: **Balises à ignorer pour comparaison**

source: Tags in this list will not be considered when comparing the existing file metadata to the data retrieved from MusicBrainz. If the only difference between the file's metadata and the metadata retrieved from MusicBrainz is a tag listed in this ignore list then the file will be considered unmodified.
ca: Les etiquetes d'aquesta llista no es tindran en compte en comparar les metadades existents al fitxer amb les dades recuperades de MusicBrainz. Si l'única diferència entre les metadades del fitxer i les metadades recuperades de MusicBrainz és una etiqueta d'aquesta llista, es considerarà que no hi ha modificacions.
fr: Les balises de cette liste ne seront pas prises en compte lors de la comparaison des métadonnées de fichier existantes avec les données extraites de MusicBrainz. Si la seule différence entre les métadonnées du fichier et les métadonnées extraites de MusicBrainz est une balise répertoriée dans cette liste ignorée, le fichier sera considéré comme non modifié.

source: Details: :doc:`options_network` / :doc:`options_matching` / :doc:`options_maintenance`
fr: Détails: :doc:`options_network` / :doc:`options_matching` / :doc:`options_maintenance`

source: This specifies the number of seconds that a file can differ in length from the length in the MusicBrainz database and still be considered to be the same. The default value is 2 seconds.
ca: Això permet especificar la diferència en segons que pot haver-hi a la durada d'un fitxer en relació amb la durada a la base de dades de MusicBrainz perquè hi hagi una coincidència. El valor per defecte és de 2 segons.
