Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_general.po
Languages: fr

source: :index:`General Options <configuration; general options>`
fr: :index:`Options générales <configuration; options générales>`

source: **Server address**
fr: **Adresse du serveur**

source: The domain name for the MusicBrainz database server used by Picard to get details of your music. Default value: musicbrainz.org (for the main MusicBrainz server).
fr: Le nom de domaine du serveur de base de données MusicBrainz utilisé par Picard pour obtenir les détails de votre musique. Valeur par défaut : musicbrainz.org (pour le serveur principal MusicBrainz).

source: In addition to the standard MusicBrainz servers provided in the drop down list, you can manually enter an alternate address, such as "localhost" if you are running a local copy of the server. When an alternate server host name is entered, a warning will be displayed and you will be asked to confirm that you want to submit all data to this alternate server.
fr: En plus des serveurs MusicBrainz standard fournis dans la liste déroulante, vous pouvez entrer manuellement une adresse alternative, telle que "localhost" si vous exécutez une copie locale du serveur. Lorsqu'un nom d'hôte de serveur alternatif est saisi, un avertissement sera affiché et il vous sera demandé de confirmer que vous voulez soumettre toutes les données à ce serveur alternatif.

source: The port number for the server. Default value: 443 (for the main MusicBrainz server).
fr: Le numéro de port du serveur. Valeur par défaut: 80 (pour le serveur MusicBrainz principal).

source: **Username**
fr: **Nom d'utilisateur**

source: Your MusicBrainz website username, used to submit acoustic fingerprints, retrieve and save items to your collections, and retrieve personal folksonomy tags.
fr: Le nom d'utilisateur de votre site Web MusicBrainz, utilisé pour soumettre des empreintes acoustiques, récupérer et enregistrer des éléments dans vos collections et récupérer des balises personnelles de folksonomy.

source: **Password**
fr: **Mot de passe**

source: Your MusicBrainz website password.
fr: Le mot de passe de votre site Web MusicBrainz.

source: **Automatically scan all new files**
fr: **Analyser automatiquement tous les nouveaux fichiers**

source: Check this box if you want Picard to scan each music file you add and look for an :index:`AcoustID <pair: AcoustID; automatic scan>` fingerprint. This takes time, but may be helpful for you and MusicBrainz. Leave it unchecked if you don't want Picard to do this scan automatically. In any case, you can direct Picard to scan a particular music file at any time using :menuselection:`"Tools --> Scan"`. See also :ref:`ref_scan_files` and :ref:`ref_tutorial_acoustid`.
fr: Cochez cette case si vous voulez que Picard analyse chaque fichier musical que vous ajoutez et recherche une empreinte :index:`AcoustID <pair: AcoustID; scan automatique>` empreinte digitale. Cela prend du temps, mais peut être utile pour vous et MusicBrainz. Laissez cette case décochée si vous ne voulez pas que Picard fasse ce scan automatiquement. Dans tous les cas, vous pouvez demander à Picard de scanner un fichier musical particulier à tout moment en utilisant :menuselection:`"Outils --> Scan"`. Voir aussi :ref:`ref_scan_files` et :ref:`ref_tutorial_acoustid`.

source: **Automatically cluster all new files**
fr: **Automatiquement regrouper tous les nouveaux fichiers**

source: Check this box if you want Picard to automatically group all loaded files into album :index:`clusters <pair: cluster; automatic clustering>`. Leave it unchecked if you don't want Picard to do this automatically. In any case, you can direct Picard to cluster files any time using :menuselection:`"Tools --> Cluster"`. See also :ref:`ref_lookup_files`.
fr: Cochez cette case si vous voulez que Picard regroupe automatiquement tous les fichiers chargés dans l'album :index:`clusters <pair: cluster; regroupement automatique>`. Ne la cochez pas si vous ne voulez pas que Picard fasse cela automatiquement. Dans tous les cas, vous pouvez demander à Picard de regrouper les fichiers à tout moment en utilisant :menuselection:`"Outils --> Cluster"`. Voir aussi :ref:`ref_lookup_files`.

source: You can either enable "Automatically scan all new files" or "Automatically cluster all new files", but not both.
fr: Vous pouvez activer soit l'option "Analyser automatiquement tous les nouveaux fichiers", soit l'option "Regrouper automatiquement tous les nouveaux fichiers", mais pas les deux.

source: **Ignore MBIDs when loading new files**
fr: **Ignorer les MBID lors du chargement de nouveaux fichiers**

source: If you enable this option Picard will not use MusicBrainz identifiers (MBIDs) stored in the files to automatically load the corresponding MusicBrainz release and match the loaded file to the correct track. Leaving this option disabled is useful when re-processing files that have been previously tagged with incorrect information.
fr: Si vous activez cette option, Picard n'utilisera pas les identifiants MusicBrainz (MBID) stockés dans les fichiers pour charger automatiquement la version MusicBrainz correspondante et faire correspondre le fichier chargé à la piste correcte. Il est utile de laisser cette option désactivée lorsque vous retraitez des fichiers qui ont été précédemment balisés avec des informations incorrectes.

source: **Check for plugin updates during start-up**
fr: **Vérifier les mises à jour des plugins au démarrage**

source: This option determines whether or not Picard will automatically check for :index:`plugin updates <pair: configuration; plugin update checking>` during startup. If this is enabled and an update to an installed plugin is available, a popup message will be displayed.
fr: Cette option détermine si Picard vérifiera automatiquement la présence de :index:`mises à jour de plugins <pair: configuration; vérification des mises à jour de plugins>` lors du démarrage. Si cette option est activée et qu'une mise à jour d'un plugin installé est disponible, un message contextuel sera affiché.

source: **Check for program updates during start-up**
fr: **Vérifier les mises à jour du programme lors du démarrage**

source: This option determines whether or not Picard will automatically check for :index:`program updates <pair: configuration; program update checking>` during startup. In any case, you can have Picard check for program updates at any time using :menuselection:`"Help --> Check for update"`.
fr: Cette option détermine si Picard vérifiera automatiquement les :index:`mises à jour du programme <pair: configuration; vérification des mises à jour du programme>` lors du démarrage. Dans tous les cas, vous pouvez demander à Picard de vérifier les mises à jour de programmes à tout moment en utilisant :menuselection:`"Aide --> Vérifier la mise à jour"`.

source: **Days between checks**
fr: **Jours entre les chèques**

source: This option allows you to limit the automatic program update checking by selecting the interval, in days, between checks. Set this to 1 if you want to check daily, 7 for weekly checks, and so on. Note that this only applies if the "Check for program updates during start-up" option is enabled.
fr: Cette option vous permet de limiter la vérification automatique de la mise à jour du programme en sélectionnant l'intervalle, en jours, entre les vérifications. Réglez cette valeur sur 1 si vous souhaitez une vérification quotidienne, sur 7 pour une vérification hebdomadaire, et ainsi de suite. Notez que cette option ne s'applique que si l'option "Vérifier les mises à jour du programme au démarrage" est activée.

source: **Updates to check**
fr: **Mises à jour à vérifier**

source: This option allows you to select which levels of program update to check. Your options are:
fr: Cette option vous permet de sélectionner les niveaux de mise à jour du programme à vérifier. Les options disponibles sont les suivantes :

source: Stable releases only
fr: Versions stables uniquement

source: Stable and Beta releases
fr: Versions stables et bêta

source: Stable, Beta and Dev releases
fr: Versions stables, bêta et dev

source: For example, if you subscribe to "Stable releases only" you will not be notified if a new Beta or Dev release is issued.
fr: Par exemple, si vous vous abonner à "Versions stables uniquement", vous ne serez pas averti si une nouvelle version bêta ou de développement est publiée.

source: The program update checking related settings and :menuselection:`"Help --> Check for update..."` command may not be available when Picard is distributed as a package. In that case, the user should check with the maintainer of the package to determine when an update is available.
fr: Les paramètres relatifs à la vérification des mises à jour du programme et la commande :menuselection:`"Aide --> Vérifier la mise à jour..."` peuvent ne pas être disponibles lorsque Picard est distribué sous forme de paquetage. Dans ce cas, l'utilisateur doit se renseigner auprès du responsable du paquetage pour savoir si une mise à jour est disponible.
