Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_interface_colors.po
Languages: ca, fr

source: :index:`Colors <configuration; colors, user interface; colors>`
ca: :index:`Colors <configuració; colors, interfície d'usuari; colors>`
fr: :index:`Couleurs <configuration; couleurs, interface utilisateur; couleurs>`

source: This section allows you to customize the various colors used in the Picard user interface. To change a color, simply click on the color block currently displayed for the desired text condition to bring up a selection dialog, then pick your desired color. The colors can be changed for the following text conditions:
ca: Aquesta secció us permet personalitzar els diferents colors que es fan servir a la interfície d'usuari de Picard. Per a canviar un color, només heu de fer clic en el bloc de color que es mostra actualment per a la condició de text desitjada. Això obre un quadre de diàleg de selecció, on podeu triar el color desitjat. Es poden canviar els colors de les condicions de text següents:
fr: Cette section vous permet de personnaliser les différentes couleurs utilisées dans l'interface utilisateur de Picard. Pour changer une couleur, cliquez simplement sur le bloc de couleur actuellement affiché pour la condition de texte souhaitée pour faire apparaître une boîte de dialogue de sélection, puis choisissez la couleur souhaitée. Les couleurs peuvent être modifiées pour les conditions de texte suivantes:

source: **Errored entity**: files and other elements with errors on loading or saving
ca: **Entitat amb errors**: fitxers o altres elements amb errors en carregar-los en desar-los
fr: **Entité erronée**: fichiers et autres éléments avec des erreurs de chargement ou d'enregistrement

source: **Pending entity**: files and other elements queued up for processing
ca: **Entitat pendent**: fitxers i altres elements a la cua de processament
fr: **Entité en attente**: fichiers et autres éléments mis en file d'attente pour traitement

source: **Saved entity**: successfully saved files
ca: **Entitat desada**: fitxers desats correctament
fr: **Entité enregistrée**: fichiers enregistrés avec succès

source: **Log view text (debug)**: debug messages in the Error/Debug Log
ca: **Text de la visualització de registre (depuració)**: missatges de depuració al registre d'errors/depuració
fr: **Texte de la vue du journal (débogage)**: messages de débogage dans le journal des erreurs / débogage

source: **Log view text (error)**: error messages in the Error/Debug Log
ca: **Text de la visualització de registre (error)**: missatges d'error al registre d'errors/depuració
fr: **Texte de la vue du journal (erreur)**: messages d'erreur dans le journal des erreurs / débogage

source: **Log view text (info)**: informational messages in the Error/Debug Log
ca: **Text de la visualització de registre (informació)**: missatges informatius al registre d'errors/depuració
fr: **Texte de la vue du journal (info)**: messages d'information dans le journal des erreurs / débogage

source: **Log view text (warning)**: warning messages in the Error/Debug Log
ca: **Text de la visualització de registre (avís)**: missatges d'avís al registre d'errors/depuració
fr: **Texte de la vue du journal (avertissement)**: messages d'avertissement dans le journal des erreurs / débogage

source: **Tag added**: newly added tags in the metadata pane
ca: **Etiqueta afegida**: etiquetes acabades d'afegir a la subfinestra de metadades
fr: **Balise ajoutée**: nouvelles balises ajoutées dans le volet des métadonnées

source: **Tag changed**: changed tags in the metadata pane
ca: **Etiqueta canviada**: etiquetes canviades a la subfinestra de metadades
fr: **Balise modifiée**: balises modifiées dans le volet des métadonnées

source: **Tag removed**: removed tags in the metadata pane
ca: **Etiqueta suprimida**: etiquetes suprimides a la subfinestra de metadades
fr: **Balise supprimée**: balises supprimées dans le volet des métadonnées

source: Separate sets of color selections are maintained for the light and dark themes. The colors for the currently displayed theme are the ones displayed for editing.
ca: Es mantenen grups de colors seleccionats diferents per als temes clar i fosc. Els colors que es mostren per a l'edició són els del tema visible actualment.
fr: Des ensembles distincts de sélections de couleurs sont gérés pour les thèmes clairs et foncés. Les couleurs du thème actuellement affiché sont celles qui sont affichées pour l'édition.
