Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/config/options_network.po
Languages: ca

source: :index:`Network <configuration; network>`
ca: :index:`Xarxa <configuració; xarxa>`

source: **Web Proxy**
ca: **Servidor intermediari**

source: If you need a proxy to make an outside network connection you may specify one here. You can choose between HTTP and SOCKS proxy. The required settings are **Server Address** and **Port**. If the proxy requires authentication also enter **Username** and **Password**.
ca: Si necessiteu un servidor intermediari per a establir una connexió de xarxa amb l'exterior, aquí el podeu especificar. Podeu triar entre un servidor intermediari HTTP i SOCKS. Els paràmetres obligatoris són **Adreça del servidor** i **Port**. Si el servidor intermediari requereix autenticació, també heu d'emplenar **Nom d'usuari** i **Contrasenya**.

source: **Request timeout in seconds**
ca: **Temps d'espera de les sol·licituds en segons**

source: By default Picard will abort running network requests after 30 seconds of inactivity. If needed you can change the timeout period here.
ca: Per defecte, Picard anul·larà les sol·licituds de xarxa en curs després de 30 segons d'inactivitat. Si cal, podeu canviar el temps d'espera aquí.

source: **Browser Integration**
ca: **Integració amb el navegador**

source: The browser integration allows you to load releases and recordings into Picard directly from the MusicBrainz website. Once you have opened musicbrainz.org in your browser from Picard, the website will show the green tagger button |lookup_tagger| next to releases and recordings. Clicking on this button will load the corresponding release or recording into Picard.
ca: La integració amb el navegador us permet carregar publicacions i enregistraments a Picard directament des del lloc web de MusicBrainz. Quan hàgiu obert musicbrainz.org al navegador des de Picard, el lloc web mostrarà el botó verd d'etiquetatge |lookup_tagger| al costat de les publicacions i els enregistraments. Si feu clic en aquest botó, es carregarà la publicació o l'enregistrament corresponent a Picard.

source: **Default listening port**
ca: **Port d'escolta per defecte**

source: This identifies the default port Picard will listen on for the browser integration. If the port is not available Picard will try to increase the port number by one until it finds a free port.
ca: Identifica el port d'escolta per defecte de Picard per a la integració amb el navegador. Si el port no està disponible, Picard intentarà incrementar el número de port d'un en un fins que trobi un port lliure.

source: **Listen only on localhost**
ca: **Escolta només localhost**

source: By default Picard will limit access to the browser integration port to your local machine. Deactivating this option will expose the port on your network, allowing you to request Picard to load a specific release or recording via the network. For example, this would be used for the `Picard Barcode Scanner <https://play.google.com/store/apps/details?id=org.musicbrainz.picard.barcodescanner>`_ Android app.
ca: Per defecte, Picard limitarà l'accés al port d'integració amb el navegador de l'ordinador local. Si desactiveu aquesta opció, s'exposarà el port a la xarxa, la qual cosa us permetrà demanar a Picard que carregui una publicació o enregistrament específic a través de la xarxa. Per exemple, es podria fer servir per a l'aplicació d'Android `Lector de codis de Picard <https://play.google.com/store/apps/details?id=org.musicbrainz.picard.barcodescanner>`_.

source: Only expose the port externally when you actually need it and only on networks you trust. Exposing application ports via the network can open potential security holes on your system.
ca: Exposeu el port externament només quan realment el necessiteu i només en xarxes de confiança. Exposar ports d'aplicacions a través de la xarxa pot obrir possibles forats de seguretat al sistema.
