Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/usage/attach_disc_*.po
Languages: id

source: :index:`Attaching a Disc ID to a Release <disc id; attaching>`
id: :index:`Joindre un ID de disque à une parution <id de disque; attacher>`

source: Disc IDs are very useful for identifying CDs and allowing MusicBrainz to know the length of tracks on a CD. Thus, it is very valuable to add them when submitting a new CD release or when you have a CD release that does not have a Disc ID attached.
id: Les ID de disque sont très utiles pour identifier les CD et permettre à MusicBrainz de connaître la longueur des pistes d'un CD. Ainsi, il est très utile de les ajouter lors de la soumission d'une nouvelle parution CD ou lorsque vous avez une parution CD qui n'a pas d'identifiant de disque attaché.

source: Please do not add DiscIDs from CDs that are burned at home.
id: Veuillez ne pas ajouter de DiscID à partir de CD gravés à la maison.

source: There is also a :doc:`Video Tutorial </tutorials/v_attach_disc_id>` available which demonstrates how to attach a disc id to a release in MusicBrainz.
id: Il existe également un :doc:`Tutoriel vidéo </tutorials/v_attach_disc_id>` qui montre comment attacher un numéro de disque à une sortie dans MusicBrainz.

source: The steps to follow to submit a disc id are:
id: Les étapes à suivre pour soumettre un identifiant de disque sont:

source: **1. Lookup the CD**
id: **1. Recherchez le CD**

source: Make sure the CD is inserted in the drive, and select :menuselection:`"Tools --> Lookup CD... --> (drive to use)"`. The CD toc will be calculated and sent to MusicBrainz. Alternately, you can use an EAC, XLD or Whipper ripper log file to lookup the CD using the :menuselection:`"Tools --> Lookup CD --> From EAC / XLD / Whipper log file..."` command. This will open a file browser dialog to allow you to select the log file to process. Either method will query the MusicBrainz database and display a list of matching releases.
id: Assurez-vous que le CD est inséré dans le lecteur, et sélectionnez :menuselection:`"Outils --> CD de recherche... --> (l'entraînement à utiliser)"`. Le toc du CD sera calculé et envoyé à MusicBrainz. Vous pouvez également utiliser un fichier journal de ripper EAC, XLD ou Whipper pour rechercher le CD en utilisant la commande :menuselection:`"Outils --> CD de recherche... --> A partir du fichier journal EAC / XLD / Whipper..."`. Cela ouvrira une boîte de dialogue de recherche de fichiers pour vous permettre de sélectionner le fichier journal à traiter. L'une ou l'autre méthode interrogera la base de données MusicBrainz et affichera une liste des sorties correspondantes.

source: **2. Review list of matching releases**
id: **2. Examiner la liste des communiqués correspondants**

source: If the target release appears in this list, the disc id has already been attached and you do not need to do anything further. If there are no matches found or the desired target release does not appear in the list, use the :menuselection:`"Submit disc ID"` option to locate the correct release. Enter the release title or artist and initiate the search. You will be provided with a list of the releases that match your search criterion and have the same number of tracks as your CD TOC.
id: Si la parution cible apparaît dans cette liste, l'ID du disque a déjà été joint et vous n'avez rien d'autre à faire. Si aucune correspondance n'est trouvée ou si la version cible souhaitée n'apparaît pas dans la liste, utilisez l'option :menuselection:`"Soumettre l'ID du disque"` pour localiser la parution correcte. Entrez le titre de la sortie ou l'artiste et lancez la recherche. Vous recevrez une liste des sorties qui correspondent à votre critère de recherche et qui ont le même nombre de pistes que votre CD TOC.

source: If you search by artist, use the radio button next to the artist's name to select the desired artist. If you click on the artist's name link, you will not be allowed to attach the disc id to any of the releases displayed.
id: Si vous recherchez par artiste, utilisez le bouton radio à côté du nom de l'artiste pour sélectionner l'artiste souhaité. Si vous cliquez sur le lien du nom de l'artiste, vous ne serez pas autorisé à joindre l'identifiant du disque à l'une des parutions affichées.

source: **3. Select the release**
id: **3. Sélectionnez le communiqué**

source: Select the desired target release frm the list displayed by clicking the radio button next to the release, and then click the "Attach CD TOC" button below the list of releases. This will prepare an edit to attach the disc id to the release. You then need to add an appropriate edit note, and submit the edit.
id: Sélectionnez la version cible souhaitée dans la liste affichée en cliquant sur le bouton radio à côté de la parution, puis cliquez sur le bouton « Joindre le CD TOC » sous la liste des parutions. Cela préparera une modification pour joindre l'identifiant du disque à la parution. Vous devez ensuite ajouter une note de modification appropriée et soumettre la modification.

source: **4. Add release if missing**
id: **4. Ajouter la parution si elle est manquante**

source: If none of the releases displayed are correct, you have the option to add a new release (with some information automatically included). The disc id will automatically be attached to the new release when the edit is saved.
id: Si aucune des parutions affichées n'est correcte, vous avez la possibilité d'ajouter une nouvelle parution (avec certaines informations automatiquement incluses). L'identifiant du disque sera automatiquement attaché à la nouvelle parution lorsque la modification est enregistrée.
