Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/usage/exec_commands.po
Languages: fr

source: :index:`Executable Commands <commands; executable, executable commands>`
fr: :index:`Commandes exécutables <commandes; exécutables, commandes exécutables>`

source: Picard can accept commands for processing by specifying them on the command line using the ``-e`` option or loading them from a text file. Commands are case-insensitive, and are processed sequentially in the order that they are received. The executable commands that Picard recognizes are:
fr: Picard peut accepter des commandes à traiter en les spécifiant sur la ligne de commande en utilisant l'option ``-e`` ou en les chargeant depuis un fichier texte. Les commandes sont insensibles à la casse, et sont traitées séquentiellement dans l'ordre où elles sont reçues. Les commandes exécutables que Picard reconnaît sont :

source: :index:`CLEAR_LOGS <executable commands; CLEAR_LOGS>`
fr: :index:`CLEAR_LOGS <commandes exécutables; CLEAR_LOGS>`

source: Usage: **CLEAR_LOGS**
fr: Utilisation : **CLEAR_LOGS**

source: Implemented: Picard 2.9
fr: Implémenté : Picard 2.9

source: Clear all entries from Picard's log. This is the equivalent of clicking the :guilabel:`Clear Log` button from the log viewing screen opened using the :menuselection:`"Help --> View Error/Debug Log"` command.
fr: Efface toutes les entrées du journal de Picard. C'est l'équivalent de cliquer sur le bouton :guilabel:`Effacer le journal` à partir de l'écran de visualisation du journal ouvert par la commande :menuselection:`"Aide --> Afficher le journal des erreurs et des débogages"`.

source: :index:`CLUSTER <executable commands; CLUSTER>`
fr: :index:`CLUSTER <commandes exécutables; CLUSTER>`

source: Usage: **CLUSTER**
fr: Utilisation : **CLUSTER**

source: Cluster all files in the cluster pane. This is the equivalent of using the :menuselection:`"Tools --> Cluster"` command.
fr: Regroupe tous les fichiers dans le volet de regroupement. Cela équivaut à utiliser la commande :menuselection:`"Outils --> Cluster"`.

source: :index:`FINGERPRINT <executable commands; FINGERPRINT>`
fr: :index:`FINGERPRINT <commandes exécutables; FINGERPRINT>`

source: Usage: **FINGERPRINT**
fr: Utilisation : **FINGERPRINT**

source: Calculate acoustic fingerprints for all (matched) files in the album pane. This is the equivalent of using the :menuselection:`"Tools --> Generate AcoustID Fingerprints"` command.
fr: Calcule les empreintes acoustiques pour tous les fichiers (correspondant) dans le volet album. C'est l'équivalent de l'utilisation de la commande :menuselection:`"Outils --> Générer des empreintes digitales AcoustID"`.

source: :index:`FROM_FILE <executable commands; FROM_FILE>`
fr: :index:`FROM_FILE <commandes exécutables; FROM_FILE>`

source: Usage: **FROM_FILE <file path>**
fr: Utilisation : **FROM_FILE <chemin du fichier>**

source: Load commands from a file. The file path can be either an absolute or relative path to a text file containing the commands to be executed. Each command to be processed must be on a separate line along with its arguments (if applicable). Blank lines and lines beginning with an octothorpe (#) are ignored. Command files can include other command files by specifying them with another ``FROM_FILE`` command. Circular references (by including a command file that is currently being processed) are ignored and will be logged as a warning.
fr: Charge les commandes à partir d'un fichier. Le chemin du fichier peut être un chemin absolu ou relatif vers un fichier texte contenant les commandes à exécuter. Chaque commande à traiter doit être sur une ligne séparée avec ses arguments (le cas échéant). Les lignes vides et les lignes commençant par un octothorpe (#) sont ignorées. Les fichiers de commandes peuvent inclure d'autres fichiers de commandes en les spécifiant avec une autre commande ``FROM_FILE``. Les références circulaires (par l'inclusion d'un fichier de commandes en cours de traitement) sont ignorées et feront l'objet d'un avertissement.

source: For example, you may have a file named ``commands.txt`` containing the standard commands that you want to use when processing each directory, such as:
fr: Par exemple, vous pouvez avoir un fichier nommé ``commands.txt`` contenant les commandes standard que vous voulez utiliser lors du traitement de chaque répertoire, comme par exemple :

source: You could then process a directory by starting Picard with the command:
fr: Vous pouvez alors traiter un répertoire en démarrant Picard avec la commande :

source: :index:`LOAD <executable commands; LOAD>`
fr: :index:`LOAD <commandes exécutables; LOAD>`

source: Usage: **LOAD <supported MBID/URL or path to a file/directory>**
fr: Utilisation : **LOAD <MBID/URL supporté ou chemin d'accès à un fichier/répertoire>**

source: Load one or more files/directories/MBIDs/URLs to Picard. This is similar to including the file, directory path, URL or MBID on the command line.
fr: Charge un ou plusieurs fichiers/répertoires/MBIDs/URLs dans Picard. Cela revient à inclure le fichier, le chemin du répertoire, l'URL ou le MBID sur la ligne de commande.

source: Files and directories are specified including the path (either absolute or relative) to the file or directory, and may include drive specifiers. They can also be specified using the ``file://`` prefix. URLs are specified by using either the ``http://`` or ``https://`` prefix. MBIDs are specified in the format ``mbid://<entity_type>/<mbid>`` where ``<entity_type>`` is one of "release", "artist" or "track" and ``<mbid>`` is the MusicBrainz Identifier of the entity.
fr: Les fichiers et les répertoires sont spécifiés en incluant le chemin (absolu ou relatif) vers le fichier ou le répertoire, et peuvent inclure des spécificateurs de lecteur. Ils peuvent également être spécifiés en utilisant le préfixe "file://". Les URLs sont spécifiées en utilisant le préfixe "http://" ou "https://". Les MBID sont spécifiés au format ``mbid://<type_d'entité>/<mbid>`` où ``<type_d'entité>`` est l'un de "release", "artist" ou "track" et ``<mbid>`` est l'identifiant MusicBrainz de l'entité.

source: If a specified item contains a space, it must be enclosed in quotes such as ``"/home/user/music/my song.mp3"``.
fr: Si un élément spécifié contient un espace, il doit être placé entre guillemets, comme par exemple ``"/home/user/music/my song.mp3"``.

source: :index:`LOOKUP <executable commands; LOOKUP>`
fr: :index:`LOOKUP <commandes exécutables; LOOKUP>`

source: Usage: **LOOKUP [clustered|unclustered|all]**
fr: Utilisation : **LOOKUP [clustered|unclustered|all]**

source: Lookup files in the clustering pane. Options are clustered files, unclustered files or all files. If not specified, the command defaults to all files.
fr: Rechercher des fichiers dans le volet de mise en grappe. Les options sont les fichiers clusterisés, les fichiers non clusterisés ou tous les fichiers. Si elle n'est pas spécifiée, la commande choisit par défaut tous les fichiers.

source: This is the equivalent of using the :menuselection:`"Tools --> Lookup"` command.
fr: Cela équivaut à utiliser la commande :menuselection:`"Outils --> Recherche"`.

source: :index:`LOOKUP_CD <executable commands; LOOKUP_CD>`
fr: :index:`LOOKUP_CD <commandes exécutables; LOOKUP_CD>`

source: Usage: **LOOKUP_CD [device/log file]**
fr: Utilisation : **LOOKUP_CD [dispositif/fichier journal]**

source: Read CD from the selected drive or ripper log file, and looks it up on MusicBrainz. If no argument is specified, it defaults to the first (alphabetically) available disc drive.
fr: Lit le CD à partir du lecteur sélectionné ou du fichier journal du ripper, et le recherche sur MusicBrainz. Si aucun argument n'est spécifié, elle choisit par défaut le premier lecteur de disque disponible (par ordre alphabétique).

source: This is the equivalent of using the :menuselection:`"Tools --> Lookup CD..."` command.
fr: Cela équivaut à utiliser la commande :menuselection:`"Outils --> Recherche de CD..."`.

source: :index:`PAUSE <executable commands; PAUSE>`
fr: :index:`PAUSE <commandes exécutables; PAUSE>`

source: Usage: **PAUSE <number of seconds to pause>**
fr: Utilisation : **PAUSE <nombre de secondes de pause>**

source: Pause executable command processing for the specified number of seconds.
fr: Pause du traitement des commandes exécutables pendant le nombre de secondes spécifié.

source: :index:`QUIT <executable commands; QUIT>`
fr: :index:`QUIT <commandes exécutables; QUIT>`

source: Usage: **QUIT \[force\]**
fr: Utilisation : **QUIT \[force\]**

source: The ``QUIT`` command waits until all queued executable commands have completed, and then initiates a shutdown request the same as if the user closed Picard from the user interface. This allows Picard to perform the same checks for unsaved files and such. When 'force' is entered as an argument to the command, Picard will bypass the unsaved files check.
fr: La commande ``QUIT`` attend que toutes les commandes exécutables en attente soient terminées, puis lance une demande d'arrêt de la même manière que si l'utilisateur fermait Picard depuis l'interface utilisateur. Cela permet à Picard d'effectuer les mêmes vérifications pour les fichiers non sauvegardés et autres. Lorsque 'force' est entré comme argument de la commande, Picard contourne la vérification des fichiers non sauvegardés.

source: Once a ``QUIT`` command has been queued, Picard will not queue any further executable commands. If the user cancels the ``QUIT`` from the unsaved files check dialog, the system will allow more commands to be queued.
fr: Une fois qu'une commande ``QUIT`` a été mise en file d'attente, Picard ne mettra plus en file d'attente d'autres commandes exécutables. Si l'utilisateur annule la commande ``QUITTER`` depuis la boîte de dialogue de vérification des fichiers non sauvegardés, le système autorisera la mise en file d'attente d'autres commandes.

source: :index:`REMOVE <executable commands; REMOVE>`
fr: :index:`REMOVE <commandes exécutables; REMOVE>`

source: Usage: **REMOVE <path to one or more files>**
fr: Utilisation : **REMOVE <chemin vers un ou plusieurs fichiers>**

source: Removes the specified file(s) from Picard. Does nothing if no arguments provided.
fr: Supprime le(s) fichier(s) spécifié(s) de Picard. Ne fait rien si aucun argument n'est fourni.

source: :index:`REMOVE_ALL <executable commands; REMOVE_ALL>`
fr: :index:`REMOVE_ALL <commandes exécutables; REMOVE_ALL>`

source: Usage: **REMOVE_ALL**
fr: Utilisation : **REMOVE_ALL**

source: Removes all files from Picard.
fr: Supprime tous les fichiers de Picard.

source: :index:`REMOVE_EMPTY <executable commands; REMOVE_EMPTY>`
fr: :index:`REMOVE_EMPTY <commandes exécutables; REMOVE_EMPTY>`

source: Usage: **REMOVE_EMPTY**
fr: Utilisation : **REMOVE_EMPTY**

source: Removes all empty clusters and albums.
fr: Supprime tous les clusters et albums vides.

source: :index:`REMOVE_SAVED <executable commands; REMOVE_SAVED>`
fr: :index:`REMOVE_SAVED <commandes exécutables; REMOVE_SAVED>`

source: Usage: **REMOVE_SAVED**
fr: Utilisation : **REMOVE_SAVED**

source: Removes all saved files from the album pane.
fr: Supprime tous les fichiers enregistrés du volet album.

source: :index:`REMOVE_UNCLUSTERED <executable commands; REMOVE_UNCLUSTERED>`
fr: :index:`REMOVE_UNCLUSTERED <commandes exécutables; REMOVE_UNCLUSTERED>`

source: Usage: **REMOVE_UNCLUSTERED**
fr: Utilisation : **REMOVE_UNCLUSTERED**

source: Removes all unclustered files from the cluster pane.
fr: Supprime tous les fichiers non regroupés du panneau de regroupement.

source: :index:`SAVE_MATCHED <executable commands; SAVE_MATCHED>`
fr: :index:`SAVE_MATCHED <commandes exécutables; SAVE_MATCHED>`

source: Usage: **SAVE_MATCHED**
fr: Utilisation : **SAVE_MATCHED**

source: Saves all matched files from the album pane.
fr: Enregistre tous les fichiers correspondants dans le volet album.

source: :index:`SAVE_MODIFIED <executable commands; SAVE_MODIFIED>`
fr: :index:`SAVE_MODIFIED <commandes exécutables; SAVE_MODIFIED>`

source: Saves all modified files from the album pane.
fr: Sauvegarde tous les fichiers modifiés du panneau de l'album.

source: :index:`SCAN <executable commands; SCAN>`
fr: :index:`SCAN <commandes exécutables; SCAN>`

source: Usage: **SCAN**
fr: Utilisation : **SCAN**

source: Scans all files in the cluster pane. This is the equivalent of using the :menuselection:`"Tools --> Scan"` command.
fr: Analyse tous les fichiers du volet cluster. Cela équivaut à l'utilisation de la commande :menuselection:`"Outils --> Scan"`.

source: :index:`SHOW <executable commands; SHOW>`
fr: :index:`SHOW <commandes exécutables; SHOW>`

source: Usage: **SHOW**
fr: Utilisation : **SHOW**

source: Make the running instance of Picard the currently active window.
fr: Faites de l'instance de Picard en cours d'exécution la fenêtre actuellement active.

source: :index:`SUBMIT_FINGERPRINTS <executable commands; SUBMIT_FINGERPRINTS>`
fr: :index:`SUBMIT_FINGERPRINTS <commandes exécutables; SUBMIT_FINGERPRINTS>`

source: Usage: **SUBMIT_FINGERPRINTS**
fr: Utilisation : **SUBMIT_FINGERPRINTS**

source: Submits outstanding acoustic fingerprints for all (matched) files in the album pane. This is the equivalent of using the :menuselection:`"Tools --> Submit AcoustIDs"` command.
fr: Soumet des empreintes acoustiques exceptionnelles pour tous les fichiers (correspondant) dans le volet album. C'est l'équivalent de l'utilisation de la commande :menuselection:`"Outils --> Soumettre des AcoustIDs"`.

source: :index:`WRITE_LOGS <executable commands; WRITE_LOGS>`
fr: :index:`WRITE_LOGS <commandes exécutables; WRITE_LOGS>`

source: Usage: **WRITE_LOGS <path to output file>**
fr: Utilisation : **WRITE_LOGS <chemin vers le fichier de sortie>**

source: Writes the Picard logs to the specified output file. This is the equivalent of using the :guilabel:`Save As...` button from the log viewing screen opened using the :menuselection:`"Help --> View Error/Debug Log"` command.
fr: Ecrit les logs de Picard dans le fichier de sortie spécifié. C'est l'équivalent de l'utilisation du bouton :guilabel:`Enregistrer sous...` depuis l'écran de visualisation des logs ouvert par la commande :menuselection:`"Aide --> Afficher le journal des erreurs et des débogages"`.
