Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/usage/option_profiles.po
Languages: fr

source: Option Profiles
fr: Profils d'options

source: As of version 2.7, Picard supports multiple profiles that can allow the user to quickly switch between option settings.
fr: Depuis la version 2.7, Picard prend en charge plusieurs profils qui permettent à l'utilisateur de passer rapidement d'une option à l'autre.

source: How Option Profiles Work
fr: Comment fonctionnent les profils d'option

source: A profile is defined by a set of options it manages. For example, one profile may include settings for file naming such as the target directory and which file naming script to use, while another profile may include different settings for the same options or different options entirely (or some of each). Profiles are stacked and processed in the order specified by the user, from top to bottom with the lowest level being the system's "user settings" profile. Each user-defined profile can be enabled or disabled independently from the other user-defined profiles. The system's "user settings" profile is always enabled and includes all options.
fr: Un profil est défini par un ensemble d'options qu'il gère. Par exemple, un profil peut inclure des paramètres pour le nommage des fichiers, tels que le répertoire cible et le script de nommage des fichiers à utiliser, tandis qu'un autre profil peut inclure des paramètres différents pour les mêmes options ou des options entièrement différentes (ou certaines de ces options). Les profils sont empilés et traités dans l'ordre spécifié par l'utilisateur, de haut en bas, le niveau le plus bas étant le profil "paramètres utilisateur" du système. Chaque profil défini par l'utilisateur peut être activé ou désactivé indépendamment des autres profils définis par l'utilisateur. Le profil "paramètres utilisateur" du système est toujours activé et comprend toutes les options.

source: When an option value is retrieved as part of Picard's processing, it comes from the first enabled profile in the stack that manages that option. Initially, the profile stack contains only the system's "user settings" profile, which holds the default settings for the user.
fr: Lorsqu'une valeur d'option est récupérée dans le cadre du traitement de Picard, elle provient du premier profil activé de la pile qui gère cette option. Initialement, la pile de profils ne contient que le profil "paramètres utilisateur" du système, qui contient les paramètres par défaut de l'utilisateur.

source: Example of Using Profiles
fr: Exemple d'utilisation des profils

source: For this example, the user would like to define a set of options with alternate values, in this case a target directory where audio files are saved (option ``move_files_to``).
fr: Dans cet exemple, l'utilisateur souhaite définir un ensemble d'options avec des valeurs alternatives, dans ce cas un répertoire cible où les fichiers audio sont sauvegardés (option ``move_files_to``).

source: The user creates a new profile (named "TargetMyDir"), adds the option ``move_files_to`` to it, and enables this profile. The stack is now:
fr: L'utilisateur crée un nouveau profil (nommé "TargetMyDir"), lui ajoute l'option "move_files_to", et active ce profil. La pile est maintenant:

source: They change the value of ``move_files_to`` (to "target_my_dir") for this new profile.
fr: Ils changent la valeur de ``move_files_to`` (en "target_my_dir") pour ce nouveau profil.

source: Since the profile "TargetMyDir" is enabled, the value for ``move_files_to`` is retrieved from this profile. The "user settings" still has the old ``move_files_to`` value.
fr: Puisque le profil "TargetMyDir" est activé, la valeur de ``move_files_to`` est récupérée à partir de ce profil. Les "paramètres utilisateur" ont toujours l'ancienne valeur de ``move_files_to``.

source: Now the user wants to work on another set of music files, wanting to disable ``windows_compatibility`` for this set and save them to the "not_for_windows" directory.
fr: Maintenant l'utilisateur veut travailler sur un autre ensemble de fichiers musicaux, il veut désactiver la "compatibilité avec Windows" pour cet ensemble et les sauvegarder dans le répertoire "pas_pour_windows".

source: They create a new profile (named "ByeByeWin"), add options ``move_files_to`` and ``windows_compatibility``, and enable it. Now the stack looks like:
fr: Ils créent un nouveau profil (nommé "ByeByeWin"), ajoutent les options ``move_files_to`` et ``windows_compatibility``, et l'activent. Maintenant la pile ressemble à ça:

source: They change the values of ``move_files_to`` (to "not_for_windows") and ``windows_compatibility`` (to false) for this new profile. Now when they process their files, the files are saved to the "ByeByeWin" ``move_files_to`` directory, with ``windows_compatibility`` = false.
fr: Ils changent les valeurs de ``move_files_to`` (en "not_for_windows") et ``windows_compatibility`` (en false) pour ce nouveau profil. Maintenant, lorsqu'ils traitent leurs fichiers, ceux-ci sont enregistrés dans le répertoire "ByeByeWin" ``move_files_to``, avec ``windows_compatibility`` = false.

source: Now the user wants to save files to the "TargetMyDir" target directory again, with their usual options. To do this they simply disable the "ByeByeWin" profile (which can later be re-enabled if needed). The stack looks like:
fr: L'utilisateur souhaite maintenant enregistrer à nouveau des fichiers dans le répertoire cible "TargetMyDir", avec ses options habituelles. Pour ce faire, il suffit de désactiver le profil "ByeByeWin" (qui peut être réactivé ultérieurement si nécessaire). La pile ressemble à cela:

source: Finally, to return to their usual output directory the user only has to disable the "TargetMyDir" profile so the stack is:
fr: Enfin, pour revenir à son répertoire de sortie habituel, l'utilisateur n'a qu'à désactiver le profil "TargetMyDir" pour que la pile soit:

source: Managing Option Profiles
fr: Gestion des profils d'options

source: All option profile management is done within the Option Profiles page available from the :menuselection:`"Options --> Options..."` item on the menu bar. From this screen you will be able to add, copy, edit, remove, enable and disable profiles, as well as setting the order of the profile stack.
fr: Toute la gestion des profils d'option s'effectue dans la page Profils d'option disponible à partir de l'élément :menuselection:`"Options --> Options..."` de la barre de menu. À partir de cet écran, vous pourrez ajouter, copier, modifier, supprimer, activer et désactiver des profils, ainsi que définir l'ordre de la pile de profils.

source: Initially, the list of profiles will be empty. To create a new profile click on the :guilabel:`New` button. This will create a profile with no options selected for the profile to manage. To rename the profile, right-click on the profile name and select the :menuselection:`"Rename profile"` command. The list of options that the profile is to manage are selected from the list in the right-hand pane. Options can be selected either by group or individually. The groups can be expanded to see the individual options belonging to that group.
fr: Initialement, la liste des profils sera vide. Pour créer un nouveau profil, cliquez sur le bouton :guilabel:`Nouveau`. Cela créera un profil sans aucune option sélectionnée pour le profil à gérer. Pour renommer le profil, faites un clic droit sur le nom du profil et sélectionnez la commande :menuselection:`"Renommer le profil"`. La liste des options que le profil doit gérer est sélectionnée dans la liste du volet de droite. Les options peuvent être sélectionnées par groupe ou individuellement. Les groupes peuvent être développés pour voir les options individuelles appartenant à ce groupe.

source: You can see the value currently assigned to a profile's option setting by hovering your cursor over the setting in the list. The value will be displayed as a tooltip for the setting.
fr: Vous pouvez voir la valeur actuellement attribuée au paramètre d'option d'un profil en plaçant votre curseur sur le paramètre dans la liste. La valeur s'affiche sous forme d'infobulle pour le paramètre.

source: The profile stack order can be rearranged either by selecting a profile and using the up and down arrow buttons below the list, or by dragging the profile to a new position in the stack. Profiles are enabled when the box beside the profile's name is checked.
fr: L'ordre de la pile de profils peut être réorganisé soit en sélectionnant un profil et en utilisant les boutons fléchés haut et bas sous la liste, soit en faisant glisser le profil vers une nouvelle position dans la pile. Les profils sont activés lorsque la case située à côté du nom du profil est cochée.

source: Changes made to a profile's options settings, enabled status, or position in the profile stack will be reflected in the option settings displayed on the other pages. Options that are controlled by an enabled profile will be shown as highlighted. Hovering your cursor over the highlighted option will identify which profile currently controls the setting. Settings are always displayed based on the first enabled profile in the profile stack, which corresponds to the setting that will be used during processing.
fr: Les modifications apportées aux paramètres d'options d'un profil, à son statut d'activation ou à sa position dans la pile de profils seront reflétées dans les paramètres d'options affichés sur les autres pages. Les options contrôlées par un profil activé apparaissent en surbrillance. Si vous passez votre curseur sur l'option en surbrillance, vous saurez quel profil contrôle actuellement ce paramètre. Les paramètres sont toujours affichés en fonction du premier profil activé dans la pile de profils, qui correspond au paramètre qui sera utilisé pendant le traitement.

source: You can also quickly enable or disable a profile (but not change the order of the profile stack), using the :menuselection:`"Options --> Enable/disable profiles"` item in the menu bar on Picard's main screen.
fr: Vous pouvez également activer ou désactiver rapidement un profil (mais pas changer l'ordre de la pile de profils), en utilisant l'élément :menuselection:`"Options --> Activer/désactiver les profils"` dans la barre de menu de l'écran principal de Picard.

source: When you click the :guilabel:`Make It So!` button, in addition to saving your updated profile configuration all highlighted options will be saved to the first enabled profile in the profile stack that controls that option. All other options will be saved to the "user settings" as before. This is described in more detail in the following section.
fr: Lorsque vous cliquez sur le bouton :guilabel:`Faites-le donc!`, outre l'enregistrement de votre configuration de profil mise à jour, toutes les options mises en évidence seront enregistrées dans le premier profil activé de la pile de profils qui contrôle cette option. Toutes les autres options seront enregistrées dans les "paramètres utilisateur" comme auparavant. Ceci est décrit plus en détail dans la section suivante.

source: Saving Profile Option Settings
fr: Sauvegarde des paramètres des options du profil

source: To save a value to a profile option setting, simply ensure that the the target profile is the first enabled profile in the profile stack, make the desired changes (the options should be highlighted), and then click the :guilabel:`Make It So!` button.
fr: Pour enregistrer une valeur dans un paramètre d'option de profil, il suffit de s'assurer que le profil cible est le premier profil activé dans la pile de profils, d'apporter les modifications souhaitées (les options doivent être mises en surbrillance), puis de cliquer sur le bouton :guilabel:`Faites-le donc!`.

source: Remember, all highlighted options will be saved to the first enabled profile in the profile stack that controls that option. All other options will be saved to the "user settings" profile which is the user's normal settings, and includes all options. You can confirm which profile a highlighted option will update by hovering your cursor over the option.
fr: N'oubliez pas que toutes les options mises en évidence seront enregistrées dans le premier profil activé de la pile de profils qui contrôle cette option. Toutes les autres options seront enregistrées dans le profil "paramètres utilisateur", qui correspond aux paramètres normaux de l'utilisateur et comprend toutes les options. Vous pouvez confirmer quel profil une option en surbrillance mettra à jour en passant votre curseur sur l'option.

source: From the pages which contain options that can be included on a profile, you will also be able to see which profiles, if any, manage any of the options on the page. This is done by clicking the :guilabel:`Attached Profiles` button.
fr: À partir des pages qui contiennent des options pouvant être incluses dans un profil, vous pourrez également voir quels profils, le cas échéant, gèrent l'une des options de la page. Pour ce faire, cliquez sur le bouton :guilabel:`Profils attachés`.

source: This lists the attached profiles in the order in which they appear in the profile stack, and whether or not the profile is enabled. If the page does not contain any options that could be managed by a profile, the :guilabel:`Attached Profiles` button will be disabled.
fr: Ce bouton liste les profils attachés dans l'ordre dans lequel ils apparaissent dans la pile de profils, et indique si le profil est activé ou non. Si la page ne contient aucune option pouvant être gérée par un profil, le bouton :guilabel:`Profils attachés` sera désactivé.

source: It is important to understand that when you click the :guilabel:`Make It So!` button **all** of the option settings on **all** pages will be saved. If an option is managed by one or more profiles that are currently enabled, the option will be highlighted and it will be saved to the **first** enabled profile in the profile stack that manages the option. If there are no enabled profiles that manage the option, the option will not be highlighted and it will be saved to the "user settings" profile which is the user's normal settings, contains all options, is at the bottom of the profile stack, and is always enabled. The "user settings" profile cannot be modified is not shown in the profile management page.
fr: Il est important de comprendre que lorsque vous cliquez sur le bouton :guilabel:`Faites-le donc!` **tous** les paramètres des options de **toutes** les pages seront enregistrés. Si une option est gérée par un ou plusieurs profils actuellement activés, l'option sera mise en surbrillance et sera enregistrée dans le **premier** profil activé de la pile de profils qui gère l'option. Si aucun profil activé ne gère l'option, celle-ci ne sera pas mise en surbrillance et sera enregistrée dans le profil "paramètres utilisateur", qui correspond aux paramètres normaux de l'utilisateur, contient toutes les options, se trouve au bas de la pile de profils et est toujours activé. Le profil "paramètres utilisateur" ne peut pas être modifié et n'apparaît pas dans la page de gestion des profils.
