Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/usage/other.po
Languages: fr

source: Other Picard Tasks
fr: Autres tâches de Picard

source: In addition to the general functionality of Picard tagging and organizing your audio files, there are some other tasks that it can perform:
fr: En plus de la fonctionnalité générale de balisage et d'organisation de vos fichiers audio Picard, il existe d'autres tâches qu'il peut effectuer:

source: **Attaching disc ids to releases on MusicBrainz**
fr: **Joindre les identifiants de disque aux versions sur MusicBrainz**

source: This will read the id of a cd and attach it to a specified release in the MusicBrainz database. This will allow the release to be included in the list provided when someone uses the "Lookup CD" function.
fr: Cela lira l'ID d'un CD et le joindra à une version spécifiée dans la base de données MusicBrainz. Cela permettra à la version d'être incluse dans la liste fournie lorsque quelqu'un utilise la fonction "Rechercher un CD".

source: **Submitting track acoustic fingerprints**
fr: **Envoi des empreintes acoustiques des pistes**

source: This will calculate the acoustic fingerprints for the selected tracks and submit them to the AcoustID database.
fr: Cela calculera les empreintes acoustiques des pistes sélectionnées et les soumettra à la base de données AcoustID.

source: **Generating tags from file names**
fr: **Générer des balises à partir des noms de fichiers**

source: This will extract tags such as track number and title from the file name.
fr: Cela extraira les balises telles que le numéro de piste et le titre du nom de fichier.

source: **Submitting cluster as a release**
fr: **Soumettre le cluster comme une version**

source: You can submit a cluster as a release to the MusicBrainz database. This functionality has long been available through a plugin, but has been included within Picard itself as of v2.7.
fr: Vous pouvez soumettre un cluster en tant que release à la base de données MusicBrainz. Cette fonctionnalité a longtemps été disponible via un plugin, mais a été incluse dans Picard lui-même à partir de la v2.7.

source: Step-by-step detailed instructions: :doc:`attach_disc_id` / :doc:`submit_acoustid` / :doc:`tags_from_file_names` / :doc:`submit_cluster_as_release`
fr: Instructions détaillées étape par étape: :doc:`attach_disc_id` / :doc:`submit_acoustid` / :doc:`tags_from_file_names` / :doc:`submit_cluster_as_release`
