Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/usage/retrieve.po
Languages: fr

source: Retrieving Album Information
fr: Récupération des informations sur l'album

source: This stage identifies the album on MusicBrainz that will provide the information used for tagging the files, and retrieves the metadata from the MusicBrainz database. There are a few different methods available, depending on the information currently available on your system (e.g.: metadata existing in the files, or having the source CD available).
fr: Cette étape identifie l'album sur MusicBrainz qui fournira les informations utilisées pour baliser les fichiers, et récupère les métadonnées de la base de données MusicBrainz. Il existe différentes méthodes disponibles, en fonction des informations actuellement disponibles sur votre système (par exemple: les métadonnées existant dans les fichiers, ou la disponibilité du CD source).

source: There are basically four main methods used to retrieve album information from the MusicBrainz database.
fr: Il existe essentiellement quatre méthodes principales utilisées pour récupérer les informations d'album à partir de la base de données MusicBrainz.

source: Lookup CD or Ripper Log
fr: Recherche du journal du CD ou du ripper

source: :doc:`Lookup CD or Ripper Log <retrieve_lookup_cd>`
fr: :doc:`Recherche du journal du CD ou du ripper <retrieve_lookup_cd>`

source: This is the preferred method of automatically identifying the album to retrieve, and should be used when you have the CD or :ref:`supported ripper log <faq_supported_rippers>` available. Typically this would be used right after ripping the audio files from the CD. When initiated, the table of contents (TOC) is read from the CD and a request is sent to MusicBrainz to return a list of the releases that match the TOC. If there are any matches, then they will be listed for you to select the one to use. If there are no matches or none of the matches are correct, you can search the database manually for the matching album, and are given the option of attaching the TOC from your CD to the selected release for future lookup.
fr: C'est la méthode préférée pour identifier automatiquement l'album à récupérer, et devrait être utilisée lorsque vous avez le CD ou :ref:`le journal des rippeurs supportés <faq_supported_rippers>` disponible. Typiquement, cette fonction est utilisée juste après avoir rippé les fichiers audio du CD. Lorsqu'elle est lancée, la table des matières (TOC) est lue à partir du CD et une requête est envoyée à MusicBrainz pour retourner une liste des sorties qui correspondent à la TOC. S'il y a des correspondances, elles seront listées pour que vous puissiez choisir celle à utiliser. S'il n'y a pas de correspondance ou si aucune correspondance n'est correcte, vous pouvez rechercher manuellement l'album correspondant dans la base de données, et vous avez la possibilité d'attacher la TOC de votre CD à la sortie sélectionnée pour une consultation ultérieure.

source: The steps to follow to :index:`lookup a CD <lookup; cd, lookup; ripper log>` are:
fr: Les étapes à suivre pour :index:`rechercher un CD <chercher; cd, chercher; grumes de défonceuse>` sont:

source: Make sure the CD is inserted in the drive, and select :menuselection:`"Tools --> Lookup CD... --> (drive to use)"`. The CD TOC will be calculated and sent to MusicBrainz. Alternately, you can use a :ref:`supported ripper log file <faq_supported_rippers>` to lookup the CD using the :menuselection:`"Tools --> Lookup CD --> From CD ripper log file..."` command. This will open a file browser dialog to allow you to select the log file to process. Either method will query the MusicBrainz database and display a list of matching releases.
fr: Assurez-vous que le CD est inséré dans le lecteur, et sélectionnez :menuselection:`"Outils --> CD de recherche... --> (conduire pour utiliser)"`. La table des matières du CD sera calculée et envoyée à MusicBrainz. Vous pouvez également utiliser un :ref:`fichier journal de ripper supporté par <faq_supported_rippers>` pour rechercher le CD en utilisant la commande :menuselection:`"Outils --> CD de recherche --> Depuis le fichier journal du ripper CD..."`. Cela ouvrira une boîte de dialogue de recherche de fichiers pour vous permettre de sélectionner le fichier journal à traiter. L'une ou l'autre méthode interrogera la base de données MusicBrainz et affichera une liste des versions correspondantes.

source: Select the correct release from the list and click on the :guilabel:`Load into Picard` button. This will load the information for the release into Picard.
fr: Sélectionnez la bonne version dans la liste et cliquez sur le bouton :guilabel:`Charger dans Picard`. Cela chargera les informations relatives à la version dans Picard.

source: A music symbol in front of a track number in the right-hand pane indicates that there has been no file assigned to the track.
fr: Un symbole de musique devant un numéro de piste dans le volet de droite indique qu'aucun fichier n'a été attribué à la piste.

source: If there are no matches or none of the matches are correct, use the :guilabel:`Submit disc ID` option to locate the correct release. Enter the release title or artist and initiate the search. You will be provided with a list of the releases that match your search criterion and have the same number of tracks as your CD TOC.
fr: Si aucune correspondance n'est trouvée ou si aucune correspondance n'est correcte, utilisez l'option :guilabel:`Soumettre l'ID du disque` pour trouver la bonne version. Saisissez le titre du disque ou le nom de l'artiste et lancez la recherche. Vous obtiendrez une liste des disques qui correspondent à vos critères de recherche et qui ont le même nombre de pistes que votre CD TOC.

source: Use the green arrow |lookup_tagger| to load the information for a release into Picard. In addition, you can select the release and attach the CD TOC.
fr: Utilisez la flèche verte |lookup_tagger| pour charger les informations d'un communiqué dans Picard. De plus, vous pouvez sélectionner la version et joindre la TOC du CD.

source: If none of the releases displayed are correct, you have the option to add a new release (with some information automatically included).
fr: Si aucune des versions affichées n'est correcte, vous avez la possibilité d'ajouter une nouvelle version (avec certaines informations automatiquement incluses).

source: Lookup Files
fr: Rechercher des fichiers

source: :doc:`Lookup Files <retrieve_lookup>`
fr: :doc:`Rechercher des fichiers <retrieve_lookup>`

source: If you don't have the CD available, and your files are grouped by album, this is the preferred method of automatically identifying the album to retrieve. This is done by grouping the files into album clusters in Picard and then perform the lookup. Picard will try to match the entire set of clustered files to the same release.
fr: Si vous ne disposez pas du CD et que vos fichiers sont regroupés par album, il s'agit de la méthode préférée pour identifier automatiquement l'album à récupérer. Cela se fait en regroupant les fichiers dans des groupes d'albums dans Picard, puis en effectuant la recherche. Picard essaiera de faire correspondre l'ensemble des fichiers en cluster à la même version.

source: The steps to follow to :index:`lookup files` are:
fr: Les étapes à suivre pour :index:`rechercher des fichiers <fichiers de recherche>` sont:

source: Add your files using :menuselection:`"Files --> Add Files..."` or :menuselection:`"Files --> Add Folder..."`. For ease of use it is recommended to use the internal File Browser to manage file system interactions. This is enabled from :menuselection:`"View --> File Browser"`.
fr: Ajoutez vos fichiers en utilisant :menuselection:`"Fichiers --> Ajouter des fichiers..."` ou :menuselection:`"Fichiers --> Ajouter un dossier..."`. Pour faciliter l'utilisation, il est recommandé d'utiliser le navigateur de fichiers interne pour gérer les interactions du système de fichiers. Ceci est activé à partir de :menuselection:`"Affichage --> Navigateur de fichiers"`.

source: Drag the selected directory or files to the "Unclustered Files" folder, and wait for Picard to process the files - the names will turn from grey to black.
fr: Faites glisser le répertoire ou les fichiers sélectionnés vers le dossier "Fichiers non groupés" et attendez que Picard traite les fichiers - les noms passeront du gris au noir.

source: Use :menuselection:`"Tools --> Cluster"` to group the files into album :index:`clusters <pair: cluster; lookup>`.
fr: Utilisez :menuselection:`"Outils --> Cluster"` pour regrouper les fichiers en album :index:`clusters <pair: cluster; recherche>`.

source: Select a clustered album and use :menuselection:`"Tools --> Lookup"` to lookup the cluster. Depending on your previous metadata, the album will show up in the right-hand pane.
fr: Sélectionnez un album en cluster et utilisez :menuselection:`"Outils --> Rechercher"` pour rechercher le cluster. En fonction de vos métadonnées précédentes, l'album apparaîtra dans le volet de droite.

source: If you're not sure that the album retrieved is correct, you can use :menuselection:`"Tools --> Show other album versions..."` to open a window displaying all releases matched. From this window, you can select a different matching version to use, or refine the search criteria and perform a new search.
fr: Si vous n'êtes pas sûr que l'album récupéré est correct, vous pouvez utiliser :menuselection:`"Outils --> Afficher les autres versions de l'album..."` pour ouvrir une fenêtre affichant toutes les versions correspondantes. À partir de cette fenêtre, vous pouvez sélectionner une autre version correspondante à utiliser, ou affiner les critères de recherche et effectuer une nouvelle recherche.

source: If no album was retrieved, or if the album retrieved was incorrect, you may have to try a different method such as scanning the files or a manual lookup.
fr: Si aucun album n'a été récupéré, ou si l'album récupéré était incorrect, vous devrez peut-être essayer une autre méthode telle que l'analyse des fichiers ou une recherche manuelle.

source: Scan Files
fr: Analyser les fichiers

source: :doc:`Scan Files <retrieve_scan>`
fr: :doc:`Analyser les fichiers <retrieve_scan>`

source: If your files are not grouped into albums and you don't have the CD available, this is the only remaining method of automatically identifying the album to retrieve. This is done by scanning the files to obtain their AcoustID fingerprints and then perform the lookup for the individual files by fingerprint. The album(s) matching the files will show up in the right-hand pane based on a "best match" using the Preferred Releases settings in the Metadata options.
fr: Si vos fichiers ne sont pas regroupés en albums et que vous ne disposez pas du CD, c'est la seule méthode restante pour identifier automatiquement l'album à récupérer. Cela se fait en scannant les fichiers pour obtenir leurs empreintes digitales AcoustID, puis en effectuant la recherche des fichiers individuels par empreinte digitale. Le ou les albums correspondant aux fichiers s'afficheront dans le volet de droite en fonction d'une "meilleure correspondance" en utilisant les paramètres de versions préférées dans les options de métadonnées.

source: The steps to follow to :index:`scan and lookup files <scan files>` are:
fr: Les étapes à suivre pour :index:`analyser et rechercher des fichiers <analyser les fichiers>` sont les suivantes:

source: Select the desired files and use :menuselection:`"Tools --> Scan"` to scan the files to determine their AcoustID fingerprints and lookup using this information. The album(s) matching the files will show up in the right-hand pane based on a "best match" using the Preferred Releases settings in the Metadata options.
fr: Sélectionnez les fichiers souhaités et utilisez :menuselection:`"Outils --> Analyser"` pour scanner les fichiers afin de déterminer leurs empreintes AcoustID et rechercher à l'aide de ces informations. Le ou les albums correspondant aux fichiers s'afficheront dans le volet de droite en fonction d'une «meilleure correspondance» en utilisant les paramètres de versions préférées dans les options de métadonnées.

source: If no album was retrieved, or if the album retrieved was incorrect, you may have to try a different method such as clustering the files or a browser lookup.
fr: Si aucun album n'a été récupéré ou si l'album récupéré était incorrect, vous devrez peut-être essayer une autre méthode, telle que le regroupement des fichiers ou une recherche dans le navigateur.

source: Lookup in Browser
fr: Recherche dans le navigateur

source: :doc:`Lookup in Browser <retrieve_browser>`
fr: :doc:`Recherche dans le navigateur <retrieve_browser>`

source: If none of the automated methods are available, or don't produce the desired results, you have the option of retrieving the album information by having Picard initiate a search on the MusicBrainz website using your web browser. There are two methods of initiating this search. The first method searches based on the tag information from the selected files.
fr: Si aucune des méthodes automatisées n'est disponible ou ne produit pas les résultats souhaités, vous avez la possibilité de récupérer les informations de l'album en demandant à Picard de lancer une recherche sur le site Web MusicBrainz à l'aide de votre navigateur Web. Il existe deux méthodes pour lancer cette recherche. La première méthode recherche sur la base des informations de balise des fichiers sélectionnés.

source: The steps to follow to :index:`manually lookup an album <lookup in browser>` on MusicBrainz are:
fr: Les étapes à suivre pour :index:`rechercher manuellement un album <recherche dans le navigateur>` sur MusicBrainz sont:

source: Use :menuselection:`"Tools --> Cluster"` to group the files into album clusters if you want lookup a cluster.
fr: Utilisez :menuselection:`"Outils --> Cluster"` pour regrouper les fichiers en clusters d'albums si vous voulez rechercher un cluster.

source: Select a file or clustered album and use :menuselection:`"Tools --> Lookup in Browser"` to initiate the search in your browser using the currently available metadata.
fr: Sélectionnez un fichier ou un album groupé et utilisez :menuselection:`"Outils --> Recherche dans le navigateur"` pour lancer la recherche dans votre navigateur en utilisant les métadonnées actuellement disponibles.

source: If you want to revise or refine your search criteria, make the desired changes at the bottom of the web page and click the "Search" button to re-initiate the search.
fr: Si vous souhaitez réviser ou affiner vos critères de recherche, effectuez les modifications souhaitées en bas de la page Web et cliquez sur le bouton "Rechercher" pour relancer la recherche.

source: Use the green arrow |retrieve_browser_steps_lookup_tagger| to load the information for a release into Picard.
fr: Utilisez la flèche verte |retrieve_browser_steps_lookup_tagger| pour charger les informations pour une publication dans Picard.

source: Manual Lookup
fr: Recherche manuelle

source: :doc:`Manual Lookup <retrieve_manual>`
fr: :doc:`Recherche manuelle <retrieve_manual>`

source: The second browser search method uses manually entered information as the search criterion.
fr: La deuxième méthode de recherche par navigateur utilise des informations saisies manuellement comme critère de recherche.

source: The steps to follow to manually lookup an album on MusicBrainz are:
fr: Les étapes à suivre pour rechercher manuellement un album sur MusicBrainz sont:

source: Enter your search information into the search box and select the type of records to search, then click the magnifying glass symbol to initiate the search. This will open the `MusicBrainz website <https://musicbrainz.org>`_ in your browser.
fr: Entrez vos informations de recherche dans la zone de recherche et sélectionnez le type d'enregistrements à rechercher, puis cliquez sur le symbole de la loupe pour lancer la recherche. Cela ouvrira le `site Web MusicBrainz <https://musicbrainz.org>`_ dans votre navigateur.

source: Continue to drill down by clicking on the appropriate links until you get to the release that you want to retrieve.
fr: Continuez à explorer en cliquant sur les liens appropriés jusqu'à ce que vous arriviez à la version que vous souhaitez récupérer.

source: Use the green arrow |retrieve_manual_steps_lookup_tagger| to load the information for a release into Picard.
fr: Utilisez la flèche verte |retrieve_manual_steps_lookup_tagger| pour charger les informations pour une publication dans Picard.

source: If you enter a link to the desired entry (e.g.: ``https://musicbrainz.org/release/9383a6f5-9607-4a36-9c68-8663aad3592b``) in the search box in Picard, the entry will be loaded directly without opening a browser window.
fr: Si vous entrez un lien vers l'entrée souhaitée (par exemple: ``https://musicbrainz.org/release/9383a6f5-9607-4a36-9c68-8663aad3592b``) dans le champ de recherche en Picard, l'entrée sera chargée directement sans ouvrir une fenêtre de navigateur.

source: Step-by-step instructions: :doc:`retrieve_lookup_cd` / :doc:`retrieve_lookup` / :doc:`retrieve_scan` / :doc:`retrieve_browser` / :doc:`retrieve_manual`
fr: Instructions pas à pas: :doc:`retrieve_lookup_cd` / :doc:`retrieve_lookup` / :doc:`retrieve_scan` / :doc:`retrieve_browser` / :doc:`retrieve_manual`
