Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/usage/submit_acoustid.po
Languages: fr

source: :index:`Submitting Acoustic Fingerprints <AcoustID; submitting, acoustic fingerprint; submitting, fingerprint; submitting>`
fr: :index:`Soumission d'empreintes acoustiques <AcoustID; soumission, empreinte digitale acoustique; soumission, empreinte digitale; soumission>`

source: Acoustic fingerprints are very useful for identifying tracks and recordings, allowing them to be looked up in the MusicBrainz database. Thus, it is very valuable to add them when you are tagging files. Note that an acoustic fingerprint is **not** an AcoustID. Please see the :doc:`/tutorials/acoustid` tutorial for additional information.
fr: Les empreintes acoustiques sont très utiles pour identifier les pistes et les enregistrements, ce qui permet de les rechercher dans la base de données MusicBrainz. Il est donc très utile de les ajouter lorsque vous étiquetez des fichiers. Notez qu'une empreinte acoustique **n'est pas** un AcoustID. Veuillez consulter le tutoriel :doc:`/tutorials/acoustid` pour de plus amples informations.

source: When using Picard to submit acoustic fingerprints, it is recommended to enable the Fingerprint column in the table view in the right-hand pane. This is done by right-clicking the column header and checking the box beside "Fingerprint status". This will display an icon indicating whether the AcoustID was calculated and whether it ready for submission (red = unsubmitted, grey = already submitted).
fr: Lorsque vous utilisez Picard pour soumettre des empreintes acoustiques, il est recommandé d'activer la colonne Empreintes digitales dans la vue du tableau dans le volet de droite. Pour ce faire, cliquez avec le bouton droit de la souris sur l'en-tête de la colonne et cochez la case "État de l'empreinte digitale". Cela affichera une icône indiquant si l'AcoustID a été calculé et s'il est prêt à être soumis (rouge = non soumis, gris = déjà soumis).

source: There is also a :doc:`Video Tutorial </tutorials/v_submit_acoustid>` available which demonstrates how to submit AcoustIDs.
fr: Il existe également un :doc:`Tutoriel vidéo </tutorials/v_submit_acoustid>` qui montre comment soumettre des AcoustID.

source: There are two methods for submitting acoustic fingerprints, depending on the workflow that you are using to identify the releases that you are tagging. Note that both methods require that you first match your audio files to release and track information from the MusicBrainz database. See the :doc:`retrieve` and :doc:`match` sections for more information about retrieving release information and matching audio files to releases.
fr: Il existe deux méthodes pour soumettre des empreintes acoustiques, en fonction du flux de travail que vous utilisez pour identifier les publications que vous étiquetez. Notez que les deux méthodes exigent que vous fassiez d'abord correspondre vos fichiers audio aux informations sur les versions et les pistes de la base de données MusicBrainz. Consultez les sections :doc:`retrieve` et :doc:`match` pour plus d'informations sur la récupération des informations sur les sorties et la correspondance entre les fichiers audio et les sorties.

source: The steps to follow to submit acoustic fingerprints for each of the two workflows are:
fr: Les étapes à suivre pour soumettre des empreintes acoustiques pour chacun des deux flux de travail sont les suivantes :

source: Submitting when using Scan to identify the release
fr: Envoi lors de l'utilisation de Scan pour identifier la version

source: Load files into the clustering pane. Select the files and click the "Scan" button, or select :menuselection:`"Tools --> Scan"`.
fr: Chargez les fichiers dans le volet de clustering. Sélectionnez les fichiers et cliquez sur le bouton "Scan", ou sélectionnez :menuselection:`"Outils --> Scan"`.

source: If the files are matched to a track and move to the right-hand pane, they already exist in the AcoustID database and do not need to be re-submitted. The "Submit" button will remain disabled.
fr: Si les fichiers correspondent à une piste et sont déplacés vers le volet de droite, ils existent déjà dans la base de données AcoustID et n'ont pas besoin d'être soumis à nouveau. Le bouton "Soumettre" restera désactivé.

source: If the files are not matched, or you manually move them to match to a different track they could be submitted. The AcoustID icon for the tracks will show up in red (i.e.: unsubmitted status) and the "Submit" button will be enabled.
fr: Si les fichiers ne correspondent pas ou si vous les déplacez manuellement pour qu'ils correspondent à une autre piste, ils pourraient être soumis. L'icône AcoustID pour les pistes apparaîtra en rouge (c'est-à-dire: statut non soumis) et le bouton "Soumettre" sera activé.

source: Clicking the "Submit" button will only submit the fingerprints for the files identified in Step 3. The AcoustID icon for the tracks will change to grey (i.e.: submitted status) and the "Submit" button will be disabled.
fr: Cliquer sur le bouton "Soumettre" ne soumettra que les empreintes digitales des fichiers identifiés à l'étape 3. L'icône AcoustID des pistes deviendra grise (c'est-à-dire: statut soumis) et le bouton "Soumettre" sera désactivé.

source: Submitting when not using Scan to identify the release
fr: Soumission lorsque vous n'utilisez pas Scan pour identifier la version

source: Make sure that the files are properly matched to tracks on a release in the right-hand pane.
fr: Assurez-vous que les fichiers correspondent correctement aux pistes d'une version dans le volet de droite.

source: Select the files in the right-hand pane and select :menuselection:`"Tools --> Generate AcoustID fingerprints"`. This will calculate the acoustic fingerprints for the selected files.
fr: Sélectionnez les fichiers dans le volet de droite et sélectionnez :menuselection:`"Outils --> Générer des empreintes AcoustID"`. Cela calculera les empreintes acoustiques des fichiers sélectionnés.

source: The "Generate AcoustID fingerprints" action button can be added to the button bar by changing the settings in the User Interface options.
fr: Le bouton d'action "Générer des empreintes digitales AcoustID" peut être ajouté à la barre de boutons en modifiant les paramètres dans les options de l'interface utilisateur.

source: The AcoustID icon for the tracks will show up in red (i.e.: unsubmitted status) and the "Submit" button will be enabled.
fr: L'icône AcoustID pour les pistes apparaîtra en rouge (c'est-à-dire: statut non soumis) et le bouton "Soumettre" sera activé.

source: Clicking the "Submit" button will submit the fingerprints for the files. The AcoustID icon for the tracks will change to grey (i.e.: submitted status) and the "Submit" button will be disabled.
fr: Cliquer sur le bouton "Soumettre" soumettra les empreintes digitales des fichiers. L'icône AcoustID des pistes deviendra grise (ex: état soumis) et le bouton "Soumettre" sera désactivé.
