Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/usage/submit_cluster_*_release.po
Languages: fr

source: :index:`Submitting Cluster as a Release <cluster; submitting, release; submitting>`
fr: :index:`Soumettre le cluster comme une version <cluster; soumettre, release; soumettre>`

source: Picard can assist you in submitting information to the MusicBrainz database by automatically populating the submission form on the website with data from your files. This is typically used when you have the music files for an album, but it is not yet available on MusicBrainz.
fr: Picard peut vous aider à soumettre des informations à la base de données MusicBrainz en remplissant automatiquement le formulaire de soumission sur le site Web avec les données de vos fichiers. Cette méthode est généralement utilisée lorsque vous disposez des fichiers musicaux d'un album, mais que celui-ci n'est pas encore disponible sur MusicBrainz.

source: Submitting multiple tracks as a cluster
fr: Soumettre plusieurs pistes en tant que groupe

source: To use this functionality, the steps to follow are:
fr: Pour utiliser cette fonctionnalité, les étapes à suivre sont les suivantes :

source: **1. Load the files**
fr: **1. Chargez les fichiers**

source: Drag the batch of files to process from the browser pane to the "Unclustered Files" section in the clustering pane.
fr: Faites glisser le lot de fichiers à traiter depuis le volet du navigateur vers la section "Fichiers non regroupés" du volet de regroupement.

source: **2. Cluster the files**
fr: **2. Regroupez les fichiers**

source: Select the files in the clustering pane and combine them into album clusters using the :menuselection:`"Tools --> Cluster"` command. Picard will attempt to cluster the files based on their existing metadata. Depending on the quality of the metadata, you may need to manually add items to the cluster or remove items from the cluster to ensure that it is complete for the album, and does not contain any additional files.
fr: Sélectionnez les fichiers dans le panneau de clustering et combinez-les en clusters d'albums en utilisant la commande :menuselection:`"Outils --> Cluster"`. Picard tentera de regrouper les fichiers en se basant sur leurs métadonnées existantes. Selon la qualité des métadonnées, vous devrez peut-être ajouter manuellement des éléments au cluster ou en supprimer pour vous assurer qu'il est complet pour l'album et qu'il ne contient pas de fichiers supplémentaires.

source: **3. Submit the cluster**
fr: **3. Soumettre le cluster**

source: Once you have the proper files in the cluster and it is complete for the album, you can submit it to MusicBrainz by selecting the cluster and right-click to bring up the context menu. From there you should see an option to :menuselection:`"Submit cluster as release..."`.
fr: Une fois que vous avez les bons fichiers dans le cluster et qu'il est complet pour l'album, vous pouvez le soumettre à MusicBrainz en sélectionnant le cluster et en faisant un clic droit pour faire apparaître le menu contextuel. De là, vous devriez voir une option :menuselection:`"Soumettre le cluster en tant que communiqué..."`.

source: **4. Confirm submitted information**
fr: **4. Confirmez les informations soumises**

source: When the option is selected, the system will submit a request to add the information to MusicBrainz, and you will be presented with a confirmation screen in your browser. You can see the information that will be submitted by expanding the "Data submitted with this request" link. Selecting :guilabel:`Continue` will open an "Add Release" edit screen with the fields populated with your information.
fr: Lorsque l'option est sélectionnée, le système soumet une demande d'ajout des informations à MusicBrainz, et un écran de confirmation s'affiche dans votre navigateur. Vous pouvez voir les informations qui seront soumises en développant le lien "Données soumises avec cette demande". En sélectionnant :guilabel:`Continuer`, vous ouvrirez un écran d'édition "Ajouter un communiqué" dont les champs seront remplis avec vos informations.

source: **5. Complete the submission**
fr: **5. Complétez la soumission**

source: Selecting :guilabel:`Continue` will open an "Add Release" edit screen with the fields populated with your information. From here you can check and submit your edit as if you had entered all of the information manually.
fr: En sélectionnant :guilabel:`Continuer`, vous ouvrirez un écran d'édition "Ajouter un communiqué" dont les champs sont remplis avec vos informations. À partir de cet écran, vous pouvez vérifier et soumettre votre modification comme si vous aviez saisi toutes les informations manuellement.

source: Before submitting the edit, you should check that all of the information has been correctly entered in accordance with the `MusicBrainz Style Guides <https://musicbrainz.org/doc/Style>`_ and that the artist and release groups have been matched to existing items as appropriate. You should also add an edit note citing the source of the information.
fr: Avant de soumettre l'édition, vous devez vérifier que toutes les informations ont été correctement saisies conformément aux `Guides de style MusicBrainz <https://musicbrainz.org/doc/Style>`_ et que les groupes d'artistes et de sorties ont été mis en correspondance avec des éléments existants, le cas échéant. Vous devriez également ajouter une note d'édition citant la source de l'information.

source: Submitting a single track
fr: Soumission d'une seule piste

source: You can also use this feature to submit a single track as a release or as a standalone recording. To do this, right-click the file and select either :menuselection:`"Submit file as standalone recording..."` or :menuselection:`"Submit file as release..."` as appropriate. Again, be sure to confirm the information has been correctly entered in accordance with the `MusicBrainz Style Guides <https://musicbrainz.org/doc/Style>`_ and that the artist and release groups have been matched to existing items as appropriate. You should also add an edit note citing the source of the information.
fr: Vous pouvez également utiliser cette fonctionnalité pour soumettre une seule piste en tant que version ou en tant qu'enregistrement autonome. Pour ce faire, cliquez avec le bouton droit de la souris sur le fichier et sélectionnez :menuselection:`"Soumettre le fichier comme enregistrement autonome..."` ou :menuselection:`"Soumettre le fichier comme release..."` selon le cas. Encore une fois, assurez-vous de confirmer que les informations ont été correctement saisies conformément aux `Guides de style MusicBrainz <https://musicbrainz.org/doc/Style>`_ et que les groupes d'artistes et de versions ont été mis en correspondance avec des éléments existants, le cas échéant. Vous devez également ajouter une note d'édition citant la source de l'information.
