Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/usage/tags_from_file_names.po
Languages: fr

source: Generating :index:`tags from file names`
fr: Générer des :index:`balises à partir des noms de fichiers`

source: Sometimes files have poor quality tags or no tags at all, but the file names are well structured and follow a pattern. In this case you can use :menuselection:`"Tools --> Tags From &File Names..."` to generate the tags from the file names.
fr: Parfois, les fichiers ont des balises de mauvaise qualité ou aucune balise du tout, mais les noms de fichiers sont bien structurés et suivent un modèle. Dans ce cas, vous pouvez utiliser :menuselection:`"Outils --> Balises de noms de fichiers..."` pour générer les balises à partir des noms de fichiers.

source: Basic usage
fr: Utilisation de base

source: To use this tool, select one or more files loaded into Picard and open the Tags From File Names dialog from the menu at :menuselection:`"Tools --> Tags From &File Names..."`. The dialog will show you a list of filenames and an input field at the top where you can enter a matching pattern.
fr: Pour utiliser cet outil, sélectionnez un ou plusieurs fichiers chargés dans Picard et ouvrez la boîte de dialogue Balises à partir de noms de fichiers dans le menu sous :menuselection:`"Outils --> Balises à partir de noms de fichiers..."`. La boîte de dialogue vous montrera une liste de noms de fichiers et un champ de saisie en haut où vous pouvez entrer un modèle correspondant.

source: The matching pattern can consist of Picard tag names enclosed in ``%`` signs and other characters that are matched verbatim. For the tag names you can use predefined names such as ``%artist%``, ``%album%``, or ``%title%`` (see :doc:`/variables/variables`) or use custom names. There are a few predefined patterns available to select from, but you can also adjust them or set your own.
fr: Le modèle de correspondance peut être constitué de noms de balises Picard entourés de signes ``%`` et d'autres caractères correspondant textuellement. Pour les noms de balises, vous pouvez utiliser des noms prédéfinis tels que ``%artist%``, ``%album%`` ou ``%title%`` (voir :doc:`/variables/variables`) ou utilisez des noms personnalisés. Vous pouvez sélectionner quelques modèles prédéfinis, mais vous pouvez également les ajuster ou définir les vôtres.

source: If your files for example consist of a track number and track title separated by a space (e.g. :file:`04 Heart of Gold.mp3`) you can use the matching pattern :samp:`%tracknumber% %title%`. Should the track number and title be separated by for example a hyphen like :file:`04 - Heart of Gold.mp3` the pattern needs to also include this separator, like :samp:`%tracknumber% - %title%`.
fr: Si vos fichiers se composent par exemple d'un numéro de piste et d'un titre de piste séparés par un espace (par exemple :file:`04 Heart of Gold.mp3`), vous pouvez utiliser le modèle de correspondance :samp:`%tracknumber% %title%`. Si le numéro de la piste et le titre sont séparés par un trait d'union, comme :file:`04 - Heart of Gold.mp3`, le modèle doit également inclure ce séparateur, comme :samp:`%tracknumber% - %title%`.

source: Clicking on the "Preview" button next to the matching pattern will show a preview of the extracted tags for each file name. Once you are satisfied with the result, you can accept the changes with the "Ok" button. The changed tags will be set for the files. Note that the changes will not be saved automatically, you still need to save the files if you want the tags to be written (see :doc:`save`).
fr: Cliquez sur le bouton "Aperçu" à côté du modèle correspondant pour afficher un aperçu des balises extraites pour chaque nom de fichier. Une fois que vous êtes satisfait du résultat, vous pouvez accepter les modifications avec le bouton "Ok". Les balises modifiées seront définies pour les fichiers. Notez que les modifications ne seront pas enregistrées automatiquement, vous devez tout de même enregistrer les fichiers si vous souhaitez que les balises soient écrites (voir :doc:`save`).

source: Matching folders
fr: Dossiers correspondants

source: The pattern can also match the parent folders of the file. To match for folders use a slash (``/``) as separator. If for example the file is in a folder named after the album, which in turn is inside a folder named after the artist (i.e. :file:`Neil Young/Harvest/04 Heart of Gold.mp3`) you could match the artist, album, track number and title with a pattern of :samp:`%artist%/%album%/%tracknumber% - %title%`.
fr: Le modèle peut également correspondre aux dossiers parents du fichier. Pour faire correspondre les dossiers, utilisez une barre oblique (``/``) comme séparateur. Si par exemple le fichier se trouve dans un dossier nommé d'après l'album, qui à son tour se trouve dans un dossier nommé d'après l'artiste (ex :file:`Neil Young/Harvest/04 Heart of Gold.mp3`), vous pouvez faire correspondre l'artiste, album, numéro de piste et titre avec un modèle de :samp:`%artist%/%album%/%tracknumber% - %title%`.

source: Replace underscores with spaces
fr: Remplacer les traits de soulignement par des espaces

source: Sometimes files have been named without spaces and use underscores instead. For example a file could be named :file:`04_Heart_of_Gold.mp3`. By default the title would get extracted as "Heart_of_Gold". In this case enable the checkbox "Replace underscores with spaces" and use a pattern like :samp:`%tracknumber%_%title%` to extract the title properly as "Heart of Gold".
fr: Parfois, les fichiers ont été nommés sans espaces et utilisent plutôt des traits de soulignement. Par exemple, un fichier pourrait être nommé :file:`04_Heart_of_Gold.mp3`. Par défaut, le titre serait extrait en tant que "Heart_of_Gold". Dans ce cas, cochez la case "Remplacer les traits de soulignement par des espaces" et utilisez un modèle comme :samp:`%tracknumber% _%title%` pour extraire correctement le titre en "Heart of Gold".

source: Ignoring parts of the file name
fr: Ignorer certaines parties du nom de fichier

source: Sometimes you don't want to include parts of the file name in your tags and just want to ignore them. The pattern must always match the entire file name, though. In this case you can use a hidden variable for the parts of the file name you do not want to match to an actual tag. Hidden variables start with an underscore like :samp:`%_dummy%`. This variable will still be available on the file for :doc:`/extending/scripting`, but will not get written to the actual file tags on saving.
fr: Parfois, vous ne souhaitez pas inclure des parties du nom de fichier dans vos balises et souhaitez simplement les ignorer. Le modèle doit toujours correspondre au nom de fichier entier, cependant. Dans ce cas, vous pouvez utiliser une variable masquée pour les parties du nom de fichier que vous ne souhaitez pas faire correspondre à une balise réelle. Les variables masquées commencent par un trait de soulignement comme :samp:`%_dummy%`. Cette variable sera toujours disponible dans le fichier pour :doc:`/extending/scripting`, mais ne sera pas écrite dans les balises réelles du fichier lors de l'enregistrement.

source: One example might be if you want to extract only the track number from a file name like :file:`04 Are You Ready for the Country_.mp3`. Maybe the track number tag is missing in the file, but the title tag is already properly set. You could use the pattern :samp:`%tracknumber% %_filetitle%`. This would extract the ``tracknumber`` tag properly, but would extract the rest of the file name to a hidden variable :samp:`%_filetitle%` which would not get written to the file tags. The name :samp:`%_filetitle%` is arbitrarily chosen, it just needs to start with an underscore.
fr: Un exemple pourrait être si vous souhaitez extraire uniquement le numéro de piste d'un nom de fichier comme :file:`04 Are You Ready for the Country_.mp3`. Peut-être que la balise de numéro de piste est manquante dans le fichier, mais la balise de titre est déjà correctement définie. Vous pouvez utiliser le modèle :samp:`%tracknumber% %_filetitle%`. Cela extraire correctement la balise ``tracknumber``, mais extraire le reste du nom de fichier dans une variable cachée :samp:`%_filetitle%` qui ne sera pas écrite dans les balises de fichier. Le nom :samp:`%_filetitle%` est choisi arbitrairement, il suffit de commencer par un trait de soulignement.

source: Parsing hidden variables from file names is supported since Picard 2.5. Earlier versions would create an actual tag which would get stored to the tags. If you are using a Picard version older than 2.5 you will need to remove the unwanted tags before saving the files.
fr: L'analyse des variables cachées à partir des noms de fichiers est prise en charge depuis Picard 2.5. Les versions antérieures créeraient une balise réelle qui serait stockée dans les balises. Si vous utilisez une version Picard antérieure à 2.5, vous devrez supprimer les balises indésirables avant d'enregistrer les fichiers.
