Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/usage/using.po
Languages: fr, pt_br

source: Using Picard
fr: Utiliser Picard
pt_br: Usando o Picard

source: There are four stages to using Picard to process your audio files:
fr: Il y a quatre étapes pour utiliser Picard pour traiter vos fichiers audio:
pt_br: O processamento dos seus arquivos de áudio no Picard é dividido em quatro etapas:

source: **Retrieving album information from MusicBrainz**
fr: **Récupération des informations sur l'album depuis MusicBrainz**
pt_br: **Recuperando informações do álbum via MusicBrainz**

source: This stage identifies the album on MusicBrainz that will provide the information used for tagging the files, and retrieves the metadata from the MusicBrainz database. There are a few different methods available, depending on the information currently available on your system (e.g.: metadata existing in the files, or having the source CD available).
fr: Cette étape identifie l'album sur MusicBrainz qui fournira les informations utilisées pour baliser les fichiers, et récupère les métadonnées de la base de données MusicBrainz. Il existe différentes méthodes disponibles, en fonction des informations actuellement disponibles sur votre système (par exemple: les métadonnées existant dans les fichiers, ou la disponibilité du CD source).

source: **Matching audio files to tracks**
fr: **Faire correspondre les fichiers audio aux pistes**
pt_br: **Corresponder arquivos de áudio com trilhas**

source: This stage is where individual files are matched to specific tracks in the information retrieved from the MusicBrainz database.
fr: Cette étape est celle où les fichiers individuels sont mis en correspondance avec des pistes spécifiques dans les informations extraites de la base de données MusicBrainz.
pt_br: Este estágio se refere à correspondência dos arquivos individuais a suas trilhas específicas nas informações recuperadas do banco de dados MusicBrainz.

source: **Selecting Cover Art**
fr: **Sélection de la pochette**
pt_br: **Selecionar Capa do Álbum**

source: Depending on the option settings, you can change or confirm the cover art to save with a track or album.
fr: En fonction des paramètres des options, vous pouvez modifier ou confirmer la pochette à enregistrer avec une piste ou un album.
pt_br: Dependendo da opção configurada, você pode mudar ou confirmar a capa antes de salvá-la com a trilha ou álbum.

source: **Saving the updated audio files**
fr: **Enregistrement des fichiers audio mis à jour**
pt_br: **Salvando arquivos de áudio atualizados**

source: This stage is where Picard updates the matched files with the metadata retrieved in the first stage, based on the settings configured in the Options. This may also include renaming the files and placing them in a different directory.
fr: Cette étape est celle où Picard met à jour les fichiers correspondants avec les métadonnées récupérées dans la première étape, en fonction des paramètres configurés dans les Options. Cela peut également inclure le changement de nom des fichiers et leur placement dans un répertoire différent.

source: Details: :doc:`retrieve` / :doc:`match` / :doc:`coverart` / :doc:`save`
fr: Détails: :doc:`retrieve` / :doc:`match` / :doc:`coverart` / :doc:`save`
pt_br: Detalhes: :doc:`retrieve` / :doc:`match` / :doc:`coverart` / :doc:`save`

source: This stage identifies the album on MusicBrainz that will provide the information used for tagging the files, and retrieves the metadata from the MusicBrainz database. There are a few different methods available, depending on the information currently available on your system (e.g.: metadata existing in the files, or having the source CD available).
pt_br: Este estágio identifica o álbum no MusicBrainz, que provê informações utilizadas para etiquetar os arquivos, e requisita os metadados do banco de dados MusicBrainz. Existem diferentes jeitos de se fazer isto, dependendo da informações disponíveis no seu sistema (por exemplo: metadados pré-existentes nos arquivos, ou ter o CD original).

source: This stage is where Picard updates the matched files with the metadata retrieved in the first stage, based on the settings configured in the Options. This may also include renaming the files and placing them in a different directory.
pt_br: Neste estágio o Picard atualiza os arquivos correspondidos com os metadados obtidos na primeira etapa, baseando-se nas configurações em Opções. Isto pode incluir a renomeação de arquivos e movimentação desses para um diretório diferente.
