Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/index.po
Languages: lt, pt_br

source: About Picard
lt: Apie „Picard“
pt_br: Sobre o Picard

source: Getting Started
lt: Pradžia
pt_br: Onde Começar

source: General Usage
lt: Bendras naudojimas
pt_br: Uso Geral

source: Using Picard
lt: Kaip naudoti „Picard“
pt_br: Usando o Picard

source: General Recommendations
lt: Bendrosios rekomendacijos
pt_br: Recomendações Gerais

source: Workflow Recommendations
lt: Darbo eigos rekomendacijos
pt_br: Recomendações de Fluxo de Trabalho

source: Troubleshooting
lt: Trikčių šalinimas
pt_br: Resolvendo Problemas

source: Tutorials
lt: Mokymai
pt_br: Tutoriais

source: Appendices
lt: Priedai
pt_br: Apêndices

source: References
pt_br: Referências

source: **User Guide for MusicBrainz Picard, the next generation tagger.**
lt: **Naudotojo vadovas programai „MusicBrainz Picard“, naujosios kartos žymeklė.**
pt_br: **Guia do Usuário para o MusicBrainz Picard, etiquetador de próxima geração.**

source: MusicBrainz Picard is a cross-platform music file tagger. This User Guide is intended to augment the information provided on the `Picard website <https://picard.musicbrainz.org/>`_ and to provide an alternate format for the documentation, including a PDF document suitable for printing. Links to additional information such as scripts, plugins and tutorials are provided when available rather than trying to reproduce the information in this document.
lt: „MusicBrainz Picard“ – tai tarpplatforminė muzikos failų žymeklė. Šis vartotojo vadovas skirtas papildyti informaciją, pateiktą „Picard“ svetainėje <https://picard.musicbrainz.org/>_, ir pateikti alternatyvų dokumentacijos formatą, įskaitant spausdinimui tinkamą PDF dokumentą. Nuorodos į papildomą informaciją kaip skriptai, papildiniai ir mokymai pateikiamos, kai jos yra pasiekiamos, o ne bandoma atkurti informaciją šiame dokumente.
pt_br: O MusicBrainz picard é um etiquetador multiplataforma. Este Guia do Usuário tem como objetivo prover mais informações além das disponíveis no `site do Picard <https://picard.musicbrainz.org/>`_, além de formatos alternativos, incluindo PDF para impressão. Links para conteúdo adicional como scripts, plugins e tutoriais serão listados invés de se reproduzir neste documento.

source: This documentation is licensed under CC0 1.0. To view a copy of this license, visit `https://creativecommons.org/publicdomain/zero/1.0 <https://creativecommons.org/publicdomain/zero/1.0>`_.
pt_br: Esta documentação é licenciada com CC0 1.0. Para ver uma cópia da licença, visite `http://creativecommons.org/publicdomain/zero/1.0 <http://creativecommons.org/publicdomain/zero/1.0>`_.

source: Video Tutorials
lt: Vaizdo įrašų mokymai
