Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/appendices/command_line.po
Languages: ca, de, fr

source: Appendix C: :index:`Command Line Options <pair: command line; options>`
ca: Annex C: :index:`Opcions de la línia d'ordres <pair: línia d'ordres; opcions>`
fr: Annexe C : :index:`Options de ligne de commande <pair: ligne de commande; options>`

source: Picard can be started from the command line with the following arguments:
ca: Picard es pot iniciar des de la línia d'ordres amb els arguments següents:
de: Picard kann über die Befehlszeile mit den folgenden Argumenten gestartet werden:
fr: Picard peut être démarré à partir de la ligne de commande avec les arguments suivants :

source: where the options are:
ca: Les opcions són:
de: wobei die Optionen sind:
fr: où les options sont :

source: show a help message and exit
ca: Mostra un missatge d'ajuda i surt
de: Hilfe anzeigen und beenden
fr: affiche un message d'aide et quitte

source: audit events passed as a comma-separated list, prefixes supported, use "all" to match any event. See the `Python Documentation <https://docs.python.org/3/library/audit_events.html#audit-events>`_ for more information.
ca: Esdeveniments d'auditoria indicats com a llista separada per comes; s'admeten prefixos, «all» coincideix amb qualsevol esdeveniment. Consulteu la `documentació de Python <https://docs.python.org/3/library/audit_events.html#audit-events>`_ per a més informació.

source: location of the configuration file to use
ca: Ubicació del fitxer de configuració que es farà servir
de: Speicherort der zu verwendenden Konfigurationsdatei
fr: emplacement du fichier de configuration à utiliser

source: enable debug-level logging
ca: Habilita el registre de depuració
de: Debug-Protokollierung aktivieren
fr: active la journalisation au niveau du débogage

source: execute one or more COMMANDs at start-up (see :doc:`../usage/exec_commands` for more information)
ca: Executa una o més ordres en iniciar el programa (consulteu :doc:`../usage/exec_commands` per a més informació)
de: einen oder mehrere BEFEHLe beim Start ausführen (siehe :doc:`../usage/exec_commands` für weitere Informationen)

source: disable built-in media player
ca: Inhabilita el reproductor multimèdia integrat
de: integrierten Mediaplayer deaktivieren
fr: désactiver le lecteur multimédia intégré

source: do not restore window positions or sizes
ca: No restauris la posició i la mida de les finestres
de: Fensterpositionen und -größen nicht wiederherstellen
fr: ne restaure pas la position ou la taille des fenêtres

source: do not load any plugins
ca: No carreguis cap connector
de: Plugins nicht laden
fr: ne chargent aucun plug-in

source: disable the crash dialog
ca: Inhabilita el diàleg de fallada

source: force Picard to create a new, stand-alone instance
ca: Força la creació d'una instància nova i independent de Picard
de: eine neue, eigenständige Instanz erzwingen
fr: forcez Picard à créer une nouvelle instance autonome

source: display the version information and exit
ca: Mostra informació de la versió i surt
de: Versionsinformationen anzeigen und beenden
fr: affiche les informations de version et quitte

source: display the long version information and exit
ca: Mostra informació detallada de la versió i surt
de: Ausführliche Versionsinformationen anzeigen und beenden
fr: affiche les informations de la version longue et quitte

source: one or more files, directories, URLs and MBIDs to load
ca: Un o més fitxers, directoris, URL i MBID que s'han de carregar
de: eine oder mehrere Dateien, Verzeichnisse, URLs und MBIDs zum Laden
fr: un ou plusieurs fichiers, répertoires, URLs et MBIDs à charger

source: Files and directories are specified including the path (either absolute or relative) to the file or directory, and may include drive specifiers. They can also be specified using the ``file://`` prefix. URLs are specified by using either the ``http://`` or ``https://`` prefix. MBIDs are specified in the format ``mbid://<entity_type>/<mbid>`` where ``<entity_type>`` is one of "release", "artist" or "track" and ``<mbid>`` is the MusicBrainz Identifier of the entity.
ca: Els fitxers i directoris s'especifiquen incloent-hi el camí (absolut o relatiu) i poden incloure especificadors d'unitat. També es poden especificar amb el prefix ``file://``. Els URL s'especifiquen amb el prefix ``http://`` o ``https://``. Els MBID s'especifiquen amb el format ``mbid://<tipus_entitat>/<mbid>``, on ``<tipus_entitat>`` és un dels valors «release» (publicació), «artist» (artista) o «track» (pista) i ``<mbid>`` és l'identificador de MusicBrainz de l'entitat.
de: Dateien und Verzeichnisse werden mit dem Pfad (entweder absolut oder relativ) zur Datei oder zum Verzeichnis angegeben und können Laufwerksspezifikationen enthalten. Pfade können auch mit dem Präfix ``file://`` angegeben werden. URLs werden entweder mit dem Präfix ``http://`` oder ``https://`` angegeben. MBIDs werden im Format ``mbid://<entity_type>/<mbid>`` angegeben, wobei ``<entity_type>`` eines von „release“, „artist“ oder „track“ ist und ``<mbid>`` der MusicBrainz-Identifier des Objekts ist.
fr: Les fichiers et les répertoires sont spécifiés en incluant le chemin (absolu ou relatif) vers le fichier ou le répertoire, et peuvent inclure des spécificateurs de lecteur. Ils peuvent également être spécifiés en utilisant le préfixe "file://". Les URLs sont spécifiées en utilisant le préfixe "http://" ou "https://". Les MBID sont spécifiés au format ``mbid://<type_d'entité>/<mbid>`` où ``<type_d'entité>`` est l'un de "release", "artist" ou "track" et ``<mbid>`` est l'identifiant MusicBrainz de l'entité.

source: If a specified item contains a space, it must be enclosed in quotes such as ``"/home/user/music/my song.mp3"``.
ca: Si un element especificat conté un espai, ha d'anar entre cometes, com ara ``"/home/user/música/la meva cançó.mp3"``.
de: Wenn ein angegebenes Element ein Leerzeichen enthält, muss es in Anführungszeichen wie ``„/home/user/music/my song.mp3“`` eingeschlossen werden.
fr: Si un élément spécifié contient un espace, il doit être placé entre guillemets, comme par exemple ``"/home/user/music/my song.mp3"``.

source: execute one or more COMMANDs at start-up (see :doc:`/usage/exec_commands` for more information)
fr: exécuter une ou plusieurs COMMANDs au démarrage (voir :doc:`/usage/exec_commands` pour plus d'informations)
