Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/appendices/keyboard_shortcuts.po
Languages: de

source: Appendix D: :index:`Keyboard Shortcuts <user interface; keyboard shortcuts>`
de: Anhang D: :index:`Tastaturkürzel <Benutzeroberfläche; Tastaturkürzel>`

source: In addition to the standard keyboard shortcuts provided by your operating system for things like text selection, copy and paste, Picard also provides the following:
de: Zusätzlich zu den durch das Betriebssystem bereitgestellten Tastaturkürzel für Textauswahl, Kopieren und Einfügen stellt Picard die folgenden Tastaturkürzel zur Verfügung:

source: Main window
de: Hauptfenster

source: File
de: Datei

source: **Action**
de: **Aktion**

source: Add folder
de: Ordner hinzufügen

source: :kbd:`Ctrl+E`
de: :kbd:`Strg+E`

source: Add files
de: Dateien hinzufügen

source: :kbd:`Ctrl+O`
de: :kbd:`Strg+O`

source: Save selected files
de: Ausgewählte Dateien speichern

source: :kbd:`Ctrl+S`
de: :kbd:`Strg+S`

source: Quit Picard
de: Picard beenden

source: :kbd:`Ctrl+Q`
de: :kbd:`Strg+Q`

source: Edit
de: Bearbeiten

source: Cut selected files
de: Ausgewählte Dateien ausschneiden

source: :kbd:`Ctrl+X`
de: :kbd:`Strg+X`

source: Paste selected files
de: Ausgewählte Dateien einfügen

source: :kbd:`Ctrl+V`
de: :kbd:`Strg+V`

source: Show info for selected item
de: Infos zu ausgewählten Objekten anzeigen

source: :kbd:`Ctrl+I`
de: :kbd:`Strg+I`

source: View
de: Ansicht

source: Toggle file browser
de: Datei-Browser ein-/ausblenden

source: :kbd:`Ctrl+B`
de: :kbd:`Strg+B`

source: Toggle metadata view
de: Metadatenansicht umschalten

source: :kbd:`Ctrl+Shift+M`
de: :kbd:`Strg+Umschalt+M`

source: Options
de: Einstellungen

source: Open file naming script editor
de: Dateibenennungsskripteditor öffnen

source: :kbd:`Ctrl+Shift+S`
de: :kbd:`Strg+Umschalt+S`

source: Open profile editor
de: Profileditor öffnen

source: :kbd:`Ctrl+Shift+P`
de: :kbd:`Strg+Umschalt+P`

source: Tools
de: Extras

source: Refresh
de: Aktualisieren

source: :kbd:`Ctrl+R`
de: :kbd:`Strg+R`

source: Lookup CD
de: CD abfragen

source: :kbd:`Ctrl+K`
de: :kbd:`Strg+K`

source: Lookup
de: Nachschlagen

source: :kbd:`Ctrl+L`
de: :kbd:`Strg+L`

source: Scan
de: Analysieren

source: :kbd:`Ctrl+Y`
de: :kbd:`Strg+Y`

source: Cluster
de: Gruppieren

source: :kbd:`Ctrl+U`
de: :kbd:`Strg+U`

source: Lookup in browser
de: Im Browser nachschlagen

source: :kbd:`Ctrl+Shift+L`
de: :kbd:`Strg+Umschalt+L`

source: Search for similar albums / tracks
de: Nach ähnlichen Alben / Titeln suchen

source: :kbd:`Ctrl+T`
de: :kbd:`Strg+T`

source: Show other album versions
de: Andere Albumversionen anzeigen

source: :kbd:`Ctrl+Shift+O`
de: :kbd:`Strg+Umschalt+O`

source: Generate AcoustID fingerprints
de: AcoustID-Fingerabdrücke generieren

source: :kbd:`Ctrl+Shift+Y`
de: :kbd:`Strg+Umschalt+Y`

source: Tags from file names
de: Tags aus Dateinamen

source: :kbd:`Ctrl+Shift+T`
de: :kbd:`Strg+Umschalt+T`

source: Help
de: Hilfe

source: View activity history
de: Aktivitätshistorie anzeigen

source: :kbd:`Ctrl+H`
de: :kbd:`Strg+H`

source: View error/debug log
de: Fehler-/Debug-Protokoll anzeigen

source: :kbd:`Ctrl+G`
de: :kbd:`Strg+G`

source: Metadata view
de: Metadatenansicht

source: Add new tag
de: Neues Tag hinzufügen

source: :kbd:`Alt+Shift+A`
de: :kbd:`Alt+Umschalt+A`

source: Edit selected tag
de: Ausgewähltes Tag bearbeiten

source: :kbd:`Alt+Shift+E`
de: :kbd:`Alt+Umschalt+E`

source: Remove selected tag
de: Ausgewählte Tags entfernen

source: :kbd:`Alt+Shift+R` |br| |nl| :kbd:`Del`
de: :kbd:`Alt+Umschalt+R` |br| |nl| :kbd:`Entf`

source: :kbd:`⌥+⇧+R` |br| |nl| :kbd:`Del` |br| |nl| :kbd:`⌘+⌫`
de: :kbd:`⌥+⇧+R` |br| |nl| :kbd:`Entf` |br| |nl| :kbd:`⌘+⌫`

source: Copy selected tag value
de: Ausgewählten Tag-Wert kopieren

source: :kbd:`Ctrl+C`
de: :kbd:`Strg+C`

source: Paste to selected tag value
de: In ausgewählten Tag-Wert einfügen

source: Other
de: Sonstige

source: Focus search
de: Suche fokusieren

source: :kbd:`Ctrl+F`
de: :kbd:`Strg+F`

source: Remove selected item
de: Ausgewähltes Objekt entfernen

source: :kbd:`Del`
de: :kbd:`Entf`

source: :kbd:`Del` |br| |nl| :kbd:`⌘+⌫`
de: :kbd:`Entf` |br| |nl| :kbd:`⌘+⌫`

source: Script editor
de: Skript-Editor

source: Show auto completion
de: Autovervollständigung anzeigen

source: :kbd:`Ctrl+Space`
de: :kbd:`Ctrl+Leer`

source: :kbd:`⌃+Space`
de: :kbd:`⌃+Leer`

source: Use selected completion
de: Ausgewählte Vervollständigung verwenden

source: :kbd:`Tab` |br| |nl| :kbd:`Return`
de: :kbd:`Tab` |br| |nl| :kbd:`Eingabe`

source: Hide completions
de: Vervollständigungen ausblenden

source: File naming script editor
de: Dateibenennungsskripteditor

source: Edit script metadata
de: Skript-Metadaten bearbeiten

source: :kbd:`Ctrl+M`
de: :kbd:`Strg+M`

source: Word wrap on/off
de: Wortumbruch an/aus

source: :kbd:`Ctrl+Shift+W`
de: :kbd:`Strg+Umschalt+W`

source: Show/hide help tooltips
de: Hilfe-Tooltips anzeigen / verbergen

source: Show/hide documentation
de: Dokumentation anzeigen / verbergen

source: Help (in browser)
de: Hilfe (im Browser)
