Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/appendices/plugins_api.po
Languages: ca, fr

source: :index:`Appendix A <pair: plugins; programming>`: :index:`Plugins API <pair: plugins; api>`
ca: :index:`Annex A <pair: connectors; programació>`: :index:`API dels connectors <pair: connectors; api>`
fr: :index:`Annexe A <pair: plugins; programmation>`: :index:`API des plugins <pair: plugins; api>`

source: :index:`Plugin Metadata <plugins; metadata>`
ca: :index:`Metadades del connector <connectors; metadades>`
fr: :index:`Métadonnées du plugin <plugins; métadonnées>`

source: Each plugin must provide some metadata as variables. Those variables should be placed at the top of the file.
ca: Cada connector ha de proporcionar algunes metadades com a variables. Aquestes variables s'han de definir a l'inici del fitxer.
fr: Chaque plugin doit fournir des métadonnées sous forme de variables. Ces variables doivent être placées en haut du fichier.

source: Variables explanation:
ca: Explicació de les variables:
fr: Explication des variables :

source: **PLUGIN_NAME** should be a short but descriptive name for the plugin.
ca: **PLUGIN_NAME** ha de ser un nom breu però descriptiu del connector.
fr: **PLUGIN_NAME** doit être un nom court mais descriptif du plugin.

source: **PLUGIN_DESCRIPTION** should be as simple as possible, while still describing the main function. If your plugin targets Picard 2.7 or later you can use `Markdown <https://daringfireball.net/projects/markdown/>`_ syntax to format the text. If your plugin targets earlier versions you can instead use simple HTML formatting. Please restrict the usage of HTML to basic text formatting (e.g. ``<strong>``, ``<em>``), links (``<a>``) and lists (``<ul>``, ``<ol>``).
ca: **PLUGIN_DESCRIPTION** ha de ser tan senzill com sigui possible i alhora descriure la funció principal. Si el connector està dissenyat per a Picard 2.7 o posterior, podeu fer servir sintaxi `Markdown <https://daringfireball.net/projects/markdown/>`_ per a formatar el text. Si el connector està dissenyat per a versions anteriors, podeu fer servir format HTML senzill. Limiteu l'ús d'HTML a format de text bàsic (p. ex., ``<strong>``, ``<em>``), enllaços (``<a>``) i llistes (``<ul>``, ``<ol>``).

source: **PLUGIN_VERSION** should be filled with the version of Plugin. Plugin versions should be in the format ``x.y.z`` (e.g.: "1.0" or "2.12.4"). It is recommended that you use `Semantic Versioning <https://semver.org/>`_.
ca: **PLUGIN_VERSION** ha de contenir la versió del connector. Les versions dels connectors han de seguir el format ``x.y.z`` (p. ex., «1.0» o «2.12.4»). Es recomana que feu servir la `numeració de versions semàntica <https://semver.org/>`_.
fr: **PLUGIN_VERSION** doit être rempli avec la version de le Plug-in. Les versions de plug-in doivent être au format ``x.y.z`` (par exemple : "1.0" ou "2.12.4"). Il est recommandé d'utiliser `Semantic Versioning <https://semver.org/>`_.

source: **PLUGIN_API_VERSIONS** should be set to the versions of Picard this plugin to run with. New Picard versions will usually support older plugin API versions, but on breaking changes support for older plugin versions can be dropped. Versions available for Picard 2 are "2.0", "2.1" and "2.2".
ca: **PLUGIN_API_VERSIONS** ha de contenir les versions de Picard amb què s'executarà el connector. Les versions de Picard noves normalment seran compatibles amb versions anteriors de l'API de connectors, però la compatibilitat amb versions anteriors dels connectors pot desaparèixer si hi ha canvis de funcionament. Les versions disponibles per a Picard 2 són «2.0», «2.1» i «2.2».
fr: **PLUGIN_API_VERSIONS** doit être défini sur les versions de Picard avec lesquelles s'exécuter ce plugin. Les nouvelles versions de Picard prendront généralement en charge les anciennes versions de l'API de plug-in, mais en cas de modification, la prise en charge des anciennes versions de plug-in peut être abandonnée. Les versions disponibles pour Picard 2 sont "2.0", "2.1" et "2.2".

source: **PLUGIN_LICENSE** should be set with the license name of the plugin. If possible use one of the license names from the `SPDX License List <https://spdx.org/licenses/>`_, but you are welcomed to use another license if the one you chose is not available in the list.
ca: **PLUGIN_LICENSE** ha de contenir el nom de la llicència del connector. Si és possible, feu servir un nom de llicència de la `llista de llicències de l'SPDX <https://spdx.org/licenses/>`_, però podeu fer-ne servir un altre si la llicència que heu triat no està disponible a la llista.
fr: **PLUGIN_LICENSE** doit être défini avec le nom de licence du plugin. Si possible, utilisez l'un des noms de licence de la `Liste des licences SPDX <https://spdx.org/licenses/>`_, mais vous êtes invités à utiliser une autre licence si celle que vous avez choisie n'est pas disponible dans la liste.

source: **PLUGIN_LICENSE_URL** should be set to a URL pointing to the full license text.
ca: **PLUGIN_LICENSE_URL** ha de ser un URL al text complet de la llicència.
fr: **PLUGIN_LICENSE_URL** doit être défini sur une URL pointant vers le texte complet de la licence.

source: **PLUGIN_USER_GUIDE_URL** should be set to a URL pointing to the documentation for the plugin. This variable is optional and may be omitted. If a URL is provided, it will be shown as a clickable link in the description displayed for the plugin in the Plugins option settings screen.
ca: **PLUGIN_USER_GUIDE_URL** ha de contenir un URL a la documentació del connector. Aquesta variable és opcional i es pot ometre. Si es proporciona un URL, es mostrarà com a enllaç clicable a la descripció del connector a la pantalla de paràmetres dels connectors.

source: :index:`Metadata Processors <plugins; metadata processors>`
ca: :index:`Processadors de metadades <connectors; processadors de metadades>`
fr: :index:`Processeurs de métadonnées <plugins; processeurs de métadonnées>`

source: MusicBrainz metadata can be post-processed at two levels, album and track. The types of the arguments passed to the processor functions in the following examples are as follows:
ca: Les metadades de MusicBrainz es poden postprocessar en dos nivells, àlbum i pista. Els tipus d'arguments especificats per a les funcions de processament dels exemples següents són:
fr: Les métadonnées MusicBrainz peuvent être post-traitées à deux niveaux, album et piste. Les types d'arguments passés aux fonctions de processeur dans les exemples suivants sont les suivants :

source: **album**: ``picard.album.Album``
ca: **àlbum**: ``picard.album.Album``

source: **metadata**: ``picard.metadata.Metadata``
ca: **metadades**: ``picard.metadata.Metadata``

source: **release**: ``dict`` with release data from MusicBrainz JSON web service
ca: **publicació**: ``dict`` amb les dades d'una publicació del servei web JSON de MusicBrainz
fr: **release** : ``dict`` avec les données de version du service Web MusicBrainz JSON

source: **track**: ``dict`` with track data from MusicBrainz JSON web service
ca: **pista**: ``dict`` amb les dades d'una pista del servei web JSON de MusicBrainz
fr: **track** : ``dict`` avec les données de piste du service Web MusicBrainz JSON

source: Album metadata example:
ca: Exemple de metadades d'un àlbum:
fr: Exemple de métadonnées d'album :

source: Track metadata example:
ca: Exemple de metadades d'una pista:
fr: Exemple de Suivre les métadonnées :

source: :index:`Event Hooks <pair: plugins; event hooks>`
ca: :index:`Ganxos d'esdeveniment <pair: connectors; ganxos d'esdeveniment>`
fr: :index:`Crochets d'événement <pair: plugins; hooks d'événement>`

source: Plugins can register themselves to listen for different events. Currently the following event hooks are available:
ca: Els connectors es poden registrar per a escoltar diferents esdeveniments. Actualment, hi ha disponibles els ganxos d'esdeveniment següents:
fr: Les plugins peuvent s'enregistrer pour écouter différents événements. Actuellement, les hooks d'événement suivants sont disponibles :

source: file_post_load_processor(file)
ca: file_post_load_processor(fitxer)

source: This hook is called after a file has been loaded into Picard. This could for example be used to load additional data for a file. Usage:
ca: Aquest ganxo es crida després de carregar un fitxer a Picard. Es pot fer servir, per exemple, per a carregar dades addicionals d'un fitxer. Ús:
fr: Ce hook est appelé après le chargement d'un fichier dans Picard. Cela pourrait par exemple être utilisé pour charger des données supplémentaires pour un fichier. Usage :

source: file_post_save_processor(file)
ca: file_post_save_processor(fitxer)

source: This hook is called after a file has been saved. This can for example be used to run additional post-processing on the file or write extra data. Note that the file's metadata is already the newly saved metadata. Usage:
ca: Aquest ganxo es crida després de desar un fitxer. Això es pot fer servir, per exemple, per a executar un postprocessament addicional sobre el fitxer o escriure-hi dades addicionals. Tingueu en compte que les metadades del fitxer ja són les metadades acabades de desar. Ús:
fr: Ce hook est appelé après l'enregistrement d'un fichier. Cela peut par exemple être utilisé pour exécuter un post-traitement supplémentaire sur le fichier ou écrire des données supplémentaires. Notez que les métadonnées du fichier sont déjà les métadonnées nouvellement enregistrées. Usage :

source: file_post_addition_to_track_processor(track, file)
ca: file_post_addition_to_track_processor(pista, fitxer)

source: This hook is called after a file has been added to a track (on the right-hand pane of Picard).
ca: Aquest ganxo es crida després d'afegir un fitxer a una pista (a la subfinestra dreta de Picard).
fr: Ce hook est appelé après qu'un fichier a été ajouté à une piste (dans le volet de droite de Picard).

source: file_post_removal_from_track_processor(track, file)
ca: file_post_removal_from_track_processor(pista, fitxer)

source: This hook is called after a file has been removed from a track (on the right-hand pane of Picard).
ca: Aquest ganxo es crida després de suprimir un fitxer d'una pista (a la subfinestra dreta de Picard).
fr: Ce hook est appelé après qu'un fichier a été supprimé d'une piste (dans le volet droit de Picard).

source: album_post_removal_processor(album)
ca: album_post_removal_processor(àlbum)

source: This hook is called after an album has been removed from Picard.
ca: Aquest ganxo es crida després de suprimir un àlbum de Picard.
fr: Ce hook est appelé après qu'un album a été supprimé de Picard.

source: Event hooks have been available since API version 2.2.
ca: Els ganxos d'esdeveniment han estat disponibles des de la versió 2.2 de l'API.
fr: Les hooks d'événement sont disponibles depuis la version 2.2 de l'API.

source: :index:`File Formats <pair: plugins; file format>`
ca: :index:`Formats de fitxer <pair: connectors; format de fitxer>`
fr: :index:`Formats de fichiers <pair: plugins; format de fichier>`

source: Plugins can extend Picard with support for additional file formats. See the existing `file format implementations <https://github.com/metabrainz/picard/tree/master/picard/formats>`_ for details on how to implement the ``_load`` and ``_save`` methods. Example:
ca: Els connectors poden ampliar Picard amb compatibilitat amb formats de fitxer addicionals. Consulteu les `implementacions de formats de fitxer <https://github.com/metabrainz/picard/tree/master/picard/formats>`_ existents per a veure més detalls sobre com implementar els mètodes ``_load`` i ``_save``. Exemple:
fr: Les plugins peuvent étendre Picard avec la prise en charge de formats de fichiers supplémentaires. Voir les `implémentations de format de fichier existantes <https://github.com/metabrainz/picard/tree/master/picard/formats>`_ pour plus de détails sur la façon d'implémenter les méthodes ``_load`` et ``_save``. Exemple :

source: :index:`Tagger Script Functions <pair: scripting functions; plugins>`
ca: :index:`Funcions de scripts d'etiquetatge <pair: funcions de scripts; connectors>`
fr: :index:`Fonctions de script de tagger <pair: fonctions de script; plugins>`

source: To define new tagger script functions use ``register_script_function(function, name=None)`` from the ``picard.script`` module. ``parser`` is an instance of ``picard.script.ScriptParser``, and the rest of the arguments passed to it are the arguments from the function call in the tagger script. Example:
ca: Per a definir funcions noves de scripts d'etiquetatge, feu servir ``register_script_function(funció, name=None)`` del mòdul ``picard.script``. ``parser`` és una instància de ``picard.script.ScriptParser`` i la resta d'arguments especificats són els arguments de la crida a la funció a l'script d'etiquetatge. Exemple:
fr: Pour définir de nouvelles fonctions de script de tagger, utilisez ``register_script_function (function, name = None)`` du module ``picard.script``. ``parser`` est une instance de ``picard.script.ScriptParser``, et le reste des arguments qui lui sont passés sont les arguments de l'appel de fonction dans le script du tagger. Exemple :

source: ``register_script_function`` supports two optional arguments:
ca: ``register_script_function`` admet dos arguments opcionals:
fr: ``register_script_function`` prend en charge deux arguments optionnels :

source: **eval_args**: If this is **False**, the arguments will not be evaluated before being passed to **function**.
ca: **eval_args**: si això és **False**, els arguments no s'avaluaran abans d'enviar-se a **funció**.
fr: **eval_args** : Si c'est **False**, les arguments ne seront pas évalués avant d'être passés à **function**.

source: **check_argcount**: If this is **False** the number of arguments passed to the function will not be verified.
ca: **check_argcount**: si això és **False**, no es comprovarà el nombre d'arguments enviats a la funció.
fr: **check_argcount** : Si c'est **False**, le nombre d'arguments passés à la fonction ne sera pas vérifié.

source: The default value for both arguments is **True**.
ca: El valor per defecte de tots dos arguments és **True**.
fr: La valeur par défaut des deux arguments est **True**.

source: :index:`Context Menu Actions <pair: plugins; context menu actions>`
ca: :index:`Accions del menú contextual <pair: connectors; accions del menú contextual>`
fr: :index:`Actions du menu contextuel <pair: plugins; actions du menu contextuel>`

source: Right-click context menu actions can be added to albums, tracks and files in "Unmatched Files", "Clusters" and the "ClusterList" (parent folder of Clusters). Example:
ca: Es poden afegir accions al menú contextual de clic dret per a àlbums, pistes i fitxers a «Fitxers sense coincidències», «Agrupacions» i «Llista d'agrupacions» (la carpeta principal de les agrupacions). Exemple:
fr: Les actions du menu contextuel du clic droit peuvent être ajoutées aux albums, pistes et fichiers dans "Fichiers sans correspondance", "Clusters" et "ClusterList" (dossier parent des clusters). Exemple :

source: Use ``register_x_action`` where 'x' is "*album*", "*track*", "*file*", "*cluster*" or "*clusterlist*".
ca: Feu servir ``register_x_action``, on «x» és «*album*», «*track*», «*file*», «*cluster*» or «*clusterlist*».
fr: Utilisez ``register_x_action`` où 'x' est "*album*", "*track*", "*file*", "*cluster*" ou "*clusterlist*".

source: **PLUGIN_DESCRIPTION** should be as simple as possible, while still describing the main function. If your plugin targets Picard 2.7 or later you can use `Markdown <https://daringfireball.net/projects/markdown/>`_ syntax to format the text. If your plugin targets earlier versions you can instead use simple HTML formatting. Please restrict the usage of HTML to basic text formatting (e.g. ``<strong>``, ``<em>``), links (``<a>``) and lists (``<ul>``, ``<ol>``).
fr: **PLUGIN_DESCRIPTION** doit être aussi simple que possible, tout en décrivant la fonction principale. Si votre plugin est destiné à Picard 2.7 ou plus, vous pouvez utiliser la syntaxe `Markdown <https://daringfireball.net/projects/markdown/>`_ pour formater le texte. Si votre plugin cible des versions antérieures, vous pouvez à la place utiliser un simple formatage HTML. Veuillez limiter l'utilisation du HTML au formatage de base du texte (par exemple, ``<strong>``, ``<em>``), aux liens (``<a>``) et aux listes (``<ul>``, ``<ol>``).
