Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/variables/tags_advanced.po
Languages: fr

source: :index:`Advanced Tags <tags; advanced>`
fr: :index:`Balises avancées <balises; avancées>`

source: You can make additional tags available by enabling the :doc:`Use track relationships <../config/options_metadata>` and/or the :doc:`Use genres from MusicBrainz <../config/options_genres>` settings in Picard.
fr: Vous pouvez rendre des balises supplémentaires disponibles en activant les paramètres :doc:`Utiliser les relations entre les pistes <../config/options_metadata>` et :doc:`Utiliser les genres à partir de MusicBrainz <../config/options_genres>` dans Picard.

source: Some tags provide the :index:`MusicBrainz Identifier (MBID) <identifier; musicbrainz, mbid>` of the entity. The MBID is a 32-character identifier assigned to an entity (e.g.: artist, album, track or work) to uniquely identify the entity. For more information about MBIDs, please see the `MusicBrainz Identifier <https://musicbrainz.org/doc/MusicBrainz_Identifier>`_ page in the MusicBrainz documentation.
fr: Certaines balises fournissent le :index:`Identifiant MusicBrainz (MBID) <identifiant; musicbrainz, mbid>` de l'entité. Le MBID est un identifiant de 32 caractères attribué à une entité (par exemple : un artiste, un album, une piste ou une œuvre) afin de l'identifier de manière unique. Pour plus d'informations sur les MBID, veuillez consulter la page `Identifiant MusicBrainz <https://musicbrainz.org/doc/MusicBrainz_Identifier>`_ dans la documentation MusicBrainz.

source: Tags will not be created and will not be available as variables if there was no value retrieved for the tag from the MusicBrainz database.
fr: Les balises ne seront pas créées et ne seront pas disponibles en tant que variables si aucune valeur n'a été récupérée pour la balise dans la base de données MusicBrainz.

source: Some of these tags are only supported for certain file types or tag formats. Please see the :doc:`Picard Tag Mapping <../appendices/tag_mapping>` section for details.
fr: Certaines de ces balises ne sont prises en charge que pour certains types de fichiers ou formats de balises. Veuillez consulter la section :doc:`Cartographie des étiquettes Picard <../appendices/tag_mapping>` pour plus de détails.

source: Track Relationship Tags
fr: Balises de relation de suivi

source: If you enable "Use track relationships" in the Option settings, you get these extra tags:
fr: Si vous activez l'option "Utiliser les relations de suivi" dans les paramètres de l'option, vous obtiendrez ces balises supplémentaires :

source: The names of the arrangers associated with the track. These can include the instrument and orchestra arrangers, and could be associated with the release, recording or work. (*since Picard 0.10*)
fr: Les noms des arrangeurs associés à la piste. Il peut s'agir d'arrangeurs d'instruments et d'orchestres, et ils peuvent être associés à la publication, à l'enregistrement ou à l'œuvre. (*depuis Picard 0.10*)

source: The names of the composers for the associated work.
fr: Les noms des compositeurs de l'œuvre associée.

source: The sort names of the composers for the associated work.
fr: Les noms de tri des compositeurs de l'œuvre associée.

source: The names of the conductors associated with the track. These can include the conductor and chorus master, and could be associated with the release or recording.
fr: Les noms des chefs d'orchestre associés à la piste. Il peut s'agir du chef d'orchestre et du chef de chœur, et peut être associé à la publication ou à l'enregistrement.

source: The director of a track as provided by the *Video Director* or *Audio Director* relationship in MusicBrainz. (*Since Picard 2.6, updated in Picard 2.9*)
fr: Le réalisateur d'une piste tel que fourni par la relation *Video Director* ou *Audio Director* dans MusicBrainz. (*Depuis Picard 2.6, mis à jour dans Picard 2.9*)

source: The names of the DJ mixers for the track. (*since Picard 0.9*)
fr: Les noms des DJ mixeurs pour la piste. (*depuis Picard 0.9*)

source: The names of the engineers associated with the track.
fr: Les noms des ingénieurs associés à la piste.

source: Work lyric language as per `ISO 639-3 <https://en.wikipedia.org/wiki/ISO_639-3>`_ if a related work exists. (*since Picard 0.10*)
fr: Langage lyrique de travail selon `ISO 639-3 <https://wikipedia.org/wiki/ISO_639-3>`_ si un travail connexe existe. (*depuis Picard 0.10*)

source: The licenses associated with the track, either through the release or recording relationships. (*since Picard 1.0*)
fr: Les licences associées à la piste, soit par le biais de la libération ou des relations d'enregistrement. (*depuis Picard 1.0*)

source: The names of the lyricists for the associated work.
fr: Les noms des paroliers de l'œuvre associée.

source: The names of the "*Mixed By*" engineers associated with the track. (*since Picard 0.9*)
fr: Les noms des ingénieurs "*Mélangé par*" associés à la piste. (*depuis Picard 0.9*)

source: The MBID for the Work if a related work exists.
fr: L'MBID de l'œuvre s'il existe une œuvre connexe.

source: The names of the performers for the specified type. These types include:
fr: Les noms des interprètes pour le type spécifié. Ces types comprennent :

source: vocals or instruments for the associated release or recording, where <type> can be "*vocal*", "*guest guitar*", "*solo violin*", etc.
fr: des voix ou des instruments pour la sortie ou l'enregistrement associé, où <type> peut être "*voix*", "*guitare invitée*", "*violon solo*", etc.

source: the orchestra for the associated release or recording, where <type> is "*orchestra*"
fr: l'orchestre de la publication ou de l'enregistrement associé, où <type> est "*orchestre*"

source: the concert master for the associated release or recording, where <type> is "*concertmaster*"
fr: le master de concert pour la publication ou l'enregistrement associé, où <type> est "*concertmaster*"

source: The names of the producers for the associated release or recording.
fr: Les noms des producteurs pour la sortie ou l'enregistrement associé.

source: The names of the remixer engineers associated with the track.
fr: Les noms des ingénieurs remixeurs associés à la piste.

source: The name of the work associated with the track. (*since Picard 1.3*)
fr: Le nom de l'œuvre associée à la piste. (*depuis Picard 1.3*)

source: A multi-value tag containing the names of the writers associated with the related work. (*since Picard 1.0*). This is not written to most file formats automatically. You can merge this with composers with a script like:
fr: Une balise multi-valeurs contenant les noms des écrivains associés au travail en question. (*depuis Picard 1.0*). Cette balise n'est pas écrite automatiquement dans la plupart des formats de fichiers. Vous pouvez la fusionner avec les compositeurs à l'aide d'un script tel que :

source: Some tags such as **performer** are available as both track and release level relationships, and the values may be different depending on which relationship options are enabled.
fr: Certains tags tels que **performer** sont disponibles à la fois pour les relations au niveau de la piste et de la version, et les valeurs peuvent être différentes en fonction des options de relations activées.

source: :index:`Genre Tags <tags; genre>`
fr: :index:`Balises de genre <balises; de genre>`

source: If you enable "Use genres from MusicBrainz", you get:
fr: Si vous activez "Utiliser les genres de MusicBrainz", vous obtenez :

source: A multi-value tag containing the specified genre information from MusicBrainz (*since Picard 2.1, earlier versions used folksonomy tags*)
fr: Une étiquette à valeurs multiples contenant les informations sur le genre spécifié provenant de MusicBrainz (*depuis Picard 2.1, les versions antérieures utilisaient des étiquettes folksonomiques*).
