Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/troubleshooting/does_not_start.po
Languages: fr

source: :index:`Picard won't start <troubleshooting; program won't start>`
fr: :index:`Picard ne démarre pas <dépannage; le programme ne démarre pas>`

source: If you find that Picard won't start there are a few common possible reasons, and things to try to correct the issue. Before doing anything drastic, it is recommended that you try to start Picard from the command line with the ``-d`` option to generate the debug logging. This process is described in the :doc:`troubleshooting` section. If the resulting logs don't provide any clues as to the problem, it may be one of the following:
fr: Si vous constatez que Picard ne démarre pas, il y a quelques raisons possibles courantes et des choses à essayer pour corriger le problème. Avant de faire quelque chose de radical, il est recommandé d'essayer de démarrer Picard à partir de la ligne de commande avec l'option ``-d`` pour générer la journalisation du débogage. Ce processus est décrit dans la section :doc:`troubleshooting`. Si les journaux résultants ne fournissent aucun indice sur le problème, il peut s'agir de l'un des éléments suivants:

source: **The program files have become corrupted**
fr: **Les fichiers du programme sont corrompus**

source: If you suspect that this may be the problem, the first (and simplest) thing to try is to reinstall the program. This should address any potential file corruption issues. If Picard still won't start then it is unlikely that this was the problem.
fr: Si vous pensez que cela peut être le problème, la première chose (et la plus simple) à essayer est de réinstaller le programme. Cela devrait résoudre tous les problèmes potentiels de corruption de fichiers. Si Picard ne démarre toujours pas, il est peu probable que ce soit le problème.

source: **A plugin file has become corrupted or is incompatible**
fr: **Un fichier de plugin est corrompu ou est incompatible**

source: To check whether one of the plugin files has become corrupted or, in the case of a recent upgrade to a plugin or Picard, a plugin is not compatible, you should try removing all of the plugins and then start Picard. Since you won't be able to disable or remove the plugins using Picard's 'Option' settings, you will need to remove them manually. The plugins may be located in a ``plugins`` subdirectory of the directory where the Picard program file is stored, or in a user-specific directory:
fr: Pour vérifier si l'un des fichiers du plugin est corrompu ou, dans le cas d'une mise à jour récente vers un plugin ou Picard, un plugin n'est pas compatible, vous devriez essayer de supprimer tous les plugins puis démarrer Picard. Étant donné que vous ne pourrez pas désactiver ou supprimer les plugins en utilisant les paramètres 'Option' de Picard, vous devrez les supprimer manuellement. Les plugins peuvent être situés dans un sous-répertoire ``plugins`` du répertoire où est stocké le fichier programme Picard, ou dans un répertoire spécifique à l'utilisateur:

source: Once you have located the plugin files, they should be removed from the ``plugins`` directory and moved to a temporary directory. Then try to start Picard. If the program starts, you should try restoring the plugin files from your temporary directory one at a time, and check if Picard will start. This will help identify the plugin that was causing the problem.
fr: Une fois que vous avez localisé les fichiers du plugin, ils doivent être supprimés du répertoire ``plugins`` et déplacés vers un répertoire temporaire. Alors essayez de démarrer Picard. Si le programme démarre, vous devriez essayer de restaurer les fichiers du plugin à partir de votre répertoire temporaire un par un, et vérifier si Picard va démarrer. Cela aidera à identifier le plugin à l'origine du problème.

source: **The option settings file has become corrupted or is incompatible**
fr: **Le fichier de paramètres d'options est corrompu ou est incompatible**

source: To check whether Picard's option settings file has become corrupted or, in the case of a recent upgrade to Picard, it is not compatible, you should try removing the settings file and then start Picard. If Picard is started without finding its configuration settings file, it will create a new one using the default settings. The settings file is called :file:`Picard.ini` and can be found in a user-specific directory:
fr: Pour vérifier si le fichier de paramètres d'options de Picard est corrompu ou, dans le cas d'une mise à niveau récente vers Picard, il n'est pas compatible, vous devez essayer de supprimer le fichier de paramètres, puis démarrer Picard. Si Picard est démarré sans trouver son fichier de paramètres de configuration, il en créera un nouveau en utilisant les paramètres par défaut. Le fichier de paramètres s'appelle :file:`Picard.ini` et se trouve dans un répertoire spécifique à l'utilisateur:

source: Again, it is recommended that you move the file to a temporary directory so that it can be recovered if this turns out not to be the cause of the problem.
fr: Encore une fois, il est recommandé de déplacer le fichier vers un répertoire temporaire afin qu'il puisse être récupéré si cela ne s'avère pas être la cause du problème.

source: **There really is a bug in Picard**
fr: **Il y a vraiment un bug en Picard**

source: If this problem started just after updating Picard, in spite of all the testing that is performed prior to releasing a new version, it may be possible that this is indeed a bug. In that case, you should first try to reinstall the previous version to ensure that it works and that the problem is only occurring with the new version. Then you should report the issue, following the steps outlined in the "Reporting a Bug" topic of the :doc:`troubleshooting` section. Please be sure to include as much information as possible, which will help the developers to locate and fix the problem.
fr: Si ce problème a commencé juste après la mise à jour de Picard, malgré tous les tests effectués avant la sortie d'une nouvelle version, il se peut qu'il s'agisse bien d'un bogue. Dans ce cas, vous devez d'abord essayer de réinstaller la version précédente pour vous assurer qu'elle fonctionne et que le problème ne se produit qu'avec la nouvelle version. Ensuite, vous devez signaler le problème, en suivant les étapes décrites dans la rubrique "Signaler un bogue" de la section :doc:`troubleshooting`. Veillez à inclure autant d'informations que possible, ce qui aidera les développeurs à localiser et à résoudre le problème.
