Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/troubleshooting/troubleshooting.po
Languages: fr

source: :index:`General Troubleshooting <troubleshooting; general>`
fr: :index:`Dépannage général <dépannage; général>`

source: Getting Help
fr: Obtenir de l'aide

source: If you have problems using Picard, please first check the following resources:
fr: Si vous rencontrez des problèmes lors de l'utilisation de Picard, veuillez d'abord consulter les ressources suivantes:

source: For general usage information see the :doc:`/usage/using` documentation and the `illustrated quick start guide <https://picard.musicbrainz.org/quick-start/>`_.
fr: Pour des informations générales sur l'utilisation, consultez la documentation :doc:`/usage/using` et le `guide de démarrage rapide illustré <https://picard.musicbrainz.org/docs/quick-start/>`_.

source: Read the :doc:`FAQ section </faq/faq>` for common questions and problems.
fr: Lisez la :doc:`section FAQ </faq/faq>` pour les questions et problèmes courants.

source: Consult the `community forums <https://community.metabrainz.org/c/picard>`_.
fr: Consultez les `forums de la communauté <https://community.metabrainz.org/c/picard>`_.

source: Check the `download page <https://picard.musicbrainz.org/downloads/>`_ for a newer version of Picard which might solve your problem.
fr: Consultez la `page de téléchargement <https://picard.musicbrainz.org/downloads/>`_ pour une version plus récente de Picard qui pourrait résoudre votre problème.

source: If the problem is to do with a plugin, check the `Picard Plugins <https://picard.musicbrainz.org/plugins/>`_ for updated plugin versions.
fr: Si le problème est lié à un plugin, vérifiez les `Plugins Picard <https://picard.musicbrainz.org/plugins/>`_ pour les versions mises à jour du plugin.

source: :index:`Reporting a Bug <troubleshooting; reporting a bug>`
fr: :index:`Signaler un bogue <dépannage; signaler un bug>`

source: If you think you have found a bug please check whether you are using the latest version of Picard and whether the bug has already been reported in the `bug tracker <https://tickets.musicbrainz.org/browse/PICARD>`_. If you're not sure or don't want to look through the existing tickets, ask on the community forums first.
fr: Si vous pensez avoir trouvé un bogue, veuillez vérifier si vous utilisez la dernière version de Picard et si le bogue a déjà été signalé dans le `bug tracker <https://tickets.musicbrainz.org/browse/PICARD>`_. Si vous n'êtes pas sûr ou ne souhaitez pas consulter les tickets existants, demandez d'abord sur les forums de la communauté.

source: If you're still convinced you have found a new bug, open a `new ticket <https://tickets.musicbrainz.org/secure/CreateIssue.jspa?pid=10042&issuetype=1>`_ providing the following information:
fr: Si vous êtes toujours convaincu d'avoir trouvé un nouveau bogue, ouvrez un `nouveau ticket <https://tickets.musicbrainz.org/secure/CreateIssue.jspa?pid=10042&issuetype=1>`_ fournissant les informations suivantes:

source: Which version of Picard do you use? ("Affects Version" in the form)
fr: Quelle version de Picard utilisez-vous? ("Affecte la version" dans le formulaire)

source: Which operating system do you use? ("Environment" in the form)
fr: Quel système d'exploitation utilisez-vous? ("Environnement" dans le formulaire)

source: What did you do when the bug occurred?
fr: Qu'avez-vous fait lorsque le bogue est survenu?

source: What actually happened, and what did you expect to happen?
fr: Que s'est-il réellement passé, et à quoi vous attendiez-vous?

source: If you're using plugins, which plugins do you have enabled?
fr: Si vous utilisez des plugins, quels plugins avez-vous activés?

source: The **"Debug"** level log from the Picard session demonstrating the problem.
fr: Le journal de niveau **"Debug "** de la session Picard démontrant le problème.

source: Please remember to first remove any personal and confidential information like user id, passwords or authorization tokens before posting or submitting any log output.
fr: N'oubliez pas de supprimer d'abord toutes les informations personnelles et confidentielles telles que l'identifiant d'utilisateur, les mots de passe ou les jetons d'autorisation avant de publier ou de soumettre une sortie de journal.

source: :index:`Getting a Debug Log <troubleshooting; get debug log>`
fr: :index:`Obtention d'un journal de débogage <dépannage; obtenir le journal de débogage>`

source: For many bugs, it helps developers to have a debug log from Picard. You can see the log by going to :menuselection:`"Help --> View Log"`. You can also get a full debug log, which is better because it contains more detailed information. Pasting this log into your forum post or bug ticket can help developers and other users to resolve your issue more quickly. To retrieve the full debug log:
fr: Pour de nombreux bogues, il est utile aux développeurs d'avoir un journal de débogage de Picard. Vous pouvez voir le journal en allant à :menuselection:`"Aide --> Voir le journal"`. Vous pouvez également obtenir un journal de débogage complet, ce qui est préférable car il contient des informations plus détaillées. Le fait de coller ce journal dans votre message sur le forum ou dans votre ticket de bogue peut aider les développeurs et les autres utilisateurs à résoudre votre problème plus rapidement. Pour récupérer le journal de débogage complet :

source: Start Picard.
fr: Commencez Picard.

source: Open the log view with :menuselection:`"Help --> View Log"`.
fr: Ouvrez la vue du journal avec :menuselection:`"Aide --> Voir le journal"`.

source: Change the log level :guilabel:`verbosity` to **Debug**.
fr: Changez le niveau de log :guilabel:`verbosité` en **Debug**.

source: Close the log viewer.
fr: Fermez le visualiseur de journaux.

source: Close and restart Picard.
fr: Fermer et redémarrer Picard.

source: Repeat the action that caused the problem being reported.
fr: Répétez l'action qui a causé le problème signalé.

source: Open the log viewer and copy the output to paste into the forum post or bug ticket. Alternately, you can save the log to a file to attach to your bug report by using the :guilabel:`Save As...` button.
fr: Ouvrez la visionneuse de logs et copiez la sortie pour la coller dans le message du forum ou dans le rapport de bogue. Alternativement, vous pouvez enregistrer le journal dans un fichier à joindre à votre rapport de bogue en utilisant le bouton :guilabel:`Enregistrer sous...`.

source: Close the log viewer, and close Picard.
fr: Fermez le visualisateur de journaux et fermez Picard.

source: :index:`Getting Logs in Case of Crashes <troubleshooting; getting log for crashes>`
fr: :index:`Importer les logs en cas de crash <dépannage; obtenir les logs en cas de crash>`

source: In some cases the problem will cause Picard to crash and not allow you to access the resulting log from the log viewer. You can still generate a log output to attach to your report by starting Picard with the ``--debug`` command line option from a command / terminal window and copying the log output information from the terminal. The steps to follow for each of the supported platforms are:
fr: Dans certains cas, le problème entraînera le plantage de Picard et ne vous permettra pas d'accéder au journal résultant à partir du visualisateur de journaux. Vous pouvez toujours générer une sortie de journal à joindre à votre rapport en démarrant Picard avec l'option de ligne de commande ``--debug`` à partir d'une fenêtre de commande / terminal et en copiant les informations de sortie de journal à partir du terminal. Les étapes à suivre pour chacune des plateformes supportées sont les suivantes :

source: Windows Systems
fr: Systèmes Windows

source: First open a command window by clicking the search icon on the Windows Taskbar and enter "cmd". Then start Picard by entering the following in the command window:
fr: Ouvrez d'abord une fenêtre de commande en cliquant sur l'icône de recherche dans la barre des tâches de Windows et entrez "cmd". Démarrez ensuite Picard en saisissant la commande suivante dans la fenêtre de commande :

source: This will display all log entries in the command window, and allow you to copy the information to the clipboard to paste into your report.
fr: Cela affichera toutes les entrées du journal dans la fenêtre de commande et vous permettra de copier les informations dans le presse-papiers pour les coller dans votre rapport.

source: This method will only work with the installed version of Picard. It will not work with the portable or Windows Store versions.
fr: Cette méthode ne fonctionne qu'avec la version installée de Picard. Elle ne fonctionnera pas avec les versions portables ou Windows Store.

source: macOS Systems
fr: Systèmes macOS

source: First open a terminal window by doing one of the following:
fr: Ouvrez d'abord une fenêtre de terminal en effectuant l'une des opérations suivantes :

source: Click the Launchpad icon in the Dock, type "Terminal" in the search field, then click :guilabel:`Terminal`.
fr: Cliquez sur l'icône Launchpad dans le Dock, tapez "Terminal" dans le champ de recherche, puis cliquez sur :guilabel:`Terminal`.

source: In the Finder, open the "/Applications/Utilities" folder, then double-click "Terminal".
fr: Dans le Finder, ouvrez le dossier "/Applications/Utilities", puis double-cliquez sur "Terminal".

source: Assuming Picard was put into the system wide Applications folder when installed, it can then be started by entering the following in the terminal window:
fr: Si Picard a été placé dans le dossier Applications du système lors de l'installation, il peut être démarré en entrant la commande suivante dans la fenêtre du terminal :

source: This will display all log entries in the terminal window, and allow you to copy the information to the clipboard to paste into your report.
fr: Cela affichera toutes les entrées du journal dans la fenêtre du terminal et vous permettra de copier les informations dans le presse-papiers pour les coller dans votre rapport.

source: Linux Systems
fr: Systèmes Linux

source: First open a Terminal window in your desktop environment, either from the Applications menu or by pressing :kbd:`Ctrl+Alt+T` on most systems. Then start Picard by entering the following in the terminal window:
fr: Ouvrez d'abord une fenêtre de terminal dans votre environnement de bureau, soit à partir du menu Applications, soit en appuyant sur :kbd:`Ctrl+Alt+T` sur la plupart des systèmes. Ensuite, démarrez Picard en entrant ce qui suit dans la fenêtre du terminal :

source: Specific situations: :doc:`/troubleshooting/does_not_start` / :doc:`/troubleshooting/no_coverart` / :doc:`/troubleshooting/missing_tags` / :doc:`/troubleshooting/not_saving` / :doc:`/troubleshooting/stopped_working` / :doc:`/troubleshooting/macos_startup_error`
fr: Situations spécifiques: :doc:`/troubleshooting/does_not_start` / :doc:`/troubleshooting/no_coverart` / :doc:`/troubleshooting/missing_tags` / :doc:`/troubleshooting/not_saving` / :doc:`/troubleshooting/stopped_working` / :doc:`/troubleshooting/macos_startup_error`
