Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/workflows/workflow_cd.po
Languages: fr

source: :index:`When the CD is available <workflows; cd>`
fr: :index:`Lorsque le CD est disponible <workflows; cd>`

source: This is perhaps the best case scenario, because it provides the greatest chance of tagging your music files with the most accurate match from the MusicBrainz database. It is also one of the easier methods for looking up the release.
fr: C'est peut-être le meilleur scénario, car il offre les meilleures chances de marquer vos fichiers musicaux avec la correspondance la plus précise de la base de données MusicBrainz. C'est également l'une des méthodes les plus simples pour rechercher la parution.

source: **1. Rip the CD to music files**
fr: **1. Ripper le CD en fichiers musicaux**

source: Extract the music filed from the CD using your favorite ripping program (e.g.: `Exact Audio Copy <http://exactaudiocopy.de/>`_ for Windows, `X Lossless Decoder (XLD) <https://tmkk.undo.jp/xld/index_e.html>`_ for macOS, or `Whipper <https://github.com/whipper-team/whipper>`_ for Linux). The format for the output files depends on your personal preference and the formats supported by your player. A popular format is FLAC, which is a compressed lossless format.
fr: Extrayez les fichiers musicaux du CD en utilisant votre programme d'extraction préféré (par exemple: `Exact Audio Copy <http://exactaudiocopy.de/>`_ pour Windows, `X Lossless Decoder (XLD) <https://tmkk.undo.jp/xld/index_e.html>`_ pour macOS, ou `Whipper <https://github.com/whipper-team/whipper>`_ pour Linux). Le format des fichiers de sortie dépend de vos préférences personnelles et des formats pris en charge par votre lecteur. Un format populaire est FLAC, qui est un format compressé sans perte.

source: **2. Lookup the CD on MusicBrainz**
fr: **2. Recherchez le CD sur MusicBrainz**

source: With the CD in the drive, it can be looked up automatically using the :menuselection:`"Tools --> Lookup CD"` command. See the :doc:`/usage/retrieve_lookup_cd` section for detailed instructions.
fr: Avec le CD dans le lecteur, il peut être recherché automatiquement à l'aide de la commande :menuselection:`"Outils --> Rechercher un CD"`. Voir la section :doc:`/usage/retrieve_lookup_cd` pour des instructions détaillées.

source: **3. Select the correct release**
fr: **3. Sélectionnez la parution appropriée**

source: A list of all releases matching the toc of the CD will be displayed for selection, with an option to submit the disc id if none of the releases are a match to your CD. Before proceeding, please check to ensure that the release you select properly matches your CD (e.g.: release country, date and label, catalog number, barcode, media type, and cover art). This is especially important if you are going to submit any information such as acoustic features to AcousticBrainz or AcoustID fingerprints.
fr: Une liste de toutes les parutions correspondant au toc du CD sera affichée pour sélection, avec une option pour soumettre l'identifiant du disque si aucune des parutions ne correspond à votre CD. Avant de poursuivre, vérifiez que la parution que vous sélectionnez correspond bien à votre CD (par exemple : pays de sortie, date et étiquette, numéro de catalogue, code-barres, type de support et couverture). Ceci est particulièrement important si vous avez l'intention de soumettre des informations telles que les caractéristiques acoustiques à AcousticBrainz ou les empreintes AcoustID.

source: **4. Load the files**
fr: **4. Chargez les fichiers**

source: Drag the files or folder from the browser to the "Unclustered Files" section in the left-hand pane. You do not need to scan or cluster them.
fr: Faites glisser les fichiers ou le dossier du navigateur vers la section "Fichiers non groupés" dans le volet de gauche. Vous n'avez pas besoin de les analyser ou de les regrouper.

source: **5. Match the files to the tracks on the release**
fr: **5. Faites correspondre les fichiers aux pistes de la parution**

source: Drag the files from the left-hand pane and drop them on the release in the right-hand pane. Check that each track on the release is associated with only one file. The release icon should turn gold. See the :doc:`/usage/match` section for details.
fr: Faites glisser les fichiers du volet de gauche et déposez-les sur la parution dans le volet de droite. Vérifiez que chaque piste de la parution est associée à un seul fichier. L'icône de parution devrait devenir dorée. Voir la section :doc:`/usage/match` pour plus de détails.

source: **6. Verify the metadata and cover art**
fr: **6. Vérifiez les métadonnées et la pochette**

source: Check that the metadata and cover art image for the release and tracks are what you want. Adjust if required. See the :doc:`/usage/coverart` section for details.
fr: Vérifiez que les métadonnées et l'image de la pochette de la parution et des pistes correspondent à vos souhaits. Ajustez si nécessaire. Voir la section :doc:`/usage/coverart` pour plus de détails.

source: **7. Save the files**
fr: **7. Enregistrez les fichiers**

source: Save the files using the :menuselection:`"File --> Save"` command. See the :doc:`/usage/save` section for details.
fr: Enregistrez les fichiers à l'aide de la commande :menuselection:`"Fichier --> Enregistrer"`. Voir la section :doc:`/usage/save` pour plus de détails.

source: **8. Calculate and submit AcoustID fingerprints**
fr: **8. Calculer et soumettre les empreintes digitales AcoustID**

source: :index:`This step is optional <acoustic fingerprint; submitting>`, but appreciated because it will help identify the files for others to look up for tagging.
fr: :index:`Cette étape est facultative <empreinte digitale acoustique; soumission>`, mais appréciée car elle aidera à identifier les fichiers que d'autres pourront rechercher pour le marquage.

source: Select the album entry in the right-hand pane and calculate the AcoustID fingerprints using :menuselection:`"Tools --> Generate AcoustID Fingerprints"`. Once the fingerprints have been calculated, submit them using :menuselection:`"Files --> Submit AcoustIDs"`.
fr: Sélectionnez l'entrée de l'album dans le volet de droite et calculez les empreintes AcoustID à l'aide de :menuselection:`"Outils --> Générer des empreintes AcoustID"`. Une fois les empreintes calculées, soumettez-les en utilisant :menuselection:`"Fichiers --> Soumettre les AcoustIDs"`.

source: AcoustID fingerprints should only be submitted after the files have been tagged with MusicBrainz metadata, and you have verified that the files have been matched to the correct track on the proper release.
fr: Les empreintes digitales AcoustID ne doivent être soumises qu'après que les fichiers ont été étiquetés avec les métadonnées MusicBrainz et que vous avez vérifié que les fichiers ont été mis en correspondance avec la bonne piste dans la parution appropriée.
