Repository: metabrainz/picard-docs
Catalog: _locale/*/LC_MESSAGES/workflows/workflow_metadata.po
Languages: fr

source: :index:`When files are not grouped but have some metadata <workflows; files not grouped>`
fr: :index:`Lorsque les fichiers ne sont pas groupés mais ont des métadonnées <flux de travail; fichiers non groupés>`

source: In this situation, you will need to feed batches of files to Picard to process. In order to minimize the performance impact, it is recommended to keep the batches relatively small (i.e.: approximately 200 files at most in a single batch). Picard will try to group them into clusters based on the metadata currently existing in the files.
fr: Dans cette situation, vous devrez envoyer des lots de fichiers à Picard pour les traiter. Afin de minimiser l'impact sur les performances, il est recommandé de garder les lots relativement petits (c'est-à-dire: environ 200 fichiers au maximum dans un seul lot). Picard essaiera de les regrouper en clusters en fonction des métadonnées existant actuellement dans les fichiers.

source: This workflow will likely only partially match the files to a release in each batch processed. This means that an album may not be fully matched, tagged and renamed until multiple batches have been processed.
fr: Ce flux de travail ne fera probablement correspondre que partiellement les fichiers à une version dans chaque lot traité. Cela signifie qu'un album peut ne pas être entièrement mis en correspondance, étiqueté et renommé tant que plusieurs lots n'ont pas été traités.

source: **1. Load the files**
fr: **1. Chargez les fichiers**

source: Drag the batch of files to process from the browser to the "Unclustered Files" section in the left-hand pane.
fr: Faites glisser le lot de fichiers à traiter du navigateur vers la section "Fichiers non groupés" dans le volet de gauche.

source: **2. Cluster and lookup the files**
fr: **2. Regrouper et rechercher les fichiers**

source: Select the files in the left-hand pane and combine them into album clusters using the :menuselection:`"Tools --> Cluster"` command. Picard will attempt to cluster the files based on their existing metadata. Select the desired cluster(s) in the left-hand pane and initiate the lookup using the :menuselection:`"Tools --> Lookup"` command. See the :doc:`/usage/retrieve_lookup` section for details.
fr: Sélectionnez les fichiers dans le volet de gauche et combinez-les en groupes d'albums à l'aide de la commande :menuselection:`"Outils --> Cluster"`. Picard tentera de regrouper les fichiers en se basant sur leurs métadonnées existantes. Sélectionnez les groupes souhaités dans le volet gauche et lancez la recherche à l'aide de la commande :menuselection:`"Outils --> Recherche"`. Consultez la section :doc:`/usage/retrieve_lookup` pour plus de détails.

source: **3. Match the files to the tracks on the release**
fr: **3. Faites correspondre les fichiers aux pistes de la version**

source: Drag the files from the left-hand pane and drop them on the release in the right-hand pane. Check that each track on the release is associated with only one file. The release icon will likely remain silver, indicating that not all tracks have been matched to files. See the :doc:`/usage/match` section for details.
fr: Faites glisser les fichiers du volet de gauche et déposez-les sur la version dans le volet de droite. Vérifiez que chaque piste de la version est associée à un seul fichier. L'icône de version restera probablement argentée, indiquant que toutes les pistes n'ont pas été associées aux fichiers. Voir la section :doc:`/usage/match` pour plus de détails.

source: **4. Verify the metadata and cover art**
fr: **4. Vérifiez les métadonnées et la pochette**

source: Check that the metadata and cover art image for the release and tracks are what you want. Adjust if required. See the :doc:`/usage/coverart` section for details.
fr: Vérifiez que les métadonnées et l'image de la pochette de la parution et des pistes correspondent à vos souhaits. Ajustez si nécessaire. Voir la section :doc:`/usage/coverart` pour plus de détails.

source: **5. Save the files**
fr: **5. Enregistrez les fichiers**

source: Save the files using the :menuselection:`"File --> Save"` command. See the :doc:`/usage/save` section for details.
fr: Enregistrez les fichiers à l'aide de la commande :menuselection:`"Fichier --> Enregistrer"`. Voir la section :doc:`/usage/save` pour plus de détails.

source: It is not recommended to submit AcoustID fingerprints for files matched in this way, because it is virtually impossible to verify that your files actually match the recordings being matched.
fr: Il n'est pas recommandé de soumettre des empreintes digitales AcoustID pour les fichiers correspondants de cette manière, car il est pratiquement impossible de vérifier que vos fichiers correspondent réellement aux enregistrements correspondants.
